[{"appId": "mobi.androidcloud.app.ptt.client", "category": "Communication", "company": "TiKL Inc", "contentRating": "Low Maturity", "description": "â˜… Over 25 million users worldwide and countingâ˜… Named \"Top Developer\" by Google.â˜… Featured in the book \"Amazing Android Apps for Dummies\"â˜… Top communication/social app for yearsâ˜…Â Completely FREE. No hidden fee or ads.Instantly speak to or text one or many friends at once with the touch of a button. No setup needed, just have them in your address book or as Facebook friends. Fast and simple - TiKL turns your phone into the ultimate Push To Talk (PTT) Walkie Talkie with instant messenger capability.â˜… Quick one-on-one/group voice push-to-talk calls.â˜… Lightning fast chat with delivery confirmation.â˜… Uses data connection only. No voice minutes or SMS used for TiKL calls or chats.â˜… Works across carriers and Android/iPhone/iPad/iPod Touch.â˜… Connects on WiFi, 3G, 4G, EDGE and GPRS.â˜… Create widgets by long pressing any blank space on your home screen.â˜… What if their device is off? No worries. TiKL automatically delivers your messages the moment it is turned on.We are on Facebook and Twitter:http://www.tikl.mobihttp://www.facebook.com/TiKL.TouchToTalkhttp://twitter.com/TiKLTouchToTalkTo ensure that you do not miss any incoming TiKL calls or chats, please launch the app at least once after installing/upgrading it.If things don't work after updating, please uninstall and reinstall.", "devmail": "tikl.mobi@gmail.com", "devprivacyurl": "N.A.", "devurl": "http://www.tikl.mobi&sa=D&usg=AFQjCNGupamc_eLPS-cRmUHk3fRFQwGerw", "id": "mobi.androidcloud.app.ptt.client", "install": "10,000,000 - 50,000,000", "moreFromDev": "None", "name": "TiKL Touch Talk Walkie Talkie", "price": 0.0, "rating": [[" 5 ", 90834], [" 2 ", 3868], [" 3 ", 14854], [" 4 ", 33544], [" 1 ", 6370]], "reviews": [["Excellent/Brilliant", "  I've recommended this app to all my friends n employers (past/present) ..... Best thing sence sliced bread, lol...... I've been thru 3 phones n each time the first app I go for is the TiKl talk app is far more superior.... It's the Miami Heat of push to talk apps .... Great job !!! Consider this 20 extra stars.... "], ["Like the app", "  I like this app not the best yet and could use some work like being able to turn the notification off, bring able to resend message that don't go tru. also my phone deletes messages on oit's own. better archiveing for incoming voice message do if i miss one i can replay it "], ["Can't use with daughter", "  I would rate this 5 stars but my daughter can't download this on her Galaxy phone. that was the only reason I wanted it was to keep in contact with her. "], ["Doesn't work.", "  It just says TIKL is optimizing, and won't ever open into the program anymore. "], ["Worked for over 7yrs", "  It now consumes too much power.  If it gets fixed ill get it again "], ["Horrible app", "  Only works some times and if you miss someone you miss them no way to replay the message and you can't pick anyone in your list and no way to put it on mute "]], "screenCount": 5, "similar": ["com.kakao.talk", "jp.naver.line.android", "org.mozilla.firefox", "com.keechat.client", "com.talkray.client", "com.loudtalks", "com.google.android.talk", "com.vomessenger.client", "com.android.chrome", "com.antivirus", "com.google.android.gm", "cl.nextel", "com.facebook.orca", "com.rebelvox.voxer", "com.viber.voip", "com.whatsapp", "com.apdroid.tabtalk", "com.tencent.mm", "com.skype.raider"], "size": "2.2M", "totalReviewers": 149470, "version": "2.19"}, {"appId": "com.yahoo.mobile.client.android.imvideo", "category": "Communication", "company": "Yahoo", "contentRating": "Medium Maturity", "description": "This plug-in enables voice and video  calls in the Yahoo! Messenger app********* IMPORTANT *********1. This is not a launchable app on its own, you need to install Yahoo! Messenger to enable the call features2. To call, press the menu button in a Messenger conversation and tap the voice or video option3. Video is only supported on Android OS 2.2+ (except for MyTouch 4G & EVO 4G where OS 2.3+ is required)4. Yahoo! Messenger 1.5 and higher 5. The other user needs to use Yahoo! Messenger for Android, iPhone or Windows PCVideo calling is in beta. We are aware of incoming call volume issues and we will be addressing those soon. Help us improve the product by providing feedback and specific failed scenarios with device information to: androidimfeedback@yahoo.com. Thanks!", "devmail": "androidimfeedback@yahoo.com", "devprivacyurl": "N.A.", "devurl": "http://mobile.yahoo.com/messenger/android&sa=D&usg=AFQjCNEOro2as1alpt31wQNl1yP8Wl-rbw", "id": "com.yahoo.mobile.client.android.imvideo", "install": "10,000,000 - 50,000,000", "moreFromDev": ["com.yahoo.mobile.client.android.fantasyfootball", "com.yahoo.mobile.client.android.search", "com.yahoo.mobile.client.android.fantasybaseball", "com.yahoo.connectedtv.yremote", "com.yahoo.mobile.client.android.fantasybasketball", "com.yahoo.mobile.client.android.yahoo", "com.yahoo.mobile.client.android.weather", "com.yahoo.mobile.client.android.flickr", "com.yahoo.mobile.client.android.finance", "com.yahoo.mobile.client.android.mail", "com.yahoo.mobile.client.android.im", "com.yahoo.cricket.ui"], "name": "Yahoo Messenger Plug-in", "price": 0.0, "rating": [[" 4 ", 18236], [" 2 ", 3809], [" 5 ", 62143], [" 1 ", 9968], [" 3 ", 10133]], "reviews": [["App doesn't work most of the time on my Android", "  Sometimes, (not often) the voice call feature works, but then it hangs up on you in the middle of the conversation and you have to hope you can call the person back. Text messages sent or received sometimes take a day to arrive. I can't post this unless I give it at least 1 star, but this app doesn't even deserve that. If it gets fixed I'll update my review. "], ["Unable to use video chat/call", "  i have tested extensively on different HW. The video chat does not work between android and windows OS versions. Is there work in progress to fix this issue? RR "], ["not compatible with the galaxy tab.", "  it is nice to know the glitch has been fixed, but i can't install. The update to use it. You fixed one issue just to create new one.issue "], ["Camera issues with galaxy tab 7.7 and Does not let you type whilst watching ...", "  Camera issues with galaxy tab 7.7 and Does not let you type whilst watching cam\tEven though you state the camera orientation issue has been sorted I am still seeing an issue with the Samsung galaxy tab 7.7. I am always on my side no matter whether I hold the tablet in landscape on portrait mode. Also some times you can't chat on voice but need to text chat while viewing cam. I please make this possible "], ["What just happened?", "  I tried to accept an incoming video request and not only would it not work on my Verizon Galaxy S 3 but when I didn't reject the request it kept ringing even after I logged out of Messenger until I rebooted the phone. "], ["What makes it worse", "  Is that I can't uninstall any yahoo apps even though i'm done trying them so they just keep turning themselves on and eating on my ram. I can ofcourse work around it but shouldn't have to. A big thanks to HTC for adding all this bloat and making your phones the hardest to root "]], "screenCount": 2, "similar": ["com.kakao.talk", "cn.msn.messenger", "com.synchronica.im", "com.nimbuzz", "com.wHotmailLiveMessenger", "com.protrade.sportacular", "com.spartanbits.gochat.yahoomessenger", "com.ebuddy.android", "com.beejive.im.yahoo", "com.facebook.orca", "com.whatsapp", "im.mercury.android", "com.intonow", "com.chikka.gero", "net.daum.android.air", "com.catfiz", "com.skype.raider", "kik.android"], "size": "6.0M", "totalReviewers": 104289, "version": "1.6.0"}, {"appId": "com.moplus.gvphone", "category": "Communication", "company": "Mo+", "contentRating": "Low Maturity", "description": "With your Google Talk/Voice account, you can call and text your GTalk friends and any number in the US and Canada for FREE!  Wherever you go, as long as you have internet access, free phone calls and texting (to North America) are right at your fingertips!Why you should choose Mo+:- Free. All the services of voice calls and texting are as FREE as you believe!- Always online. Call, chat and get connected with your GTalk friends, wherever you go.- High-quality voice calls. The services provided by Mo+ include high-quality voice calls which can enable you to chat with your friends just like face to face.- Easy to use. Start calling or texting with minimum tap.More features coming soon... Stay tuned!Keywords:mo+, moplus, message, messenger, phone, talk, chat, mobile, SMS, voice, dial, communication, social", "devmail": "info@mopl.us", "devprivacyurl": "N.A.", "devurl": "http://mopl.us&sa=D&usg=AFQjCNEurZNufclxUAQbAKUYSqv3yRzH5w", "id": "com.moplus.gvphone", "install": "100,000 - 500,000", "moreFromDev": ["com.moplus.moplusapp"], "name": "PHONE for Google Voice & GTalk", "price": 0.0, "rating": [[" 1 ", 605], [" 5 ", 13535], [" 4 ", 2805], [" 2 ", 330], [" 3 ", 1026]], "reviews": [["Missing Voice mail, Cant change status", "  Good app with clean interface. But missing two important features:  1- You cant access your GV Voice Mail 2- You cant change your status it's either Available or Busy with \"mo+ ... free calls\" status Moved to talkatone "], ["Love it but....", "  Awesome! But doesnt seem to hold calls to well also has a delay in call responses..hate having to repeat myself other than that its what i needed regarding businesses and getting in contact with clients asap. Overall its definitely worth the down load and its freeeeee! :) "], ["My phone is now complete.", "  Finally, an app to call over wifi!  This is absolutely terrific for many reasons.  Just think for 10 seconds and you'll find some great uses for it.  Now all those pesky cell phone companies have something to worry about!  :) "], ["Decent. Call quality could be better", "  Sometimes the calls aren't very clear. Texts go right through. Not bad "], ["Good but needs lots of improvement", "  The app could be a lot helpful sometimes and sometimes its just irritating. There's no volume control and volume control on my device, headset or Bluetooth won't work on it so I hear crazily loud voice from the other end. Also, network has to be really good to enjoy it otherwise there will be lots of waiting time for response. Overall I rate the app slightly above average. "], ["Good app with caveat", "  Doesn't work very well over 3G. Calls are delayed 3-5 seconds. However, it works very well over wifi and serves it's intended purpose very well. For a free app it is fantastic. "]], "screenCount": 5, "similar": ["hu.xilard.voiceplus", "jp.naver.line.android", "org.mozilla.firefox", "com.facebook.orca", "larry.zou.colorfullife", "net.init0.android.liveware.extension.gtalknotifier", "com.google.android.talk", "com.android.chrome", "com.kakao.talk", "com.alpha.chatxmpp", "com.talkatone.android", "com.viber.voip", "com.whatsapp", "com.skymobius.vtok", "com.google.android.apps.googlevoice", "com.skype.raider"], "size": "8.8M", "totalReviewers": 18301, "version": "1.0.6"}, {"appId": "com.sec.chaton", "category": "Communication", "company": "Samsung Electronics Ltd.", "contentRating": "Medium Maturity", "description": "ChatON is a global mobile messenger for various platform users in the world.ChatON is installed on Samsung smart phones on over 300 million devices, (Galaxy Note3, Galaxy S4, Galaxy S3, Galaxy Note2, Galaxy Camera). ChatON is being serviced in 237 countries in 67 languages on 9 platforms including Android, iOS, and the web. ChatON  has been downloaded over 130 million times by 130 million users, which now can be accessed simply with a phone number. With a Samsung account, users can enjoy ChatON on smart phones, tablets, and computers. ChatON features free messaging, free voice/video calls, sending handwritten messages, sharing location/videos/images on PostON, and useful live tips, which is the best social service to communicate with friends in 237 countries around the world. Start now!â˜… Are anicons free?- ChatON provides all anicons for free. Express yourself to friends or groups of friends and share your life with them using various anicons!â˜… Can I communicate with non-ChatON users?- Yes, ChatON supports the function of SMS/MMS integration so you can send and receive messages with non-ChatON users. (Only in specific countries)* SMS/MMS functions may not work by device or carrier.* ChatON SMS/MMS version offers the best performance on Samsung Galaxy S3, S4 and Galaxy Note 2, 3.(with Android ICS or higher OS version installed)* If you install other SMS applications(i.e. Facebook messenger, Hangout, Go SMS, and etc.) on your device which has ChatON SMS/MMS version, text messages received as SMS or MMS might be displayed abnormally. In this case, please choose not to get notifications about SMS through other applications in 'Settings' of each service. â˜… I lost my phone?- Don't worry. We've saved all your buddies and chatting history within the past 15 days. Chat with the same buddies and you can even check chatting history on ChatON Web version (web.samsungchaton.com)â˜… Can I translate messages in ChatON?- Chat with friends speaking other languages using the Auto translation function. (To and from Korean, Chinese, Japanese, English / From German, Russian, French, Spanish, Italian, and Portuguese to English, and vice versa)â˜… Can I use ChatON on smart phones and tablets?-You can enjoy ChatON on smart phones, tablets, and PCs(up to 5 devices) by signing in with a Samsung account.", "devmail": "chaton@samsung.com", "devprivacyurl": "N.A.", "devurl": "http://www.chaton.com&sa=D&usg=AFQjCNG8wUti7vYKlVic7E6pCslC4PnBEQ", "id": "com.sec.chaton", "install": "100,000,000 - 500,000,000", "moreFromDev": ["com.sec.spp.push"], "name": "ChatON", "price": 0.0, "rating": [[" 2 ", 4028], [" 3 ", 11102], [" 1 ", 17946], [" 5 ", 69259], [" 4 ", 17457]], "reviews": [["Still Useless &  NOT Even Wanted", "  I don't use it, no one I know uses it. I think it's a waist of space and memory and still think the permissions is outrageous. Please for the love of it stop updating this useless app no one wants. "], ["Worst...", "  Wtf is happening man? I cant use it without updating it.msges are reaching very late.so how can we use it rather than whatsapp or we chat?? Sorry there is no option for 0 stars so I give 1. "], ["Senseless Bloatware", "  I understand you guys make this stuff in hopes that we will love it. But you might want to consider allowing your preinstalled apps to be deleted. This is the reason why I will be rooting this pos phone because of all the bloat. Maybe if you allowed your bloat to be uninstalled you would have a lot less rooting going on. And I'm not worried about killing my \"warranty\" had this phone for a week and had issues and was not covered by your so called warranty.  Cant wait to upgrade back to HTC. "], ["Don't want it", "  Why do Samsung insist on installing a load of second rate software?  It's cluttet I don't want. It's annoying that it keeps updating. It's ugly too. Please let me uninstall and I might get another Samsung device... "], ["Still a waste of memory", "  Don't use it, don't want it, can't remove it. No one i know uses it. Grr. I'd give it 0 stars if that was an option. "], ["PLEASE allow uninstall", "  For thos of us who do NOT use this app nor want to why do we keep needing to update I would LOVE an option to uninstall and free up space on My phone as I would much rather use the space for a app I prefer to use PLEASE! !!!!!! "]], "screenCount": 8, "similar": ["jp.naver.line.android", "com.kakao.talk", "com.handmark.friendcaster.chat", "com.nimbuzz", "com.google.android.talk", "com.spartancoders.gtok", "com.android.chrome", "com.google.android.gm", "com.androidsx.smileys", "com.facebook.orca", "com.viber.voip", "com.whatsapp", "com.bbm", "com.tencent.mm", "com.skype.raider", "kik.android"], "size": "Varies with device", "totalReviewers": 119792, "version": "Varies with device"}, {"appId": "com.connectivityapps.hotmail", "category": "Communication", "company": "Connectivity Apps", "contentRating": "Low Maturity", "description": "Hotmail Connect gives you easy access to your mail - everywhere! This app is always synchronized and notifies you when new mails arrive. If you have tips or comments - please send me an email!", "devmail": "connectivity.apps@gmail.com", "devprivacyurl": "N.A.", "devurl": "N.A.", "id": "com.connectivityapps.hotmail", "install": "100,000 - 500,000", "moreFromDev": ["com.connectivityapps.outlook"], "name": "Hotmail Connect", "price": 0.0, "rating": [[" 4 ", 91], [" 1 ", 45], [" 5 ", 214], [" 3 ", 33], [" 2 ", 19]], "reviews": [["you should put a button to empty inbox.. because it's hard when we want ...", "  you should put a button to empty inbox..  because it's hard when we want to delete to many messages.  Everything else pretty ok. "], ["2 thumbs up!!!", "  Even though I've only had this installed or a day, I have to say that I really like the ability to access my Hotmail account and have it updated on my S4 w/out having to switch everything over to a different email account. "], ["Does what it says :-) works well", "  Works very well and very fast . Keep up the good work guys :-) "], ["Multiple Accounts", "  Had an old version of this that was ace as i could have multiple accounts. Either this app assumes you only have one email address or i am missing something. "], ["Rarely works", "  Not a real app, it just hijacks the hotmail website.  But mostly it just displays webpage not loaded screen with a banner add. "], ["Pfft", "  Falls down at start, after inputting all details how are you supposed to start the app no ok button, dont bother. "]], "screenCount": 3, "similar": ["org.mozilla.firefox", "com.dreamstep.wWindowsLiveMSN", "cn.msn.messenger", "jp.tech4u.inspmode", "com.wHotmailLiveMessenger", "com.outlook.Z7", "jp.co.nttdocomo.carriermail", "com.bludroid.blaze", "com.blustudio.mails", "net.pocketmob.hotquick", "com.app.inboxproforhotmail", "com.mobiletecnoapps.multiplemails", "com.hotmailliveemailnumber2", "com.dreamstep.wSimpleHotmailClient", "com.blustudio.email", "com.womboidsystems.HotmailToOutlook2013"], "size": "553k", "totalReviewers": 402, "version": "2.3"}]