[{"appId": "com.facebook.orca", "moreFromDev": ["com.facebook.pages.app", "com.facebook.katana", "com.facebook.home"], "reviews": [["I do not like this messenger, Switch it back or make it the same ...", "  I do not like this messenger, Switch it back or make it the same as before\tThe older version of this app worked way better with my phone now. Even though it says the contacts are synced it not. And more importantly none of my sms txt pops up in the app or via chathead "], ["Already read chats shouldn't re notify", "  App shouldn't notify about the chats I have read on web already, notifications start and continue till app checks all the messages and figures I have read them all.. its really annoying. 5 stars when this check is implemented in background instead of fore.. "], ["Sucks", "  Id rather have given in NO stars. Just downloaded not even 20 minutes ago. Wont even open. Have to force close. Urg! Stop doing update so people can actualy use stuff. This is one reason id rather say screw it and toss my phone in the trash. "], ["no log out Option", "  No logout?! I like the new aesthetics, but where is the logout/exit?! I don't want messenger to be on all the time, only when I want to message friends. The old version of messenger had it,  Itz uselss without LOg Out Option "], ["No logout?!", "  I like the new aesthetics, but where is the logout/exit?! I don't want messenger to be on all the time, only when I want to message friends. The old version of messenger had it, but right now I have to hit force-stop from settings->apps. "], ["Htc Desire x", "  I Do Not Like This New Messenger The Oldest Version were Aswam With that version i could text my Facebook friends and my text massages but with this new version its impossible to do and why cant i log out my Facebook account in this new version  :X "]], "similar": ["jp.naver.line.android", "app.fastfacebook.com", "com.fbchat", "cn.msn.messenger", "net.ryjsoftware.flite", "com.spartancoders.gtok", "com.ebuddy.android", "com.facelite", "com.nimbuzz", "kr.co.datawave.facechat", "com.viber.voip", "com.whatsapp", "com.bbm", "com.yahoo.mobile.client.android.im", "com.skype.raider", "kik.android"]}, {"appId": "com.skype.raider", "moreFromDev": ["com.skype.android.access"], "reviews": [["Skype contacts issues", "  Skype for mobile or PC, contact management system kinda sucks..  Needs to work like other contacts management systems, maybe like Google Gmail Contacts?? Or Go Contacts Ex, etc..  Needs export / inport to cvs, excel, or MS Outlook like custom fields, etc.  Am I missing something? "], ["Not compatible for ipad & android tab users", "  I am using galaxy tab3 while a friend is using apple ipad. We tried using this app for a video call. He can see me but what i can see from his incoming video is his forehead only??? Duh?! What'S the use of video call if we can't see each other's face? Please fix... "], ["Can't log in", "  Not very useful if I can't even log in using my Microsoft account. After I enter my username and password, it kicks me back out to the main screen where it asks if I want to create an account or log in. Does anyone even test this before release? "], ["Fix this please!!!", "  Why can't i log in using my lenovo tab?.. always unable to log in.. check you mobile settings.. and when i'm using my galaxy y i thought that i'm online because there's the logo showing i'm online.. when i open it i saw a lot of missed calls but it never ring.. "], ["Even if you just use a Skype ID...", "  ...it still doesn't work. I was logged in via desktop and Android app at the same time. Called my Skype number from another phone. Desktop version showed an incoming call, but no such thing from my Nexus 5 that was running the Skype app. I pay for this service for work - this is completely unacceptable. "], ["Any chance of setting up the notification to say if someone comes online for ...", "  Any chance of setting up the notification to say if someone comes online for 1 or 2 min before switching to 'online' again. Isn't very usefull now "]], "similar": ["jp.naver.line.android", "com.kakao.talk", "org.mozilla.firefox", "com.sec.chaton", "com.imo.android.imoim", "com.google.android.talk", "in.tk.videocalling", "com.sgiggle.production", "com.facebook.orca", "com.viber.voip", "com.whatsapp", "com.nimbuzz", "com.bbm", "com.tencent.mm", "com.android.chrome", "kik.android"]}, {"appId": "kik.android", "moreFromDev": "None", "reviews": [["Shawn_Nobles93", "  Hey, new to kik. Add me. Just want people to talk to. I live around new Hanover county, and Brunswick county. If you have to ask where that is. Please don't try to add me "], ["Only_The_Real_Thing", "  Plz don't kik dirty things to me. I'm only talking to ppl who wanna talk might be in new york or new Jersey.  And I'm a Lesbian so, yeah. Clean stuff, only 13-17. Thanks "], ["Haydenlee26", "  14 y\\o male from Australia. Wanting more people talk to. Clean only. I trade pics. Please only 13-16 Please no guys. Only new so umm message me :). MotoX for life... Also add my friend chris he only just got kik so message him. "], ["Doesn't show up in my notification menu any more", "  After the latest update my new messages won't give me a push notification in my drop down menu. Please help? Samsung galaxy s2 epic: android 4:1:x "], ["Privacy!", "  I wish kik had a privacy feature where people who aren't in your contacts can't message you. My kik has been given out over the internet by random people. I don't want to make a new one. Please add some privacy features. "], ["Can't see my friends anymore!", "  I been playing this game for the last few days and everything was okay until the last update and now I can't trade with like half of my friends!! Since they got removed from the friend bar for some reason!!! FIX AND I'LL GIVE 5 STARS!!!! "]], "similar": ["jp.naver.line.android", "com.kakao.talk", "cn.msn.messenger", "com.nimbuzz", "com.nixpa.kik.video", "com.ebuddy.android", "com.bsb.hike", "com.facebook.orca", "com.bbm", "com.whatsapp", "com.viber.voip", "net.daum.android.air", "com.tencent.mm", "com.yahoo.mobile.client.android.im", "com.skype.raider", "se.outputstream.recorderforkik"]}, {"appId": "com.whatsapp", "moreFromDev": "None", "reviews": [["Android 4.4 ART support please", "  I'd like to use Whatsapp on my Nexus 5 with the new ART runtime environment, sadly, Whatsapp is one of the few apps that does not work under ART.  Other chat programs have no issue, including BBM and Viber, so I don't know what Whatsapp issue is, but I hope it gets sorted out soon. "], ["AnwarArts.", "  working smothly with giving a lots of good exprrience..but only can not move to sd card..  I provided 2 STARS , 5 can be given if more improvment. ThAnKs. "], ["Please update so it will be compatible with Kitkat 4.4.", "  I'm using Nexus 4 and just updated to 4.4, and I was trying to install whatsapp but it's always giving me install error. "], ["blue video", "  Since last update all my videos are blue. They are ok from gallery, but if I send it to some one its appears blue. Waiting for new update then will rate 5 stars! "], ["Let us move app to SD", "  Just one more thing, just let your app can be moveable to the SD card. If not our internal memory will be insufficient. "], ["Its that true or fakeo", "  Message from Jim Balsamic (CEO of Whatsapp) we have had an over usage of user names on whatsapp Messenger. We are requesting all users to forward this message to their entire contact list. If you do not forward this message, we will take it as your account is invalid and it will be deleted within the next 48 hours. Please DO NOT ignore this message or whatsapp will no longer recognise your activation. If you wish to re-activate your account after it has been deleted, a charge of 25.00 will be added to your "]], "similar": ["jp.naver.line.android", "com.whatsapp.wallpaper", "app6910.vinebre", "com.albertoj.whatsappghost", "com.google.android.talk", "com.android.chrome", "com.yahoo.mobile.client.android.im", "com.facebook.orca", "com.facebook.katana", "com.viber.voip", "Box.Dynamics.WhatsFun", "com.nimbuzz", "com.bbm", "com.tencent.mm", "com.mizusoft.android.paint", "com.skype.raider", "kik.android"]}, {"appId": "com.yahoo.mobile.client.android.mail", "moreFromDev": ["com.yahoo.mobile.client.android.fantasyfootball", "com.yahoo.mobile.client.android.search", "com.yahoo.mobile.client.android.fantasybaseball", "com.yahoo.connectedtv.yremote", "com.yahoo.mobile.client.android.fantasybasketball", "com.yahoo.mobile.client.android.flickr", "com.yahoo.mobile.client.android.weather", "com.yahoo.mobile.client.android.yahoo", "com.yahoo.mobile.client.android.finance", "com.yahoo.mobile.client.android.imvideo", "com.yahoo.mobile.client.android.im", "com.yahoo.cricket.ui"], "reviews": [["Good, but with some flaws...", "  It's a overall fast, smooth experience, but there areas that need serious improvements.  - No option to have grouped messages like gmail. - The notifications on Android when you swipe down the notification to show more, only shows one line. On gmail and the general mail app, it show like 4 or 5 lines of the message.  Also on notifications with more mails to read, like 4 mails, it only shows the first line of the first and the number of the unread, on gmail it shows the subject of every message.  Also on notifications when you tap the message it should open message on the yahoo mail app, and not the general mail inbox list of the yahoo mail app. "], ["Good Update....", "  The new update and the theme feature are good. I see Yahoo moving in the right direction to try to stay competitive and if you have used this app in the past, you now notice the apps improvements. With that being said, there are a couple of things I have notice that seem buggy. The theme I select is always different everytime I log back in. Weird! Why is there no log in and out option anymore? And why is there two Yahoo mail processess running in the background? Is this normal or am I just bugging out!? "], ["Good when it works", "  Updates keep ruining this app as mailboxes fail to open properly. Was working fine before the latest update. Please sort it out! "], ["Amazing", "  Its awesome but its kinda laggy. Samsung Galaxy S3 GT 193000 "], ["Good but annoying", "  It's fast but there are time it quits responding, and there should be a way to shut off the notifications it gets irritating when it goes off every few minutes. "], ["I have had Yahoo for years and it's an evolving technology world so I ...", "  I have had Yahoo for years and it's an evolving technology world so I appreciate yahoo for constantly trying to help to improve the glitches and to make it a better experience love the backgrounds so people be patient "]], "similar": ["com.mail.mobile.android.mail", "com.fsck.k9", "pl.mobileexperts.securemail", "com.outlook.Z7", "com.protrade.sportacular", "com.beejive.im.yahoo", "com.maildroid", "com.facebook.orca", "com.sonyericsson.extras.liveware.extension.mail", "ru.yandex.mail", "com.google.android.gm", "com.whatsapp", "ru.mail.mailapp", "com.intonow", "com.viber.voip", "com.gau.go.launcherex.gowidget.emailwidget", "com.skype.raider", "de.gmx.mobile.android.mail"]}, {"appId": "com.jb.gosms", "moreFromDev": ["com.jb.gosmspro.theme.birdlover", "com.jb.gosmspro.theme.gjtheme2", "com.jb.gosms.theme.sweet", "com.jb.gosms.theme.getjar.wpseven", "com.jb.gosms.ko", "com.jb.gokeyboard.plugin.fantasytext", "com.jb.gosms.theme.getjar.cutemonster", "com.jb.gokeyboard.theme.pink", "com.jb.gosmspro.theme.dark", "com.jb.gosms.widget", "com.jb.gokeyboard", "com.jb.gosms.pctheme.BearLove", "com.jb.gosms.emoji", "com.jb.gokeyboard.plugin.emoji", "com.jb.gosms.chat", "com.jb.mms.theme.purple", "com.jb.gosmspro.theme.icecream", "com.jb.gosmspro.theme.go", "com.jb.gokeyboard.langpack.ar", "com.jb.gosmspro.theme.loveletter"], "reviews": [["Not working on my Nexus 7", "  Still not working on my Nexus 7 after the 4.4 update. I'm rating a 3 star as no alternative seems to be working either! As it stands right now, if I want to send an SMS, I have to put my Nexus sim into my business iPhone :( Please fix asap "], ["Group messaging", "  After updating, i could not find my newly created group (before the latest update) please help me where to find it so i can give you 5 stars "], ["This is what every phone should come with.", "  Very customizable but led blink message indicator doesn't work for any of my messages.  Always freezes for about 3 min after sending a picture message through stock messaging app. Randomly stops opening. "], ["quick compose, bugs & Fake notification", "  please put quick compose . bo need to go in the program just to send a message . just like in chomp sms. And a lots of bugs. its consume big size of ram. Before, you can Edit the Fake notification in Private Box, now you need to purchase the premium first before you can edit it. Hopefully, i can edit it again without the premium. thank you "], ["Galaxy star pro", "  Im not able to receive or snd messages on this device.... Kindly fix it :( "], ["What happened to groups?", "  I created groups in tje address book and the option is gone after the update bring it back! "]], "similar": ["jp.naver.line.android", "com.textra", "com.jbapps.contactpro", "com.ani.apps.sms.messages.collection", "com.mysms.android.sms", "com.jiubang.gosms.wallpaperplugin", "com.jbapps.contact", "com.mediawoz.goweather.htcstyle", "com.mediawoz.weather.widget.threedstyle", "com.handcent.nextsms", "com.gau.golauncherex.notification", "com.p1.chompsms"]}, {"appId": "com.antivirus", "moreFromDev": "None", "reviews": [["Mobile security still needs work but its a must have app to have", "  Reason why i say its a must have app is because from operating systems such as Windows now we are living in a world of applications and ios and android etc...  its new therefore now the antivirus software vendors are working on securing them however still they didnt perfect it but for what is done until now its neccesary to have .   this app is nice because , it shows you to disable options that hackers / developers use to prevent them from accessing your device . it locates your phone as well ( it didnt work from first try , im gonna troubleshoot and fix it im sure its a working service, maybe the firewall blocked it ) it has better features to browse your storage and other features  it has backup features  the pro version is good as well , you get app locker and some other imporntatn   HOWEVER I CHALLANGE YOU AND ALL OF YOU SECURITY VENDORS : IF I LOST MY PHONE YOU STILL HAVENT GOT THE BEST SOLUTION !!! scenario a : it locates your phone however only if its connected to the internet  AVG came and said  scenario b : you can send sms to your phone and wipe it or etc HOWEVER did you thought about scenario c ? scenario c : what if he takes the sim card out ? keep itUP "], ["Very useful application :))", "  It protect my android phone from any threats or viruses, and it's 100% FREE ^_^ "], ["Great Anti Virus App", "  I love this app. It works great, but you really need the paid version to get the full benefits. "], ["Worried that it 'fixed' my messages w/o details...", "  It said it had found suspicious messages, but only allowed me to 'fix' them - gave no further details. No report provided either. What did you do my messages! "], ["Not bad", "  Im ok with it, some times it will not let me down load,have to keep trying till it lets me. "], ["Update installation failed!!", "  problem fixed! "]], "similar": ["com.colony.safeantiviruslite", "com.android.chrome", "org.antivirus.tablet", "com.facebook.orca", "org.mozilla.firefox", "com.viber.voip", "com.nqmobile.antivirus20", "com.avg.uninstaller", "com.moobila.appriva.av", "com.avg.privacyfix", "com.avg.shrinker", "com.tencent.mm", "com.avg.tuneup", "com.google.android.gm", "com.google.android.talk", "com.wsandroid.suite", "com.whatsapp", "com.antivirus.tablet", "jp.naver.line.android", "com.avg.cleaner", "org.antivirus", "com.opera.browser", "com.skype.raider", "com.opera.mini.android"]}, {"appId": "com.viber.voip", "moreFromDev": ["com.viber.guide"], "reviews": [["â™¥â™¥â™¥", "  I love it "], ["Love it", "  Great, simplistic app! Would like it to either integrate with the default sms and phone apps, or offer choices to customise ui and notifications.  Update: \" This tool occupies a very high SMS receiver priority which conflicts with avast! Anti-Theft and will prevent avast! Anti-Theft to work properly.\" "], ["Cool but with bugs", "  I have htc hd2 and it freezes my phone when someone calls me (not Viber call but regular call ). Beyond that bug, it's great. "], ["Cool app and saves from expensive texting", "  I really like this app and the updates. I have never had a problem. I can text friends anywhere in the world,the big plus is there's no ads either. "], ["Keeps crashing", "  I only use viber becuase my family is using it. Now, it keeps on crashing for no reason. It's irritating. It doesn't have a purpose now since I am not able to read messages. It's just taking up space on my screen and eating my battery. Fix your app. "], ["Bad development", "  The app it's self is really bad developed, to much processes running at the same time slows down the devices. I have a nexus S and a Nexus 7, and every time I receive a call or notification the devices just stop working. "]], "similar": ["jp.naver.line.android", "com.kakao.talk", "com.sec.chaton", "com.nimbuzz", "com.google.android.talk", "com.android.chrome", "com.antivirus", "com.facebook.orca", "com.bbm", "com.whatsapp", "com.fring", "com.tencent.mm", "com.sgiggle.production", "com.skype.raider", "kik.android"]}, {"appId": "com.android.chrome", "moreFromDev": "None", "reviews": [["Solid with nice desktop syncing", "  The only thing missing for me is having full screen browsing where the status bar hides like the stock browser on my dna. If that was added, I would disable the stock one. Still waiting for this... "], ["Now videos I could see prior to update I cannot see due to country ...", "  Now videos I could see prior to update I cannot see due to country restraints.  I'm in Canada, now vids not available in my country pops up.  DO NOT UPDATE "], ["Where Is Homepage Setting?", "  Call me crazy but there is absolutely no way to set your homepage? Am I missing something here? I know it was there before but haven't noticed over the last few updates but now in the settings a lot of features have been removed. That sucks! "], ["Freezes droid razr", "  Apparently chrome just doesn't work well on this model phone...still.  almost every time I use it, it pegs the cpu at full and not only keeps chrome slow, but the whole phone indefinitely too until I force stop and clear cache for chrome.  This has been an issue for me since the ICS update. "], ["Works great!", "  Love it, great integrated with other systems. Had to reinstall on tablet as it stopped working "], ["Too much space", "  This app takes up 67 MB and the previous version was about half.  Neither amount is good with a mere 9 GB of available space on my S4.  Please enable SD card storage at the least, and reduce the file size if possible. Thanks. "]], "similar": ["com.opera.browser.beta", "com.google.android.tts", "mobi.mgeek.TunnyBrowser", "com.google.android.play.games", "com.mx.browser", "com.google.android.apps.translate", "com.UCMobile.intl", "com.ninesky.browser", "org.mozilla.firefox", "com.google.android.apps.plus", "com.google.android.youtube", "com.google.android.googlequicksearchbox", "com.google.earth", "com.google.android.apps.books", "org.easyweb.browser", "com.skype.raider", "com.boatbrowser.free", "com.google.android.apps.docs", "com.google.android.talk", "com.whatsapp", "com.google.android.apps.magazines", "com.google.android.gm", "com.google.android.apps.maps", "com.jiubang.browser", "com.google.android.voicesearch", "com.opera.browser", "com.uc.browser.hd", "com.google.android.music", "com.opera.mini.android", "com.google.android.street", "com.ww4GSpeedUpInternetBrowser", "com.tencent.ibibo.mtt"]}, {"appId": "jp.naver.line.android", "moreFromDev": ["jp.naver.SJLGLINEHC", "jp.naver.SJLGPP", "jp.naver.SJLGBUBBLE", "jp.naver.SJLGDOZER", "jp.naver.SJLGPPP", "jp.naver.SJLINEPANG", "jp.naver.linecamera.android", "jp.naver.SJLGWR", "jp.naver.SJLGDRAFL", "jp.naver.SJLGRUSH", "jp.naver.SJLGSUGAR", "jp.naver.linecard.android", "jp.naver.SJZOOK", "jp.naver.lineplay.android", "jp.naver.SJLGCWARS", "jp.naver.SJLGPA"], "reviews": [["Can't connect and chat after latest update", "  I cant log in anymore even thou already many times uninstall and reinstall. Using the backup password i can log in to my account on my imac. But the apps on my android phone keep saying i have no connection and keep error and close itself. What happened to LINE? Other apps are doing ok on my phone? Pls fix. Android 4.2.1. Thanks "], ["Clear...", "  Bagus..sng dn cpt trdpt sticker2 yg brsesuaian dgn karekter yg kita nk sampaikn tp syg sy pye tab slow ckit. Good job line.... "], ["Alwaz force close", "  I duno y dis z nt supporting in my htc .got iritated bcoz i hav to force close al d time n uninstalled.can you fix dis? "], ["It crashes.", "  After the last update I cannot even open the app, it crashes after 1 second or so in my nexus 5, it might be that it isn't optimized for 4.4 kit-kat.   It was working properly before the update. Please fix!  Other than that, its an amazing way to communicate with my friends. When fixed will put 5 stars. "], ["Bugs", "  Not receiving notifications until I open the app, also crashes at first attempt to open the app. Messages only shows at notification but not in chat. EDIT: Unable to send out messages on some occasion "], ["è®š", "  å�ƒè¨Šæ�¯æ”¹å–„äº†!æ”¯æŒ� "]], "similar": ["com.kakao.talk", "com.sec.chaton", "com.talkray.client", "app6910.vinebre", "com.talkatone.android", "com.antivirus", "kik.android", "com.google.android.talk", "com.facebook.orca", "com.viber.voip", "com.whatsapp", "com.fring", "com.bbm", "com.tencent.mm", "com.skype.raider", "com.yuilop"]}, {"appId": "org.mozilla.firefox", "moreFromDev": ["org.mozilla.firefox_beta"], "reviews": [["like it, don't love it", "  love the pc firefox. the android version has a waaay to go. not bad, but far from there yet. i've decided to stick with it only thanks to a user-created add-on which quickly allows me to turn loading of images on/off. "], ["Dolphin is superior by miles!", "  I can't believe people actually give this 5 stars. Its got to be the worst browser for android I've used. Utter rubbish. No way to sort bookmarks, no obvious way to make a homepage.Removed! "], ["Needs work", "  Officially done with the mobile app. The settings from desktop do not carry over at all (by sync or on its own). Furthermore, it says it can play flash, but it really can't (I know about the setting top enable plugins). Whack browser "], ["Uhm...", "  Better UI than Chrome and default browser Add-ons is great feature  But Lagging a lot Saved passwords in a horrible manner  Take a half hour and getting another browser  *sorry for bad english "], ["Useable, which makes it better than other browsers, but unstable", "  Most of the other browsers for android are garbage, so that firefox is at least usable is grar, but it xrashes ALL THE TIME for me, at least evert time I use it. Of course, I open tabs which firefox doesn't seem to handle well. "], ["Great browser but...", "  Firefox is an excellent browser but for some reason after watching HD movies with Firefox it inflated from 24mb to we'll over 2.6gb almost as if it ate all the data and the cache was only 44kb so no idea where that sizeable increase came from. I constantly have to clear the data to fix it explain to me why it's growing uncontrollably or post a fix and I'll give it 5 stars again. "]], "similar": ["com.opera.browser.beta", "com.boatbrowser.free", "com.opera.browser", "com.jiubang.browser", "com.android.chrome", "mobi.mgeek.TunnyBrowser", "com.uc.browser.hd", "com.mx.browser", "com.whatsapp", "com.opera.mini.android", "org.easyweb.browser", "com.UCMobile.intl", "com.ww4GSpeedUpInternetBrowser", "com.tencent.ibibo.mtt", "com.appsverse.photon", "com.ninesky.browser"]}, {"appId": "com.google.android.apps.googlevoice", "moreFromDev": ["com.google.android.gm", "com.google.android.voicesearch", "com.google.android.talk", "com.google.android.play.games", "com.google.android.tts", "com.google.android.apps.plus", "com.google.android.youtube", "com.google.android.googlequicksearchbox", "com.google.android.apps.maps", "com.google.earth", "com.google.android.apps.books", "com.google.android.apps.translate", "com.google.android.street", "com.google.android.apps.magazines", "com.google.android.music"], "reviews": [["Wtf happened?", "  Update stopped giving text notifications until app is opened. Do I need to roll back to previsions version? I had no problems until update. I am on stock N4 and have used this for years as main # on this and other phones. Can we get support or is this going the way of Reader? Update, uninstalled and side loaded older APK. Now I have my text notifications back. I hope this helps others, but I wouldn't expect much from google on this, if or until they roll this into Hangouts. "], ["Photo sensor while listening to messages", "  If I want to hear voicemails while holding up to my ear the screen should turn off but it doesn't. I end up listening to the voicemail and then it randomly pauses because my ear accidentally hits something on the screen that wasn't supposed to be hit. The overall look of the app needs an update too. Not much has changed. I do still prefer to use Google Voice over my carriers voicemail system since I get the visual voicemail for free through Google. "], ["Can't verify phone", "  I am not able to verify my phone number. My sms is blocked. Is that the reason that am not able to verify my no??? Is there any other way that I can verify?? "], ["No MMS", "  Google has been promising MMS support for several years now. Unlikely to ever happen. Even if they integrate with Hangouts it will most likely be for SMS only. Don't waste your time. "], ["Good but new update stinks", "  With the update of the keyboard its cool with the emojis but if your talking to someone with an apple phone they can't see it also you can't see any emojis from applre phone they send "], ["The phone call never worked for me", "  when I dial a number, it appears on the screen that G Voice is calling this number from ur email ID, but it was so obvious that there is no calling! Outrageously LYING! "]], "similar": ["hu.xilard.voiceplus", "jp.naver.line.android", "org.mozilla.firefox", "larry.zou.colorfullife", "com.moplus.gvphone", "com.talkatone.android", "com.android.chrome", "com.phonefusion.voicemailplus.and", "com.youmail.android.vvm", "com.att.mobile.android.vvm", "com.alpha.chatxmpp", "com.facebook.orca", "com.viber.voip", "com.whatsapp", "com.skymobius.vtok", "ru.vsms", "com.skype.raider"]}, {"appId": "com.pinger.ppa", "moreFromDev": ["com.pinger.juke.vox.messenger.free", "com.pinger.free.style.messenger.text", "com.pinger.textfree", "com.pinger.gif.chat.text.free", "com.pinger.textfree.call"], "reviews": [["Notifications", "  I used to like it but lately the notifications dont come in and when someone calls me..it dont pop up on my screen, i have to go open the app just to answer..sometimes it force closes and shuts down my phone!! Plz fux asap!!!! "], ["Verizon Droid DNA", "  Doesn't show new notifications and kicks me out a lot. I uninstalled and reinstalled and still no change just does the same thing. Please fix thanks! "], ["Do not download", "  At first everything might seem great \"la da la da de\" but then they get you everything turns into sh*t long story short don't waste your time "], ["Have to check stuff MANUALLY", "  Notifications don't come up 95% of the time and I have to check things manually. Please fix this! I'm tired of getting of not getting my friend's texts :((( "], ["Don't update!", "  Ever since I updated I don't get my notifications unless I'm constantly refreshing.  I'm always getting missed calls because NOW my phone no longer rings.  This sucks!!!!! Please fix soon!!!!! "], ["It won't load or open", "  I would give it a higher rating because when I first installed it it worked perfectly but I had to reset my phone and now after I installed it it won't even load to home screen I left it open for hours and all it did was load I even tried uninstalling it and installing it again 3 times and it still doesn't work smh terrible either they fix it or I'm uninstalling for good "]], "similar": ["com.kakao.talk", "jp.naver.line.android", "com.talkray.client", "com.mrnumber.blocker", "com.talkatone.android", "com.icall.android", "com.mysms.android.sms", "com.ThumbFly.FastestSms", "com.textmeinc.textme", "com.viber.voip", "com.yuilop", "com.fring", "com.moplus.moplusapp", "com.gogii.textplus", "tw.nicky.Emoticons", "com.skype.raider"]}, {"appId": "com.rebelvox.voxer", "moreFromDev": "None", "reviews": [["I'm not sure what's going on, but with the new update voxer is extremely ...", "  I'm not sure what's going on, but with the new update voxer is extremely slow. I open it up and it has the gray curclr like it's loading forever, my messages take 2-3 minutes to send, it's ridculous. Please fix this. "], ["Not that great", "  I thought if I paid for it it would be better and I'd get notifications uh no no you don't ... not worth $0.50 let alone $2.99 .... JUST SAY NO !!!! "], ["STILL AWFUL", "  Updating my review because the update has only gotten worse. At first I was annoyed when if I was interrupted both messages would become corrupted and I'd sometimes have to repeat lengthy important messages. But now messages seem to take forever to load. The grey circle spins for minutes and minutes until it (sometimes) loads..please fix this update. I miss the old Voxer. Until it's fixed I'm going to use another app. "], ["Awesome app but freezes", "  It's a cool app but it freezes sometimes and also it doesn't always deliver the the message like me I get a message and it'll play a few seconds of it and that's it whenthe message is a minute long or something. "], ["Great to have", "  I have been using boxer for a few months now. Its amazing for on the go. I hardly text anymore. I recently started having issues like many others, so I uninstalled and reinstalled the app and it works just fine. Thatnks! "], ["Cool app but there's a problem", "  This app is cool and all and i like how simple it is but i cant find a few of my friends that have accounts. I used full names, emails, and usernames and nothing works. I also checked spelling and I'm hoping this will be resolved soon. "]], "similar": ["jp.naver.line.android", "com.kakao.talk", "com.sec.chaton", "com.loudtalks", "com.google.android.talk", "com.antivirus", "com.facebook.orca", "com.viber.voip", "com.voxer.v4b", "com.whatsapp", "mobi.androidcloud.app.ptt.client", "me.blip", "com.bbm", "com.tencent.mm", "com.yahoo.mobile.client.android.im", "com.skype.raider", "kik.android"]}, {"appId": "com.textmeinc.textme", "moreFromDev": "None", "reviews": [["Will not make calls!", "  Every time I make a phone call the app shuts itself down. Would not recommend to anyone. "], ["Not To Its Full Advantage", "  I love the fact that majority/ or all the text are FREE!,  I also love having my own Phone Number (really helpful in my current situation) and Im always near WiFi spots and the app signal is strong receiving messages... BuT! downside is you have to go through a long process and many hurdles for a few credits. Then when you purchase credit and get on a few calls that last no more then 2mins, its seems you've lost 20 credits instead of 2 as they state. Ad's are annoying as well. Idk, 3 out of 5 is good enough "], ["...pretty good..", "  Anyone complaining about how to ger free minutes...OH WELL. Create a fake email..just for spam. At least you don't have to pay right?? I really only get this for texting, when I don't have money for the bill. I can us it near wifi. But I have no complaints cause for being free its one of the best ones and I really don't mind ads. Any other app I've tried always end up working for a day then just stop. They won't text...or receive them..so either start paying those that complain or be happy someone made this "], ["Perfect Wi-Fi companion", "  Where I work my cellular service is really bad. Text me works perfect on Wi-Fi! "], ["Very impressed", "  Was expecting there to be a lot of hassles but am very happy thus far with this app would recommend for someone who doesn't have paid texting or someone like me who is listing a lot on craigslist and didn't want my actual number out there. The texting is just as fast paced if not better than my provider and the calls have been wonderful as well. NO COMPLAINTS FROM ME!!! "], ["Fair for being free", "  Its been my savior after some BS i've been going through but it crashes constantly, pic mail doesn't work. I never see pics people send. "]], "similar": ["com.kakao.talk", "jp.naver.line.android", "com.pinger.textfree", "com.mrnumber.blocker", "com.talkatone.android", "com.ThumbFly.FastestSms", "com.mysms.android.sms", "com.mediafriends.chime", "com.jb.gosms", "com.hushed.release", "com.yuilop", "com.fring", "com.talkray.client", "com.gogii.textplus", "tw.nicky.Emoticons", "com.pinger.ppa"]}, {"appId": "mobi.mgeek.TunnyBrowser", "moreFromDev": "None", "reviews": [["Locks up ALL the time", "  This used to be the best browser out there. Now I can barely use it at all. It locks up all the time making browsing impossible. Don't know what you did but you took an ultra fast browser and turned it into complete garbage. "], ["Was Great!", "  Used to Work good....? Fails often now "], ["Wow, beta v10.1.2 how fast r u", "  Fussy about my browser's but this works really well. Learn new tricks each day. "], ["Integrates well with my tablet", "  Enjoy using it "], ["Nice", "  Good to use this...not too bad. "], ["Best browser on the Play Store", "   "]], "similar": ["com.opera.browser.beta", "com.boatbrowser.free", "org.mozilla.firefox", "com.boatgo.browser", "com.dolphin.browser", "com.jiubang.browser", "com.android.chrome", "com.opera.browser", "com.uc.browser.hd", "com.dolphin.browser.engine", "com.mx.browser", "com.cloudmosa.puffinFree", "com.opera.mini.android", "org.easyweb.browser", "com.UCMobile.intl", "com.ww4GSpeedUpInternetBrowser", "com.tencent.ibibo.mtt", "com.ninesky.browser"]}, {"appId": "kr.core.technology.wifi.hotspot", "moreFromDev": "None", "reviews": [["Peter E", "  Just got a droid mini and trying to set up hot spot via this app. However, it appears this app requires Verizon data plan. "], ["Help", "  It tells me I have to turn on my wifi and find it and connect to it but It won't let me turn on my wifi without disabling the hot spot :( help "], ["False advertising", "  The advertising is not false. However, it is misleading. I thought I'd have free mobile hotspot . But nope. It's just a more simple way to toggle your hotspot on and off. ONLY I'd you have already paid for it through your carrier. 3 stars for working 2 docked for being misleading "], ["I dont get it. What's the point of this. You have to have WiFi ...", "  I dont get it. What's the point of this. You have to have WiFi to turn on your own wifi. If I'm in the middle of nowhere I want some freaking wifi. "], ["Works great", "  On Verizon and this works great it totally overrides the subscription message that you would normally get. I do know this will only work if you don't have unlimited data otherwise Verizon cannot disable the hot spot if you have a cap Plan due to an agreement Verizon made with the FCC in 2012. The app is really easy to use just one touch in it enables a hotspot "], ["In app bill failed 'not included on device'", "  Umm what the heck is in-app billing for?  This app forced close because my inbuilt security stopped this app from connecting to premium services. In other words it forced closed cause it didn't get what it wanted.  Developer please explain???  Is this a free app or does it attempt to sign up malicious websites? What is the necessity for in app billing for? If this app DOES do the unthinkable I am going to report it. Logcat here I come!  I expect a explanation from the developer. Thanks "]], "similar": ["com.manchinc.android.mhotspot", "kr.co.core.technology.screenoff.free", "kr.co.core.technology.wifi.hotspot", "com.bosscellular.wifi.boost", "net.szym.barnacle", "share.hotspot.myfi", "com.majedev.superbeam", "com.stt.mobilehotspot", "com.wifi.hotspot", "com.foxfi", "kr.co.core.technology.clock", "com.svtechpartners.wifihotspot", "com.svtechpartners.wifihotspotdemo", "kr.co.core.technology.clock.widget.free", "com.foxfi.key", "kr.co.core.technology.screenoff", "og.android.tether", "net.snclab.wifitetherrouter", "kr.co.core.technology.clock.widget", "com.taiseiko.tetherWidget", "org.kman.WifiManager", "com.foxfi2"]}, {"appId": "com.tencent.mm", "moreFromDev": ["com.tencent.qqlauncher", "com.tencent.mobileqqi", "com.tencent.minihd.qq", "com.tencent.qqmusicpad", "com.tencent.qqmusic", "com.tencent.hd.qq", "com.tencent.qqphonebook", "com.tencent.qqpimsecure", "com.tencent.qqgame.hallinstaller.hall", "com.tencent.mtt", "com.tencent.mobileqq", "com.tencent.qqpim"], "reviews": [["Real swell", "  I just got it.  But I like it a lot so far. Works like a charm on my lg g2. Only \"issue\" is after numerous attempts it still didn't send me a code to register. No biggie. Works like a champ! "], ["WTF..  Tenchen folder eating sdcard space", "  WTF..  Why is tenchen folder used nearly 1gb of my sdcard space, and totally leaching my mobile data. Never i seen any massaging app use more than 50mb, even for integrated app like google hangout.  Beware people,  please check your folder using file manager.. "], ["Wat the helll", "  Always showing pakage invalid even if I hav space in my phn... plz try to fix it egarly waiting to use ths app.. ill gv 5 stars aftr fixing it "], ["4.4 Update & WeChat Is Nearly Dead", "  mmmmm 4.4 KitKat has been in the market for something like a month and STILL these Developers have NOT addressed the BUGS that now play havoc with this app. They must be on vacation ..........doubt it somehow though. "], ["program shut down after android kitkat update eas installed", "  people nearby and Shake cannot be used. once triggered, wechat shut down. this happened after android system updated yesterday. "], ["ERROR! PLEASE READ!", "  We Chat can't fix the alias bug in the new update... I can change an alias but I can't remove it. Fix it and I'll change my review... Disappointed. "]], "similar": ["jp.naver.line.android", "com.kakao.talk", "com.sec.chaton", "com.qzone", "com.nimbuzz", "com.google.android.talk", "com.spartancoders.gtok", "com.sgiggle.production", "com.qqgame.hlddz", "com.androidsx.smileys", "us.findfriends.wechat", "com.facebook.orca", "com.viber.voip", "com.whatsapp", "com.we.chat", "tencent.qqgame.happylord", "com.bbm", "com.qq.reader", "com.skype.raider", "kik.android"]}, {"appId": "com.yahoo.mobile.client.android.im", "moreFromDev": ["com.yahoo.mobile.client.android.fantasyfootball", "com.yahoo.mobile.client.android.search", "com.yahoo.mobile.client.android.fantasybaseball", "com.yahoo.connectedtv.yremote", "com.yahoo.mobile.client.android.fantasybasketball", "com.yahoo.mobile.client.android.flickr", "com.yahoo.mobile.client.android.weather", "com.yahoo.mobile.client.android.yahoo", "com.yahoo.mobile.client.android.finance", "com.yahoo.mobile.client.android.imvideo", "com.yahoo.mobile.client.android.mail", "com.yahoo.cricket.ui"], "reviews": [["Message not received", "  This app just gets worse the more I use it. It takes a good 24 hours to update when one of my contacts signs in or out so I never know if someone is actually signed in or not.  I had someone accept a friend request over 30 minutes ago and they still aren't showing up in my contact list.  I really wish the functionality to use custom notifications would be added back. The available tones are too short and quiet and it's difficult to hear if I revive a message. "], ["Good but...", "  Good, fast, however only been using it a week and it regularly loses messages! Not very good considering it's a messenger! "], ["Can't send mail!", "  I can no longer send mail using the app. I can if I go to the website. I have no problem reading them, but cannot reply or compose new mail. The updates are not helping. Please fix!!! "], ["It has definitely gotten better", "  The last update: ruined this and this app needs  the ability for the option to show offline Facebook contacts if desired.   Samsung galaxy s4 "], ["Annoying me again!", "  Seems the can't get this one right.. newest update has lost all my contacts so ive had to go adding my family and close friends again. My ims go missing to my family expecially annoying when ym does it as this usually more reliable than the other option I use. Will glitch out and randomly shut down during sign in. SAMSUNG NOTE 2 "], ["Classic", "  Every time I try to add a location, it freezes. Then I get the \"Unfortunately, Messenger has stopped.\" Error. Please fix. Galaxy S4. "]], "similar": ["jp.naver.line.android", "com.kakao.talk", "cn.msn.messenger", "com.nimbuzz", "com.wHotmailLiveMessenger", "com.spartancoders.gtok", "com.protrade.sportacular", "com.ebuddy.android", "com.bsb.hike", "com.facebook.orca", "kr.co.datawave.facechat", "com.viber.voip", "com.whatsapp", "im.mercury.android", "com.intonow", "net.daum.android.air", "com.skype.raider", "kik.android"]}, {"appId": "com.handcent.nextsms", "moreFromDev": ["com.handcent.lang.nextsms.de", "com.handcent.plugin.emoji", "com.handcent.plugin.locate", "com.handcent.nextsms.skin.winter.red", "com.handcent.nextsms.skin.valentineday", "com.handcent.nextsms.skin.darkness", "com.handcent.nextsms.skin.summer", "com.handcent.lang.nextsms.es", "com.handcent.nextsms.skin.metal", "com.handcent.fontpack.pack4", "com.handcent.fontpack.pack5", "com.handcent.lang.nextsms.fr", "com.handcent.sms.skin.ios7beta", "com.handcent.nextsms.skin.hellokitty", "com.handcent.fontpack.pack2", "com.handcent.smileys.android"], "reviews": [["forgot password", "  i uninstall this app because it always force close. then i remember that i have numbers in my private box and tried to install it again but i forgot my password! ! ! and now i dont know if someone texted me from one of the numbers in there because i havent receive message from any of the numbers anymore :( please tell me what to do "], ["Private box does not work.", "  Messeges set for private box show in chomps normal sms inbox and also show in native android sms app too. Cant stop the notifications for it either. "], ["Could be better", "  Animation feels sluggish, confusing interface (why there are two icons to access settings, one in navigation bar, one in action bar, and yet they do different tasks). Is this a port app? "], ["More features?", "  Any chance on folders to organize texts, save a draft with no number, slide to delete? Always wishing for some new awesome effects with the update. This is so close to being the best text app out there. There is a problem with the number of messages on the notifications in status bar. "], ["Hate Skins", "  Love this app and the way I had it set before I had to hard reset my phone. Not sure if it's the update and isn't possible anymore but I would like to not use a skin!!! With a Skin is doesn't let me get the full customization of a theme!!! (The conversation bubbles) Very annoying!! "], ["Pictures Impossible", "  As of late my pictures will not send, but will only receive any but rather get \"download\" buttons that don't, in actuality, work. This has not happened previously, and it's leaving me in deep frustration. Hoping for a fix or some help, please!  -Spectrum 2 "]], "similar": ["com.jb.gosmspro.theme.birdlover", "com.jb.gosmspro.theme.gjtheme2", "com.textra", "com.jb.gosms.theme.getjar.wpseven", "com.ani.apps.sms.messages.collection", "com.jb.gosms", "com.jb.gosmspro.theme.dark", "com.jb.gosms.theme.getjar.cutemonster", "com.jb.gosms.widget", "com.jb.gosmspro.theme.thief", "com.jb.gosms.theme.sweet", "com.jb.gosmspro.theme.grey", "com.jb.gosmspro.theme.icecream", "com.jb.gosmspro.theme.go", "com.p1.chompsms", "com.jb.gosmspro.theme.loveletter"]}, {"appId": "com.kakao.talk", "moreFromDev": ["com.kakao.agit", "com.kakao.group", "com.kakao.page.partner", "com.kakao.story", "com.kakao.album"], "reviews": [["Kakaotalk with 4g not working", "  I can receive messages thru 4g but it does not allow me to send anything. I know there are no issues on my side because I have been able to use other SNS apps perfectly fine. This has become a problem after the most recent update. PLEASE FIX. "], ["...", "  I don't get it. When I want update latest version, it will show me text : Insufficient storage avaible -,-\"  Anyone to help me? ;-; "], ["cool features but unreliable", "  It's great when it works but often it stops sending/receiving messages,  even if it is connected via wifi and other apps have no problem communicating with the server.      An unreliable messaging app is a bad app.  Stay away unless you have no choice and all friends are using it. "], ["Atm buggy and bad service", "  After the latest update the app went very downhill for me, weird things happen when I push buttons and the app is very buggy after this update to the point where it's unusable. I can't even contact them for help, it only says \"system error\" after submitting "], ["ë¦¬ë·°", "  ì—…ë�°ì�´íŠ¸ ìž�ë�™ìœ¼ë¡œ í•´ë†“ì•˜ë�”ë‹ˆ ë‚˜ë�„ ëª¨ë¥´ê²Œ ì—…ë�°ì�´íŠ¸ ë�˜ì—ˆë„¤! ë†€ë�¼ì›Œë�¼! "], ["Seriously?!", "  I dont get any signal whatsoever at my house which means i couldnt use this app when i really needed  to because i had no service to recieve ur verification code assholes... But dont worry i finally got it 6 hrs later. "]], "similar": ["jp.naver.line.android", "com.facebook.orca", "com.talkray.client", "com.textmeinc.textme", "com.google.android.talk", "kik.android", "com.talkatone.android", "com.viber.voip", "com.whatsapp", "com.fring", "com.bbm", "com.gogii.textplus", "com.tencent.mm", "com.nimbuzz", "com.skype.raider", "com.pinger.ppa"]}, {"appId": "com.glidetalk.glideapp", "moreFromDev": "None", "reviews": [["No settings for notifications?", "  Really? I can't mute the sound nor can I opt out of having a pop up message in my notification bar? That's not good. I don't want to be alerted in anyway..so why isn't there an option for that? I don't need to be notified and I don't need everyone knowing seeing or hearing that someone sent me a new video..let me just check for new vids on my own. 1 star until you let me control notification settings :( "], ["Can't send video", "  I downloaded this app on my s4 and have yet to send a video. I keep getting the message poor network quality. I've messaged support, and they told me this will be fixed in the next update. Well when is the next update?  I'm not going to wait forever.  I'll just delete it and move on ... "], ["Ok for a new app.", "  So far I have used this app sparingly. I have no major complaints other than the lag of video 'messages'. I would prefer to see real time/face time communication live between me and whom I'm conversing with. Other than that, its a real good app. "], ["App will spam your contacts", "  Be careful, the app will spam your contacts an invite even if you do not want it to.  Need to fix this.  Also its not a normal invite message. I dupes your contacts with its wording. The beta didn't have this problem so I'm writing this off as a bug. "], ["Very enjoyable when it works", "  Every once in awhile it says that the network is bad when i have full bars or wifi on. If the network is slow its takes awhile and the video looks like crap. "], ["Galaxy Note II love this thing I mean even more now there is a ...", "  Galaxy Note II love this thing I mean even more now there is a little more time to see someone.... GREAT APP TO HAVE\tLove this App everyone should have it wish I could add all my friends to video txt with them.  GET IT GET IT!!! "]], "similar": ["jp.naver.line.android", "to.talk", "com.imo.android.imoim", "com.fring", "com.spartancoders.gtok", "com.verizon.messaging.vzmsgs", "com.mediafriends.chime", "com.jb.gosms", "com.apdroid.tabtalk", "com.textmeinc.textme", "com.p1.chompsms", "com.hushed.release", "com.talkatone.android", "com.qik.android", "ru.mail", "com.skype.raider"]}, {"appId": "com.outlook.Z7", "moreFromDev": "None", "reviews": [["Doesn't support Office 365", "  After finally managing to install this on my nexus 7 in was shocked to learn that this doesn't support my corporate 365 account like the iOS version does. That's the main reason I installed it in the first place "], ["sux", "  doesn't go to the email account that has unread email received. so when you get a email notification you have to check all the accounts to see which one you got an email in. it just sux "], ["...", "  Doesn't recognize my email account. Yes, it does exist, I can log in on my desktop just fine. "], ["Poor....", "  Getting it logged off in every  5 mins automatically.. Its really scuks....otherwise i would have given 5  rating..pl rectify the bug imm..plzzzz "], ["No zoom out", "  Used to be able to zoom out my emails, not anymore; plus the magnification is exagerated. "], ["Can't beat it", "  Its hard to see all the negative comments about the app. Works like a dream on my galaxy s3.  Maybe its not the apps fault,  it could be their phone?  Keep it up outlook love the app worth 5 stars plus "]], "similar": ["owa.buildweb.eu", "com.google.android.gm", "com.dreamstep.wWindowsLiveMSN", "com.maildroid", "com.fsck.k9", "com.wHotmailLiveMessenger", "com.all.emails", "com.app.inboxproforhotmail", "com.sonyericsson.extras.liveware.extension.mail", "com.connectivityapps.hotmail", "com.mobiletecnoapps.multiplemails", "pl.mobileexperts.securemail", "com.gau.go.launcherex.gowidget.emailwidget", "com.yahoo.mobile.client.android.mail", "com.skype.raider", "com.connectivityapps.outlook"]}, {"appId": "com.bbm", "moreFromDev": "None", "reviews": [["Not that good yet for me to switch from whatsapp", "  Where are the music status updates? We want higher res display photos and more emoji. The layout must be updated to an Android skin. Otherwise this is an average BBM app for people who've  been using whatsapp for years. "], ["Can't use without wifi", "  I can't understand why this app can't work when i turn off wifi connection, i've set the right provider data plan. Still can't used. This happen since upgrade the bbm apps, please fix it fast bro. Thanks. Sorry i've to give this poor upgrade 1 star. "], ["Unable to complete setup", "  This application said that no connection found. I've tried using mobile network and wifi but same thing happened. What should I do?? "], ["Can't change display picture", "  Now I can change my display picture. But it's for a long time and sometimes it didn't wanna change. Help me fix it and then I'll give 5star. Thanks. My handphone is Sony Xperia M "], ["Lots of things need to workout", "  Emojis are very small compared to text... Feels like I need Magnifier For emojis  Emotions are very less and not like other competitors already established..   Can't sent videos and contacts Location sharing is not there...   Comm'n bbm there is lots of stuff to do on Android platform... The feature ur providing  already exist on the current available other messaging services app  Don't loose on giving limited functionalities which dates back to 2008 "], ["No notifications", "  App was working fine until I dl the latest update. Now it does not send me message notifications and I just get bombarded with all my messages when I open the app. "]], "similar": ["jp.naver.line.android", "com.pinfinderbbm", "com.sec.chaton", "com.nimbuzz", "com.google.android.talk", "com.tencent.mm", "com.android.chrome", "com.google.android.gm", "com.kakao.talk", "com.facebook.orca", "com.viber.voip", "com.whatsapp", "com.amber.moore.sketch", "codeadore.textgram", "com.skype.raider", "kik.android"]}, {"appId": "com.talkatone.android", "moreFromDev": "None", "reviews": [["Free way to call +1 numbers from anywhere in the world", "  But that being said, I need to report the following issue:  Talkatone automatically sets the phone on silent mode once you place the call, and because of that, never heard my alarm in a morning (which made look very bad in front of my company's management).  I was planning to purchase the pro upgrade,  but now i have to start looking elsewhere,  please fix the problem.   Much appreciated. "], ["Using again...", "  I used this in the past. It did seem to have connection issues such as low volume of voices on 3g and sometimes WiFi. My WiFi is the slowest DSL Verizon offers. I just tried it again and it worked great on 4g. Not sure how it works on my WiFi yet, I will try that and update this review. Overall a good service. I have limited minutes but have unlimited data still so this appears to be a win for me. To add new contacts you have to add them to your Google account associated with your Google voice account. "], ["Receiving Calls", "  Great updateâ€¦ because now I am able to receive incoming calls to my S3 when friends call my google voice number.  Now I get absolutely free incoming and outgoing calls  without using my plan minutes  :  ) "], ["Some aggrivating features but works", "  Almost awesome. The box asking to retry to connect to network when not on wifi pops up blocking access to the app unless on network and makes it so we cannot access anything. I have to have GV widget next to app icon 4this reason Why??? And why no widget? "], ["Great new ui, still minor issues", "  Conection fair, when it disconnects you get a big connecting to server pop up that won't let you access your convo list or contacts until reconnects, I fixed the history problem by deleting my history from gvoice website "], ["very impressed and so happy", "  I've been searching the Google Play Store up and down for a app that lets me talk and text to anyone unlimited without them having to install the app. I like magic jack but I didn't like the long phone number people had to dial and it took away my phone's voice input. this app runs off of Google Voice and it is incredible. great job 5 stars. recommending it to everybody "]], "similar": ["jp.naver.line.android", "com.kakao.talk", "com.talkray.client", "com.pinger.ppa", "com.fring", "com.hushed.release", "com.mediafriends.chime", "com.textmeinc.textme", "com.viber.voip", "com.magicjack", "com.yuilop", "com.moplus.moplusapp", "com.maaii.maaii", "com.gogii.textplus", "com.skype.raider", "com.wicall"]}, {"appId": "com.handcent.plugin.emoji", "moreFromDev": ["com.handcent.nextsms.skin.winter.red", "com.handcent.smileys.android", "com.handcent.nextsms.skin.silver", "com.handcent.plugin.locate", "com.handcent.smspro", "com.handcent.lang.nextsms.de", "com.handcent.nextsms.skin.valentineday", "com.handcent.nextsms.skin.hellokitty", "com.handcent.nextsms.skin.darkness", "com.handcent.nextsms.skin.summer", "com.handcent.lang.nextsms.es", "com.handcent.lang.nextsms.fr", "com.handcent.sms.skin.hellokitty", "com.handcent.fontpack.pack4", "com.handcent.fontpack.pack5", "com.handcent.nextsms", "com.handcent.nextsms.skin.summer2", "com.handcent.sms.skin.ios7beta", "com.handcent.nextsms.skin.metal", "com.handcent.fontpack.pack2", "com.handcent.sms.skin.samsung"], "reviews": [["Very slow! Needs to fix", "  When I'm scrolling across it takes for ever to go to the next page. Since the last update it got way to slow. Before it was much faster. Please fix, thank you. "], ["Glitchy", "  It was a decent app until the latest update. All the emojis are out of order and don't match with the picture. Please fix ASAP!   Other weird things like text disappearing when erasing a emoji and then you put backspace again and everything re-appears.   App needs to be fine tuned. "], ["Scrolling", "  Since the update, scrolling from page to page is very slow. It takes forever to get to the emojis on the last page. The update really wasn't necessary in my opinion. Was working just fine before "], ["Doesn't work, period", "  I've had 2 different phones y have sent these to people with all different kinds of cells, android y iPhones. while d icons look fine on my screen, the receivers never see the icons but a bunch of letters y numbers that don't make sense...???? They can forward that mess to me y then i see it fine, how it should look, weird.... "], ["One Star", "  Motorolla Droid OS: Jellybean. Updates as of 10/16/13, causes phone/OS to be incredibly unstable. System lags with sending text msgs. (even when text msgs from all active users are cleared.  Liked the performance before recent updates. Guys: If it ain't broke...don't fix it. "], ["I don't understand", "  I want to know why i cound send emoji smileys bt when my friends reply back with emoji smileys i can't see them...why is this happening? "]], "similar": ["bazinga.emoticon", "com.textra.emoji", "com.jb.gosms", "iec.mychatsticker.emoji", "com.androidsx.smileys", "com.contapps.android.emojis", "com.google.android.talk", "com.plantpurple.emojidom", "com.p1.chompsms.emoji", "com.empireapps.Emoji2", "com.p1.chompsms"]}, {"appId": "com.mrnumber.blocker", "moreFromDev": "None", "reviews": [["Extremely Unhappy", "  When I got Mr. # the first time I LOVED it. There is a guy who had my # before me whom I get calls daily for.  The app no longer blocks these calls even though it sends me notifications saying it does. I've heard this problem might be specific to HTC phones, but regardless, what was once my favorite app has extremely disappointed me. I wish you would fix this. "], ["Annoyed", "  I am annoyed with the pick up and hang up feature.  I try and keep the settings on the send to voicemail option but it keeps ringing.  If I wanted it to ring at all I would not have downloaded the app.  Please fix it was fine before the updates "], ["Very good", "  I like this app its easy to use and works very well, would def recommend to anyone that doesnt want to answer annoying calls. "], ["Hangs up on active call", "  If a blocked number comes through while I'm on a call, my active call gets disconnected. Please fix ASAP, it's very annoying especially if you're on an important call. "], ["Not happy", "  I use to love Mr. Number when I first downloaded the app. Now I come to find out that because I have an HTC, my phone will no longer hang up on the calls that I have blocked. I am now in the process of trying to find another app. If you guys put the hang up feature back with the app, I will be a happy camper. "], ["Mr number is the best blocker", "  This has really been a good apps on my phone , it keep unwanted callers away , with mr number I don't have 2 worry about whose calling , if someone calls my phone for the first it says first time caller , I really love this and I would recommend it for everyone 2 use , i'm really happy I use mr number "]], "similar": ["com.kakao.talk", "jp.naver.line.android", "com.flexaspect.android.everycallcontrol", "com.talkray.client", "com.vladlee.easyblacklist", "tw.nicky.Emoticons", "com.mysms.android.sms", "com.ThumbFly.FastestSms", "com.smartanuj.sms", "com.textmeinc.textme", "com.visinor.phonewarrior", "gogolook.callgogolook2", "embware.phoneblocker", "com.truecaller", "com.skype.raider", "com.pinger.ppa"]}, {"appId": "com.google.android.gm", "moreFromDev": ["com.google.android.apps.docs", "com.google.android.voicesearch", "com.google.android.talk", "com.google.android.play.games", "com.google.android.tts", "com.google.android.apps.plus", "com.google.android.youtube", "com.google.android.googlequicksearchbox", "com.google.android.apps.maps", "com.google.earth", "com.google.android.apps.books", "com.google.android.apps.translate", "com.google.android.street", "com.google.android.apps.magazines", "com.google.android.music"], "reviews": [["1 account?!?!?", "  Have work and private accounts. Just bought a new HTC Butterfly S and can't access my accounts. Works on my Pad but not on the mobile.  Seems to be the issue for everyone. Here is one more 1 star for slow response with update ;-/ "], ["Pls don't update in Android 4.0 (Ice Cream Sandwich).", "  i'm using Micromax Canvas Android 4.0 smart phone. after update, my phone is continuously restarting in every 10 second. i can't able to do anything. i removed my sim card and SD card, still it's restarting. i don't no how to uninstall this Gmail with in 10 second. i think only the option is full format.... :(( :((  Pls be carefull... "], ["Gmail cannot open zip files", "  Sad that I cannot open zip files although I downloaded an app for \"zipping\" and opening those files. Gets quite inconvenient :( Pls look into it thank you :) "], ["Always show this senders pictures?", "  Why do I always have to select to show pictures on emails I get often from senders. I should not have to select over and over when we select to show always. Show my Pictures for email I want shown! Come On. "], ["Number of new emails seen but never loads.", "  Latest update.. shows the number of emails I have on top but no matter how much I refresh  the emails don't show up! Wish could have an option to load the previous version release till a fix is available. "], ["Doesn't load Fast", "  Comparatively having very Gud GUI, but It's taking lot more time to get loaded the mails compared to the previous versions.. kindly fix it ASAP.. "]], "similar": ["jp.naver.line.android", "com.fsck.k9", "org.mozilla.firefox", "com.sec.chaton", "com.maildroid", "com.outlook.Z7", "com.android.chrome", "com.antivirus", "com.facebook.orca", "com.viber.voip", "com.whatsapp", "com.opera.mini.android", "com.sonyericsson.extras.liveware.extension.gmail", "com.bbm", "com.yahoo.mobile.client.android.mail", "com.skype.raider", "com.sec.spp.push"]}, {"appId": "com.foxfi", "moreFromDev": "None", "reviews": [["Won't work twice!", "  It worked the first time, every time after was a Fail! Even after reinstalled. It said to contact verizon...um, no. Thumbs up this comment if it's happened to you! Galaxy S4. "], ["Does not work with Verizon", "  Verizon pushed out am update for their operating system (Jelly Bean). This prevents systems like Droid Razor and Razor Max from using the hotspot capability. You can still tether your phone but doesn't help if you want to connect to an IPad. "], ["No worky on LG G2", "  This is a great app, and it worked pretty well on my razr. Won't work on my G2. Please add support for the LG G2! Update: still not working on the G2. For those of you rating this app and giving five stars even though it doesn't work on your device, STOP.  People looking into this app may not read your review and just look at the average rating. If you want the app fixed, rate it properly to reflect that it does not work in your current device. "], ["No Support For LG G2", "  I'm on the road for days at a time and this app was a must have. Worked perfect with my Droid Razr. Just got an LG G2 though, and it doesn't work. Please, please fix it. Paying customer who really needs this app to work on LG G2. Will go back to 5 stars if made compatible.  11/11/13 Update: The latest update has apparently fixed most phones, but still not the LG G2. Extremely frustrating, as I've paid for this app, and would even be willing to pay again since I have a new device. "], ["No longer works on Verizon", "  Now that I finally have the paid version, the newest Verizon update has disabled it. There was a Foxfi update today that I thought might fix it, but no, it still won't work on my S4 "], ["Stopped working", "  I have an S4 on Verizon and it doesn't work anymore.  I get a screen telling me I have to subscribe to Verizon's hot spot service. "]], "similar": ["com.svtechpartners.wifihotspotdemo", "og.android.tether", "com.foxfi.addon", "com.wifi.hotspot", "com.manchinc.android.mhotspot", "com.foxfi.key", "primiprog.waw", "net.szym.barnacle", "com.svtechpartners.wifihotspot", "net.snclab.wifitetherrouter", "com.taiseiko.tetherWidget", "com.majedev.superbeam", "com.bosscellular.wifi.boost", "com.faveset.klink_blue", "com.mstream.easytether_beta", "kr.core.technology.wifi.hotspot", "com.foxfi2"]}, {"appId": "com.opera.mini.android", "moreFromDev": ["com.opera.browser.beta", "com.opera.browser", "com.opera.micro", "com.opera.browser.yandex", "com.opera.mini.android.yandex", "com.opera.mini.vfgroup", "com.opera.browser.classic"], "reviews": [["Little error", "  Few days ago I couldn't access the operamini. I don't know why. When I opened it, it showed blank page. So I uninstall and download it again. Now it back to normal.. oh my saved pages gone :'( I hope this never happen again. I really love this app "], ["Missing something...", "  Facebook lacks profile pictures in news and  some links, video previews are missing. Found a few other things, but it's not anything I can't get around. Very fast compared to factory installed browser. "], ["I am hurt!!!", "  I have been using opera since time remember when! But this time as I updated Opera Mobile to Browser...my Vid download options for FB just disappeared. So I uninstalled and switched to Mini...and the video download option is still gone. :( I am hurt by Opera for the first time...downloaded UC seeing no other way! "], ["Please fix some error..?", "  When i launch a google search and any website it will show nothing , because of that i cannot enter any web....  Oh my english.. "], ["Slow connection", "  i tried downloading files via opmin and xperia neo l  browser, and the winner is  my xperia browser. please fix and improve the speed connection so i can give more stars "], ["No idea", "  Hey mere isme opera mini nhi chl rha h... mene 4 br dwnlod kr lia.. 15 min tk open hi nhi hota h.. pls suggest me kya kru.. mene dlt kr k wps se install b kr lia 3 br.. but phr b nhi chl rha... Pls pls pls suggest.... "]], "similar": ["com.boatbrowser.free", "org.mozilla.firefox", "com.boatgo.browser", "com.jiubang.browser", "com.android.chrome", "mobi.mgeek.TunnyBrowser", "com.uc.browser.hd", "com.mx.browser", "org.easyweb.browser", "com.UCMobile.intl", "com.ww4GSpeedUpInternetBrowser", "com.tencent.ibibo.mtt", "com.ninesky.browser"]}, {"appId": "com.appsverse.photon", "moreFromDev": ["com.appsverse.privatebrowser"], "reviews": [["All gone a bit wrong", "  Used to be my default internet browser on my tablet. Was that impressed I paid for the full version. However since updating it keeps bringing up the ads asking if I want to purchase the full version, if I click yes Play stores gives me an error telling me I have already purchased it. Well no poo sherlock! Hunting down an alternative replacement.shame really "], ["The paid full version of this app is great! I bought this to run ...", "  The paid full version of this app is great! I bought this to run screencasts on my tablet for lectures at my university.  It works great for this! The only reason I gave this 4 instead of 5 stars is because the flash stops if you leave the browser at all causing an error message when  you return to the page. "], ["eh", "  does not work for me at all. It won't load the page I'm trying to access instead I  get loads of ads. Why would I pay for the upgraded version if the free version doesn't work? Why would I waste my money if I can't even tell if the free version works? "], ["0 reaction", "  Doesn't respond when I type.  The pages take forever to appear then quickly disappear. Uses a \"duck duck\" search.  ....  Didn't let me hardly do anything but yet was asking me to upgrade to paid version.   Disappointed, once a great browser cause of the flash player, but not even that works no more. "], ["This app is crap", "  Runs super slow and if you have to leave the page for any reason it doesn't allow you to return. I wasted 10 min trying to do something simple and said screw this. Also, it's not free. "], ["Hate the app", "  I needed flash for online streaming of sports and since droid discontinued it I had to download another browser. This was one of top rated ones on a Google search and I have regretted it ever since I started using it. I had a free version first and it didn't let me browse to any site with flash mode on, it will stick me in a loop of ads and viruses. Just a god awful way for marketing. I finally had to download flash Apk and use it with beta version of Firefox and haven't looked back from that. "]], "similar": ["com.boatbrowser.free", "org.mozilla.firefox", "com.adobe.reader", "com.jiubang.browser", "com.issess.flashplayer", "air.br.com.bitlabs.FLVPlayer", "com.android.chrome", "mobi.mgeek.TunnyBrowser", "com.opera.browser", "com.mx.browser", "com.cloudmosa.puffinFree", "com.cloudmosa.puffin", "com.andy.flash", "com.opera.mini.android", "com.UCMobile.intl", "com.mxtech.videoplayer.ad"]}, {"appId": "com.webascender.callerid", "moreFromDev": "None", "reviews": [["Doesn't always display the correct state and city but otherwise works for me. Fix ...", "  Doesn't always display the correct state and city but otherwise works for me. Fix that and I will be glad to give 5 stars. "], ["White Pages", "  This really helps when different companies call during my work hours. Makes looking at my phone less obvious. "], ["Niscay", "  It works great .... it blocks all the unwanted people out of my life and the caller id is cool it shows the weather. In the state that the person is calling in "], ["Might be a little bipolar", "  this app might be a little bit bipolar... Sometimes it tells you the contact information sometimes it doesn't its not that bad to the point of deletion can use a little bit more work ... Samsung Galaxy s3 "], ["GOOGLE USER", "  GREAT APP, COMES IN HANDY..!! I USE IT A LOT, PEOPLE HAS THIS HABIT OF CALLING ME, BUT YET THEY BLOCK THEIR NUMBER,  IF YOU BLOCK YOUR #, I SIMPLY ( BLOCK THAT UNIDENTIFIED CALLER ) "], ["It's alright", "  Cool it's able to see the names not on my contact list but not all numbers.  So yea I now know who been calling me. "]], "similar": ["jp.naver.line.android", "com.whitepages.cricket411", "com.rcplus", "com.mrnumber.blocker", "net.kgmoney.TalkingCallerIDFree", "com.realcaller.realcaller", "com.whitepages.search", "com.whitepages.localicious", "com.visinor.phonewarrior", "in.andapps.callerlocationin", "in.andapps.broadcastreciverdemo", "com.adaffix.cia.glb.android", "com.viber.voip", "com.whitepages.metro411", "com.contactive", "gogolook.callgogolook2", "com.callerinfo.callerinfo", "com.truecaller", "com.skype.raider", "me.truecontact.free"]}, {"appId": "com.google.android.talk", "moreFromDev": ["com.google.android.gm", "com.google.android.apps.docs", "com.google.android.voicesearch", "com.google.earth", "com.google.android.play.games", "com.google.android.tts", "com.google.android.apps.plus", "com.google.android.youtube", "com.google.android.googlequicksearchbox", "com.google.android.apps.maps", "com.google.android.apps.books", "com.google.android.apps.translate", "com.google.android.street", "com.google.android.apps.magazines", "com.google.android.apps.googlevoice", "com.google.android.music"], "reviews": [["Nicr app", "  Need sms integration! "], ["Cannot send SMS", "  I like the feature of integration with SMS, but it does not work well! I can receive the SMS but cannot send one. Each time it immediately says error when I kick off the send button. Besides, When I swipe out a message, I want to delete it instead of archiving it, at least, an option in settings is supposed to be provided for this! "], ["I like it for texting", "  Edit: mms is working, it's just quicker to send via Hangouts :-)   Hangouts are awesome and working great but I have been having trouble sending mms messages to some people. "], ["Has Potential", "  This app is alright. I like that it stays in sync between my phone and tablet and computers, but not being able to see who is online and available is a strange move. That's functionality that has been in every chat app I've ever used for over 15 years. "], ["Very laggy", "  Slow and at time unresponsive. Other than that its a good app. Just needs some more butter "], ["Better", "  You can now supposedly see who is on mobile or computer but I don't see it. Adds SMS on my phone so i only have to use one app...great. Wish I could text from my tablet using my phone. The search works well when you know the name but there is no good contact list its suggested people mushed in with my phones contacts. Not many options to customize. Could use a few key features people are expecting for a top messaging app and potentially could be amazing. "]], "similar": ["com.kakao.talk", "jp.naver.line.android", "org.mozilla.firefox", "com.sec.chaton", "com.moplus.gvphone", "com.android.chrome", "com.antivirus", "com.alpha.chatxmpp", "com.facebook.orca", "com.viber.voip", "com.whatsapp", "com.skymobius.vtok", "com.bbm", "com.tencent.mm", "com.skype.raider", "com.sec.spp.push"]}, {"appId": "com.sec.spp.push", "moreFromDev": ["com.sec.chaton", "com.sec.pcw"], "reviews": [["Super powers", "  Before this update was applied I would spend hours (sometimes days) on the toilet trying to go. My old software in my colon was just not good enough.....until now. With the all new Samsung push service not only do I go but I go instantly. Dont even have to wipe due to the sheer brute force.  Thank you! "], ["Thank you", "  I crashed my car down a ravine. Luckily with the latest update of this app, it helped me push it back to the top. It also carried out all the repairs and it didn't cost a thing.  Thanks Samsung. "], ["Saved Thanksgiving!", "  I was on dish duty after Thanksgiving dinner. I looked at the pile of dishes and realized...this is no way to live! I installed the Samsung Push Service and felt a sudden wind at my back that helped me withstand the onslaught of verbal abuse that my wife dished out as I told her I was not going to do the dishes. Within minutes my wife was scrubbing pots and pans and I enjoyed a Manhattan on the porch. Thank you Samsung! "], ["Earth has changed changed a lot here.", "  This is an awesome app. My life has changed a lot. After the previous update my android's camera started recording smell along with the video and audio. This is nothing compared to what happened after the last update. The update installed a time travel app. Now don't even try to guess what happened after that. My tab is running on android 98.0.2 chocolate burger. Not enough, take this, I am posting this from neptune while teaching some aliens java++.Just push and it catches your dreams. Awesome app. "], ["Rejoicing", "  Samsung Push Service has restored my morning bowel movements back to the regularity of youth. My colon has never been cleaner. "], ["Life changer", "  Reading the reviews, i was skeptical at first, but decided to give it a shot. As soon as the download is complete, i experienced this tingly sensastion all over my body, within seconds of it happening i immediately lost my arms and legs and grew ten times longer than my original self. Now i'm a worm god, having almost a billion worm followers. This app has definitely changed my life! Thanks samsung! "]], "similar": ["com.google.android.gm", "jp.naver.line.android", "org.mozilla.firefox", "com.samsung.videocloud", "com.google.android.talk", "com.android.chrome", "com.antivirus", "com.kakao.talk", "com.facebook.orca", "com.viber.voip", "com.whatsapp", "com.opera.mini.android", "com.bbm", "com.tencent.mm", "com.skype.raider"]}, {"appId": "com.p1.chompsms", "moreFromDev": ["com.p1.chompsms.themes", "com.p1.chompsms.emoji"], "reviews": [["Only a few things keeping me from buying a license...", "  This is a great SMS app. I will buy a license when the app adopts the new flat look of Android 4.4. The menus look kind of like old iOS, which clashes with the look of my Nexus 5. Otherwise, love it ðŸ‘� "], ["Loved the app until it stopped notifying...", "  The best messaging replacement out there, imo. However 2 days ago (assuming update on the 19th) has broken the notification feature. Which essentially makes the application useless I want to manually open the app every X minutes. Please fix this, as I want to continue to support your product. "], ["MMS error", "  Used to work just fine till the random updates.... now I can't send or receive picture messages using the app. Uninstalled. "], ["APN settings?", "  I've loved this app since always, way better than go SMS or any other stock messaging alternative. up about until after the update I can't send or receive pictures, I get a reoccurring \"check APN settings and tap to retry\" notification. my APN has always been at&t? this issue needs to be fixed please! such a shame for a good functioning app to go down because of this "], ["Great support!!", "  I was having trouble with my APN settings and MMS messages.  Email support replied immediately and fixed the problem.  :-D "], ["Very cool..", "  I really like this SMS app! I like how I can customize & make my messaging cute & fun. The only problem I have is that the system freezes at times when I reply to a text. Other than that minor issue..I like it "]], "similar": ["com.jb.gosmspro.theme.birdlover", "com.jb.gosmspro.theme.gjtheme2", "com.jb.gosms.theme.sweet", "com.jb.gosms.theme.getjar.wpseven", "com.ani.apps.sms.messages.collection", "com.textra.emoji", "com.jb.gosms", "com.jb.gosmspro.theme.dark", "com.mysms.android.sms", "com.jb.gosms.theme.getjar.cutemonster", "com.jb.gosms.widget", "com.ninja.sms", "com.textra", "com.twentyfoursms", "com.textra.gif", "com.jb.gosmspro.theme.icecream", "com.handcent.nextsms", "com.jb.gosmspro.theme.go", "com.jb.gosmspro.theme.loveletter"]}, {"appId": "net.comcast.ottclient", "moreFromDev": "None", "reviews": [["Works somewhat", "  I can receive emails and read them as usual. However, I cannot listen to voicemails. It shows me that I have a few new ones for instance, but I cannot select any at all. Even the multi-select check box next to each one requires a few taps just to select. "], ["Works for what I need it to do! Only rated it a 4 star, ...", "  Works for what I need it to do! Only rated it a 4 star, due to the lack of wow factor to it! Otherwise its ok! "], ["Better than it was...", "  Ignores logout on exit option, ignores remember me login option between reboots. Seems faster, and the ui has improved. "], ["Xfinity app", "  Update this app used to have several issues, freezing up, caller ID function didn't work properly, but I must now say I am very happy with this app, no real issues on my DROID X2, fixes and updates have fixed most issues I was having  very much improved "], ["I love this app!!!", "  Very easy to use. Able to access each link in my mail and all folders with ease. Works a lot better and is more simple to check than gmail. "], ["Email fine phone horrible", "  No complaints for email. Easy to use. The phone though is different. Nobody can understand me or even hear me when I pick up my home phone using my Droid. I wait for the phone to stop ringing and call them back. Needs improvement. "]], "similar": ["com.zeesoftware.emailnytexts", "com.music.choice", "com.comcast.hsf", "com.whitesky.mobile.android", "com.comcast", "ru.mail.mailapp", "com.all.emails", "com.onegravity.k10.pro2", "com.turner.cnvideoapp", "com.fsck.k9", "com.comcast.xfinity", "net.openvpn.openvpn", "com.yahoo.mobile.client.android.mail", "com.outlook2003", "com.outlook.Z7", "com.gau.go.launcherex.gowidget.emailwidget"]}, {"appId": "com.mediafriends.chime", "moreFromDev": ["com.mediafriends.bndwgn"], "reviews": [["Great app", "  Love it  Crashes from time to time "], ["Amazing!!!!", "  Does everything I need it too works fast and very responsive. "], ["Overall great", "  Sometimes app takes forever to load. "], ["Unstall", "  Won't let me create a profile "], ["Merp", "  slow and stops workin alot "], ["Great App", "  Love it "]], "similar": ["jp.naver.line.android", "to.talk", "com.heywire.bmbh", "com.talkatone.android", "com.texty.sms", "com.verizon.messaging.vzmsgs", "com.glidetalk.glideapp", "com.enflick.android.TextNow", "com.p1.chompsms", "com.apdroid.tabtalk", "com.textmeinc.textme", "com.hushed.release", "com.viber.voip", "com.handcent.nextsms", "com.gogii.textplus", "com.jb.gosms", "com.pinger.ppa"]}, {"appId": "com.svtechpartners.wifihotspotdemo", "moreFromDev": ["com.svtechpartners.wifihotspot"], "reviews": [["Keep up the good works", "  This app does the trick very well on my Virgin Mobile Rise by Kyocera. I don't have to search for a signal or go to libraries I just have to be at my house without a router or no service providers come to my address to install.  I want by THIS APP as a PRO version but that version only shows up on the computer no on the phone.  Any reason why please let know "], ["This app is the olny one that has worked so far and is pure ...", "  This app is the olny one that has worked so far and is pure no ads its simple and just flat out amazing woulnt find a better one out there espicaly for older gen phones this is the app for you "], ["Customer service is a Joke!", "  Customer service is a Joke! I tried the free app and it works. I bought it and then it doesnt work. I send an email to customer support and they dont respond for 2 weeks... well after the time I could get a refund.  The worst part was the support response was simply it does not work on all devices "], ["Lite version works great", "  Excellent app. Easy to use and works like it should. Pro version needs to be compatible with all the phones that were able to use the Lite version successfully, though. Don't understand that ordeal. "], ["Awesome! (until Jelly Bean)", "  Seriously, this app was awesome with Gingerbread and Ice Cream Sandwich. So easy, didn't require root, and I could share on car rides. I recently updated my Galaxy S2 to the latest available JB version for my phone and later discovered that this app doesn't work on this OS version. I can't go back so I hope they can fix it. "], ["Works on Sprint with Kyocera Hydro", "  Haven't found another app that works completely. PdaNet+ starts the hotspot, but doesn't allow connections correctly. "]], "similar": ["og.android.tether", "com.USB", "com.stt.mobilehotspot", "com.wifi.hotspot", "com.foxfi", "com.manchinc.android.mhotspot", "com.droidw.wifihotspot", "net.snclab.wifitetherrouter", "kr.co.core.technology.wifi.hotspot", "com.taiseiko.tetherWidget", "com.majedev.superbeam", "kr.core.technology.wifi.hotspot", "hr.t.ht.hotspot", "com.mstream.easytether_beta", "net.szym.barnacle", "share.hotspot.myfi"]}, {"appId": "com.wifi.hotspot", "moreFromDev": ["com.wifi.hotspot.Pro"], "reviews": [["Great app", "  I was away from my desk one day and i needed access to the internet and quick. An associate of mine suggested i try this app. I was very skeptical because i needed this to really work. So i did and i must say THANKS for getting me out of a jam. This app really works. I use it a lot and it doesn't hurt my data plan one bit. "], ["Sprint Galaxy S3", "  I'm really impressed. Works flawlessly.  Thanks SO much dev.  (Here's a kooky idea, if it's not working on your phone DON'T simply b@#$!  about it & give a crummy review, POST your phone make. Duh.) "], ["Why bother", "  No functionality of its own- simply displays an advertisement & is a different way of turning on the built-in hotspot (which is carrier locked) "], ["Help plz", "  I only gave it 2 stars because it clearly does work...I've seen it work for someone else's phone. But unfortunately, when I open the app of my phone, (LG Spectrum, Android system 4.0), and I click on \"wi-fi tethering\", it only shows the UNHIGHLIGHTED option for mobile broadband...I'd definitely would love to have this work for my phone!! Plz get back to me abt what I just might've done wrong! "], ["This is awesome", "  Love it makes me happy use it on xbox full wifi connection ots fast n let friends use it its great!! "], ["Ads; not as short a shortcut as other shortcuts", "  Other tethering shortcuts offer one-click access and no ads; why use this? "]], "similar": ["com.USB", "com.manchinc.android.mhotspot", "com.USB.Pro", "kr.co.core.technology.wifi.hotspot", "com.datapacket.Pro", "com.apptosd.lite", "com.bosscellular.wifi.boost", "com.HomeButton", "net.szym.barnacle", "com.apptosd.pro", "share.hotspot.myfi", "com.majedev.superbeam", "com.stt.mobilehotspot", "com.foxfi", "kr.core.technology.wifi.hotspot", "com.QuickText.Lite", "com.svtechpartners.wifihotspot", "com.mstream.easytether_beta", "com.datapacket.Lite", "com.app2phone.lite", "com.svtechpartners.wifihotspotdemo", "com.bluetooth.Lite", "primiprog.waw", "com.QuickUninstall", "com.QuickText.Pro", "og.android.tether", "net.snclab.wifitetherrouter", "com.taiseiko.tetherWidget", "com.bluetooth.Pro", "com.LockMyApps.Pro", "com.QuickUninstallPro2"]}, {"appId": "com.jiubang.browser", "moreFromDev": "None", "reviews": [["It's nice", "  The browser is nice and much better than most but sometimes it has no reaction and I have to keep clicking something over and over before it responds. Also, the Google images are very bad quality. I'm not sure if its because of Google or this browser but if it can be fixed, please do. "], ["Great browser!", "  The only browser comparable to smoothness of AOSP browser! Has all the features you need. Only complaint is sometimes opening a link in background does nothing. Need to open the same link in background again for it to work. Please fix it. "], ["Hardly ever makes a connection...", "  At first,  I thought this was great. (Galaxy Note)  but the latest update has rendered it almost useless. I do live in an area where the signal isn't great,  but nowadays... 9 times out of 10, it can't connect.  The build in browser on my phone connects almost every time,  I've had to stop using Next.. Not great. "], ["Been slow and v-buggy lately. Reducing my rating to 3.", "  Even after sending many bug reports, feedback on 1.3 beta, It seems like Next - - 1. Browser team haven't been hearing from their users. Address bar now flicker while dragging down from auto hide, making it hard to enter web address 2. Page load animation gives a feeling of slowness now 3. And loads of crashes lately.  Hoping for a more mature browser.  And please devote time in developing necessary things then useless stuff !  Cheers "], ["Flawless", "  Thank you for your reply. Super fast browser.. Best from all But the drawback is whenever we download any new things n if we clear cache file the content is also removed.i hope this problem may get solve soon. "], ["Nice browser.  best so far", "  Lovely Brower,  but the New update keeps crashing . Pretty frustrating.  please fix asap "]], "similar": ["com.opera.browser.beta", "com.android.chrome", "mobi.mgeek.TunnyBrowser", "com.mx.browser", "com.gau.go.launcherex", "com.UCMobile.intl", "com.gau.golauncherex.notification", "com.gau.go.launcherex.gowidget.contactwidget", "com.ninesky.browser", "org.mozilla.firefox", "com.go.multiplewallpaper", "com.gau.go.launcherex.gowidget.notewidget", "com.gau.go.launcherex.theme.blue", "com.gtp.nextlauncher.liverpaper.honeycomb", "org.easyweb.browser", "com.boatbrowser.free", "com.gau.go.launcherex.gowidget.switchwidget", "com.boatgo.browser", "com.gau.go.launcherex.theme.Dryad2", "com.gtp.nextlauncher.trial", "com.gau.go.launcherex.gowidget.calendarwidget", "com.gau.go.launcherex.gowidget.taskmanagerex", "com.gtp.nextlauncher.widget.music", "com.ww4GSpeedUpInternetBrowser", "com.gau.golauncherex.mediamanagement", "com.gau.go.launcherex.gowidget.clockwidget", "com.opera.browser", "com.uc.browser.hd", "com.cloudmosa.puffinFree", "com.opera.mini.android", "com.gau.go.launcherex.gowidget.taskmanager", "com.tencent.ibibo.mtt"]}, {"appId": "com.opera.browser", "moreFromDev": ["com.opera.browser.beta", "com.opera.mini.vfgroup", "com.opera.browser.yandex", "com.opera.mini.android.yandex", "com.opera.mini.android", "com.opera.browser.classic", "com.opera.micro"], "reviews": [["Tablet UI", "  It says it's been optimized for tablets, but the text is tiny & there doesn't seem to be settings for that or much else, for that matter. Also, no ability to import native bookmarks? Just about every third-party browser has that option. "], ["Put Chrome on standby.", "  I love using all the features of Chrome on my desktop and the mobile sync, but every update made it slower and slower on my mobile devices.  I hated the 10 second or more load time.  I used Opera many years ago, glad I have it another try!  I love the fast loads, data saver and news feeds.  Bye bye Pulse too. "], ["Great but not great-great", "  Have save pages feature, fast, well done home screen and UI, just need 2 clicks to add any new search engine, discover tab  Stutter a little bit (just aaa little), can't manage preload search engine, don't have add-ons feature  Waiting for a update^^ "], ["Not good on Nexus 7", "  Tabs are way too big and don't dissappear when scrolling down unlike previous versions. Another step backwards for Opera! "], ["Not Satisfied", "  Im opera fan and always use opera in my pc, but android version since first release has a lot of problems, lags, hanging and bugs. Im not comfortable with this app and im waiting for a reliable and stable version. unfortunanly current release is poor... "], ["Good but....", "  The opera browser is good to browse in my karbonn A21 but downloads suck. If u have automatic resume option for broken downloads like UC browser then I will rate 5 stars. "]], "similar": ["com.boatbrowser.free", "org.mozilla.firefox", "com.boatgo.browser", "com.jiubang.browser", "com.android.chrome", "mobi.mgeek.TunnyBrowser", "com.uc.browser.hd", "com.mx.browser", "org.easyweb.browser", "com.UCMobile.intl", "com.ww4GSpeedUpInternetBrowser", "com.tencent.ibibo.mtt", "com.ninesky.browser"]}, {"appId": "com.adn37.omegleclientlite", "moreFromDev": ["com.adn37.omegleclient"], "reviews": [["To many Captcha", "  I have to complete 3 or 4 Captcha in a row before I can use it. If the conversation ends sometimes I have to do it over again. I get lucky one on awhile and don't get asked for a couple of conversations then it will make me do a bunch of them again "], ["Nooo", "  All the people I have talked to on here were either asking if I was ho*ny,if I had kik,to talk dirty,to get on cam.its the same people! Beware! There is a 22 year old from chicago who will ask you to get on cam.and even if you tell her no she still does it. There has only been like 3 nice people I have talked to. "], ["Make users more happy", "  Need to find out who's promoting other websites and advertising them because it's annoying, and u should create categories. Like girls looking for boys, boys looking for girls, girls looking for girls and boys looking for boys. And what ages there looking for, example:14-16. That would also be a better thing and make people happier. "], ["Cool app", "  If u get past the pervs! I was talking to this girl from uk n we got disconnected sux! She was the first person that actually had a convo with me! Good app tho "], ["Pervs", "  Pretty good app but there's a lot of pervs. I'd like it if I had a nice clean convo but no every guy asks if you want to see his cock "], ["Spy mode", "  Needs fixed cuz I was gonna say hi to pewdiepie and it disconnect on me ... NOT COOL! I give it 3 stars fix the spy mode and ill give it 5 stars "]], "similar": ["com.mx.browser", "com.ndcubed.Omegler", "com.jiubang.browser", "android.androidVNC", "com.bosscellular.curtis", "com.azarlive.android", "com.opera.browser", "org.mozilla.firefox", "com.uc.browser.hd", "com.moobila.appriva.av", "com.foba.omegle", "us.textr.Anonytext", "com.opera.mini.android", "com.jb.gosms.theme.getjar.android", "com.UCMobile.intl", "org.frosty.fromegle"]}, {"appId": "com.quoord.tapatalkxda.activity", "moreFromDev": ["com.quoord.tapatalkxdapre.activity", "com.quoord.xdapad.activity", "com.quoord.tapatalkrwk.activity"], "reviews": [["Buggy", "  This app sometimes force closes for no reason, both on my galaxy s3 and my tablet, most of the time it fails to connect to the forums especially my topics. Seriously annoying, please fix this issue xda ! "], ["Great for browsing xda", "  It's great when it works, but sometimes it can get stuck on start screen. Xda at simplified UI. You got powerful device? I'd suggest just open it from browser. "], ["What is wrong with this app?", "  What happened with this app? I had the premium version that I PAID for because it was very useful to me.  Now with reloading my phone after flashing a new ROM, I get this drek with adds and the ad-free version is no where to be found.   What idiot decided to do this? It was stable before, now it either freezes or FC 3 out of 5 tries.  PLEASE devs, bring back the premium version so I can get rid of the #%$&% adds. I paid once for it, don't know  about a second time. May just go to web browser instead. "], ["Bugs never fixed", "  Will this application ever be updated? When you do back there is 50% chance it stops working and you have to close and reopen app. You can't do any searches, it's so hard finding your phone. Why can't you sort by brands? I can develop an application better than this, and keep it updated. This is not xda like development! "], ["Great developers but can't access pm's", "  Love the app. Primarily because of the hard work and generosity of so many developers. Only flaw I've experienced is any time I try to access my messages 9 out of 10 times it fc. "], ["Certain 4.4 compatibility", "  Some 4.4 roms make this app crash instantly. But its alright. Some bugs, some crashes as others have mentioned but as a user of XDA I refuse to under rate! ;) Five stars for easy access to XDA "]], "similar": ["com.majedev.superbeam", "me.kyberback.developer", "org.mozilla.firefox", "com.peerkesoftware.androiddevelopmentcalculator", "com.jiubang.browser", "com.facebook.orca", "com.rebus.developer.console", "uk.co.lilhermit.android.TrackballAlert", "com.mx.browser", "com.google.android.talk", "info.guardianproject.browser", "com.whatsapp", "com.jb.gosms.mastertm.rootzwikiinspired", "com.UCMobile.intl", "com.modoohut.dialer"]}, {"appId": "com.connectivityapps.hotmail", "moreFromDev": ["com.connectivityapps.outlook"], "reviews": [["you should put a button to empty inbox.. because it's hard when we want ...", "  you should put a button to empty inbox..  because it's hard when we want to delete to many messages.  Everything else pretty ok. "], ["2 thumbs up!!!", "  Even though I've only had this installed or a day, I have to say that I really like the ability to access my Hotmail account and have it updated on my S4 w/out having to switch everything over to a different email account. "], ["Needs work", "  Worked the day I installed it now I just get cannot find webpage everytime I try to open it then it locks up my s3 "], ["Excellent app", "  The best hotmail app available. Works perfectly for me on different devices, I have tried a few others and this 1 is the best. "], ["Does what it says :-) works well", "  Works very well and very fast . Keep up the good work guys :-) "], ["Blu studio 5.5", "  Good application....it's worked successfully on my device. "]], "similar": ["com.dreamstep.wWindowsLiveMSN", "cn.msn.messenger", "jp.tech4u.inspmode", "com.wHotmailLiveMessenger", "com.outlook.Z7", "jp.co.nttdocomo.carriermail", "com.bludroid.blaze", "com.blustudio.mails", "net.pocketmob.hotquick", "sp.mail", "com.app.inboxproforhotmail", "com.mobiletecnoapps.multiplemails", "com.hotmailliveemailnumber2", "com.blustudio.email", "com.skype.raider", "com.womboidsystems.HotmailToOutlook2013"]}, {"appId": "com.sec.chaton", "moreFromDev": ["com.sec.spp.push"], "reviews": [["A couple more updates an it's a rap", "  This app is really good idk what people talking about give it a chance I use it everyday an I'm a geek check my ch I use hangout bbm an whatsapp this one has little things here an there that makes it unique everybody has it but they don't use it so how would you know if it's good or not an plus they going to update it so you can use it as your text message program 2 "], ["HAS ANYONE ACTUALLY \"READ\" THE PERMISSIONS?", "  Has anyone actully \"READ\" the permissions? Saying about how this app can record audibles and take pictures with the camera at anytime WITHOUT your consent!!! Also that the app can access your calander and private information without your consent!!! This app came preinstalled on my tablet n I do not use it but it had to update n I was just messin around n read the permissions n I could not believe what I read.... could someone please explaine this to me or is it just was it says in black n white, NO PRIVACY! "], ["Still Useless &  NOT Even Wanted", "  I don't use it, no one I know uses it. I think it's a waist of space and memory and still think the permissions is outrageous. Please for the love of it stop updating this useless app no one wants. "], ["Load time", "  I think for most ppl the loading  time at start is a choice breaker.  Also,  usually u wanna text someone fast and u have to click a lot to get there.  Make it more intuitive....  It's sad to see ppl owning a Sammy don't use the included free messaging app and prefer paying whatsapp or whatever "], ["Random inappropriate messages", "  I do not want to be messaged by strangers asking for sex! This is supposed to be a messaging app not an open forum. "], ["Not great bit good", "  This is better then use what's up-line but it's cannot call only.other is very easy to use...please update and make it possible to call..n then it's will come to great and we'll give u fives starts full "]], "similar": ["jp.naver.line.android", "com.kakao.talk", "com.nimbuzz", "com.google.android.talk", "com.spartancoders.gtok", "com.android.chrome", "com.google.android.gm", "com.androidsx.smileys", "com.facebook.orca", "kr.co.datawave.facechat", "com.viber.voip", "com.whatsapp", "com.bbm", "com.tencent.mm", "com.skype.raider", "kik.android"]}, {"appId": "com.foxfi2", "moreFromDev": "None", "reviews": [["Works! Sprint - Note 2", "  Get the tablet version of pdanet & install on tablet- get Sprint version of Foxfi & install on phone. I used the \"forget\" option for the tablet's prior WiFi connection so I was not connected via WiFi & UNpaired on both the tablet & phone, the prior Bluetooth connection. Go into tablet, select option for bluetooth instructions, follow it. Go to phone & enable Bluetooth, go back to tablet & enable the scan. It popped up a window on each device, verify & hit ok. Then use \"connect\" from tablet & presto! "], ["So sad...", "  This worked for about a day (if you count only being able to use Bluetooth as working). I would gladly pay the money for the pro version if I knew it would actually work. Hot spot doesn't work and prompts me to call at&t and USB doesn't work. I can connect to the internet for only 30 seconds at a time but you can't really do anything in 30 seconds. I'm disappointed that by reading these comments, it's obvious multitudes of people are having issues. Please fix and you can have my money "], ["Works on nexus on sprint", "  Bluetooth and USB connect work. WiFi tether does not. Our opens up the sprint WiFi tether app. Would love if this was fixed. If Wi-Fi tether is fixed I'll buy, until then it's not as much a great value "], ["Automatically shuts off hotspot", "  It lasts 7 seconds and then the hotspot shuts off  saying my plan doesn't have hotspot. Sprint galaxy s4 "], ["Doesn't work for me", "  I have a virgin mobile phone and I know they use sprint towers for service but I can never connect my laptop to the wifi hotspot this little app provides. Id prefer the wifi hotspot instead of using 3g cuz 3g is slow as hell around here "], ["Great, just be patient", "  It is not an easy program to use, that is certain. I'm installing once again on my 3rd phone, and it simply takes some debugging on my end to get it to work.   If you're having issues, check their website. They have plenty of tutorials and troubleshooting sections. "]], "similar": ["com.svtechpartners.wifihotspotdemo", "com.pdanet.tablet2", "com.foxfi", "com.manchinc.android.mhotspot", "com.redbug", "com.foxfi.key", "uk.co.jads.android.netsharer", "com.pdanet.tablet", "com.mstream.e2t", "kr.core.technology.wifi.hotspot", "com.opengarden.android.MeshClient", "com.blue_dun", "com.faveset.klink_blue", "com.mstream.easytether_polyclef", "com.redbug2", "hm.orz.chaos114.android.tethersetting", "com.wifi.hotspot", "com.sprint.trs"]}, {"appId": "mobi.androidcloud.app.ptt.client", "moreFromDev": "None", "reviews": [["Excellent/Brilliant", "  I've recommended this app to all my friends n employers (past/present) ..... Best thing sence sliced bread, lol...... I've been thru 3 phones n each time the first app I go for is the TiKl talk app is far more superior.... It's the Miami Heat of push to talk apps .... Great job !!! Consider this 20 extra stars.... "], ["Like the app", "  I like this app not the best yet and could use some work like being able to turn the notification off, bring able to resend message that don't go tru. also my phone deletes messages on oit's own. better archiveing for incoming voice message do if i miss one i can replay it "], ["Can't use with daughter", "  I would rate this 5 stars but my daughter can't download this on her Galaxy phone. that was the only reason I wanted it was to keep in contact with her. "], ["Doesn't work.", "  It just says TIKL is optimizing, and won't ever open into the program anymore. "], ["Worked for over 7yrs", "  It now consumes too much power.  If it gets fixed ill get it again "], ["Horrible app", "  Only works some times and if you miss someone you miss them no way to replay the message and you can't pick anyone in your list and no way to put it on mute "]], "similar": ["com.kakao.talk", "jp.naver.line.android", "com.keechat.client", "com.talkray.client", "com.loudtalks", "com.facebook.orca", "com.google.android.talk", "com.ktix007.talk", "com.antivirus", "com.google.android.gm", "com.apdroid.tabtalk", "cl.nextel", "com.rebelvox.voxer", "com.viber.voip", "com.whatsapp", "com.vomessenger.client", "com.tencent.mm", "com.skype.raider", "soo.trans.tour"]}, {"appId": "com.p1.chompsms.emoji", "moreFromDev": ["com.p1.chompsms.themes", "com.p1.chompsms"], "reviews": [["Fix!", "  This does a good job with having the new emojis and all but this '>_>'  and this '=-o'  and several others aren't emojis correct them please I don't want to look like an ediot when trying to send emojis to friends and they receive those instead "], ["Used to like it..now sucks!!", "  When I send them to other smart phones...all they get is punctuation. When they r sent to me...that's all I get also. What's the point In having it??? Rate will go up if fixed!! "], ["Great try", "  But I'm getting force close when dealing with mms... a few other minor issues. But mainly the mms. Would definitely be a 5 star app without these issues. (Note 2) "], ["It wont tell me set it as my keybord !!! And is it avalibe ...", "  It wont tell me set it as my keybord !!! And is it avalibe on a nexua 7 ?????? If it is thumbes up if it isn't thumbes down if you can see the smiled thumbs up î�•î�•î�•î�•î�• "], ["Tmobile iphone problems", "  It would be five stars if it didnt break emoji convos into like 3 messages and there is a issue with viewing emojis from tmobile iphones, it shows up stars. So if this is fixed it would be five stars! Please and thankyou! I really want to view emojis from my friends with tmobile. "], ["There are a lot of iPhone users and Android users that can't see some ...", "  There are a lot of iPhone users and Android users that can't see some of my emojis like the smiles and  kissy face the simple ones that have changed. Please fix! "]], "similar": ["bazinga.emoticon", "com.emojiworld", "com.handcent.plugin.emoji", "com.ani.apps.sms.messages.collection", "com.textra", "com.jb.gosms", "com.tmnlab.autoresponder", "com.textra.gif", "com.textra.emoji", "com.jb.gosms.widget", "com.androidsx.smileys", "com.contapps.android.emojis", "com.ninja.sms", "com.google.android.talk", "com.plantpurple.emojidom", "com.jb.gosmspro.theme.icecream", "com.handcent.nextsms", "ru.vsms", "kr.co.tictocplus"]}, {"appId": "com.youmail.android.vvm", "moreFromDev": ["com.youmail.callerid"], "reviews": [["What the what??", "  \"This permission allows the app to record audio at any time without your confirmation\".. Yea, no I'm good. "], ["not even one star", "  for ditched callers, it rings 2x n goes to voicemail, they can leave messages, the greetings don't work. what a waste of my time. "], ["Pretty good BUT......", "  A LITTLE TRICKY TO GET SET UP BUT I THINK I LIKE IT. Will review again later.  Revised. Works when it works.too many people are telling me that are getting no greeting at all & can't leave a message. Seems it can't work if I'm on another call and not also on Wi-Fi. Would love to have a fix for this but need to uninstall.  Missing too many calls, costing me money. "], ["Love it", "  I love not having to listen to 10 voicemails to listen to the last one. It works great I had a problem with static sound and they helped fix it good customer service "], ["Read The Privacy Policy 1st", "  I was going to use this app until the privacy policy states you may use our personal information for 3rd party marketing research and sales. I also read that you store all voicemail data and that by using any part of your service subjects all personal information to become public. Apparently people havent read this or your ratings would be much lower. No thanks. My voicemails are meant to be private, not for you or other agencies to freely listen to and use for research! "], ["Love It!", "  Went from an iphone to a note 2, so I was upset when I realized I had lost my visual voicemail, I downloaded a few options and this was and is by far the BEST one! I definitely recommend it "]], "similar": ["lifeisbetteron.com", "com.rogers.vvm", "com.vzw.vvm.androidclient", "com.freedompop.vvm", "com.moviuscorp.cricketvvm", "com.metropcs.vvm", "com.phonefusion.voicemailplus.and", "com.moviuscorp.openmobilepr", "com.att.mobile.android.vvm", "com.voxsci.app", "com.fonyou.mercury", "com.hullomail.messaging.android", "com.moviuscorp.cellcomvvm.com", "com.bestitguys.BetterYouMailPro", "com.mizmowireless.vvm", "com.google.android.apps.googlevoice"]}, {"appId": "com.yahoo.mobile.client.android.imvideo", "moreFromDev": ["com.yahoo.mobile.client.android.fantasyfootball", "com.yahoo.mobile.client.android.search", "com.yahoo.mobile.client.android.fantasybaseball", "com.yahoo.connectedtv.yremote", "com.yahoo.mobile.client.android.fantasybasketball", "com.yahoo.mobile.client.android.yahoo", "com.yahoo.mobile.client.android.weather", "com.yahoo.mobile.client.android.flickr", "com.yahoo.mobile.client.android.finance", "com.yahoo.mobile.client.android.mail", "com.yahoo.mobile.client.android.im", "com.yahoo.cricket.ui"], "reviews": [["App doesn't work most of the time on my Android", "  Sometimes, (not often) the voice call feature works, but then it hangs up on you in the middle of the conversation and you have to hope you can call the person back. Text messages sent or received sometimes take a day to arrive. I can't post this unless I give it at least 1 star, but this app doesn't even deserve that. If it gets fixed I'll update my review. "], ["Unable to use video chat/call", "  i have tested extensively on different HW. The video chat does not work between android and windows OS versions. Is there work in progress to fix this issue? RR "], ["not compatible with the galaxy tab.", "  it is nice to know the glitch has been fixed, but i can't install. The update to use it. You fixed one issue just to create new one.issue "], ["Camera issues with galaxy tab 7.7 and Does not let you type whilst watching ...", "  Camera issues with galaxy tab 7.7 and Does not let you type whilst watching cam\tEven though you state the camera orientation issue has been sorted I am still seeing an issue with the Samsung galaxy tab 7.7. I am always on my side no matter whether I hold the tablet in landscape on portrait mode. Also some times you can't chat on voice but need to text chat while viewing cam. I please make this possible "], ["What just happened?", "  I tried to accept an incoming video request and not only would it not work on my Verizon Galaxy S 3 but when I didn't reject the request it kept ringing even after I logged out of Messenger until I rebooted the phone. "], ["What makes it worse", "  Is that I can't uninstall any yahoo apps even though i'm done trying them so they just keep turning themselves on and eating on my ram. I can ofcourse work around it but shouldn't have to. A big thanks to HTC for adding all this bloat and making your phones the hardest to root "]], "similar": ["com.kakao.talk", "cn.msn.messenger", "com.mobiletecnoapps.multiplemails", "com.nimbuzz", "com.wHotmailLiveMessenger", "com.protrade.sportacular", "com.spartanbits.gochat.yahoomessenger", "com.ebuddy.android", "com.beejive.im.yahoo", "com.facebook.orca", "com.whatsapp", "im.mercury.android", "com.intonow", "com.chikka.gero", "net.daum.android.air", "com.catfiz", "com.skype.raider", "kik.android"]}, {"appId": "com.moplus.gvphone", "moreFromDev": ["com.moplus.moplusapp"], "reviews": [["Missing Voice mail, Cant change status", "  Good app with clean interface. But missing two important features:  1- You cant access your GV Voice Mail 2- You cant change your status it's either Available or Busy with \"mo+ ... free calls\" status Moved to talkatone "], ["Love it but....", "  Awesome! But doesnt seem to hold calls to well also has a delay in call responses..hate having to repeat myself other than that its what i needed regarding businesses and getting in contact with clients asap. Overall its definitely worth the down load and its freeeeee! :) "], ["My phone is now complete.", "  Finally, an app to call over wifi!  This is absolutely terrific for many reasons.  Just think for 10 seconds and you'll find some great uses for it.  Now all those pesky cell phone companies have something to worry about!  :) "], ["Decent. Call quality could be better", "  Sometimes the calls aren't very clear. Texts go right through. Not bad "], ["Good but needs lots of improvement", "  The app could be a lot helpful sometimes and sometimes its just irritating. There's no volume control and volume control on my device, headset or Bluetooth won't work on it so I hear crazily loud voice from the other end. Also, network has to be really good to enjoy it otherwise there will be lots of waiting time for response. Overall I rate the app slightly above average. "], ["Good app with caveat", "  Doesn't work very well over 3G. Calls are delayed 3-5 seconds. However, it works very well over wifi and serves it's intended purpose very well. For a free app it is fantastic. "]], "similar": ["hu.xilard.voiceplus", "jp.naver.line.android", "org.mozilla.firefox", "com.facebook.orca", "larry.zou.colorfullife", "net.init0.android.liveware.extension.gtalknotifier", "com.google.android.talk", "com.android.chrome", "com.kakao.talk", "com.alpha.chatxmpp", "com.talkatone.android", "com.viber.voip", "com.whatsapp", "com.skymobius.vtok", "com.google.android.apps.googlevoice", "com.skype.raider"]}, {"appId": "it.medieval.blueftp", "moreFromDev": ["it.medieval.castle", "it.medieval.dualfm_xt", "it.medieval.license"], "reviews": [["Waste of my time", "  I tried to transfer files both to PC and tablet. Both gave messages that files were ttansferred succesfully but no files moved, only empty shells. "], ["Works well", "  Seems to be limited to internal sd only. I have three sd's, so I need to be able to see all SD's on my ASUS Transformer TF300T. Is this going to happen? "], ["Works but not robust", "  Works well for transferring files from my phone to my tab, but it is not very robust. Doing other things while transferring sometimes kill the transfers and it doesn't exit cleanly, leaving hung transfer progressbar. Haven't found better anyways, as long as you know its limitations it is ok. "], ["Very poor app...", "  When i connect to any other bluetooth device it only shows the folder name not the inner content....plzzz give me any solution....for which i'll give u 5 star..plz... "], ["Need improvements", "  1)title bar +status bar +THIER ADVERTICEMENT SPACE = Together they carries a lot of space so hardly there is place for displaying files 2) one canot cancel requesting while requesting for FTP connection is going on app wont respond & the only measure left is to switch of bluetooth and again turn it on 3)no option to hide the annoying pinch zoom button 4)both in list&thumbnail views name of the files canont read  , are unreadably small 5)multiple launguage option is useless 6) ES file manager is better "], ["Very handy", "  File transfer easily over BT. Never had issues with this app. Too bad BT doesn't support this functionality out of the box on all phones I've seen. "]], "similar": ["org.mozilla.firefox", "com.vvmaster.android.bluetoothreconnector", "cz.rozkovec.android", "com.chirag.whatsappBluetooth", "com.estrongs.android.pop", "com.bluetooth.Lite", "org.joa.zipperplus", "com.sonymobile.smartconnect.collins", "com.wiSocial.widgetBluetoothDiscoverable", "com.floriandraschbacher.fastfiletransfer", "com.iodroidapps.btaf", "com.whatsapp", "org.myklos.btautoconnect", "it.vanini.ottavio.android.utility.bt", "com.stwh.bluetooth", "com.skype.raider"]}, {"appId": "com.vonage.TimeToCall", "moreFromDev": ["com.vonage.MobileExtension"], "reviews": [["Needs Auto rotate", "  App works well, but it is lacking auto rotate into landscape mode. What's the point of having it on my tablet if I have to hold it in portrait mode only. I would give it a higher rating if this was added to this app. Will be looking for a different app because of this. "], ["Thank you!!! [Verizon android commando]", "  Now I can say Happy Thanksgiving to people:) I'm am so happy with how quickly you fixed that bug! I love this app:))) "], ["Nice written app", "  This app delivers and works like a charm but video call quality needs some work. Today it's been acting up. I'm using it on a nexus 5 and it keeps  force-closing whenever I try to make calls. Please fix it! Thanks, Dev! "], ["Why GPS? Needs widget and better volume", "  Why does Vontage need to know my precise location? At most WiFi should suffice.    Also the speaker volume is not very loud. It is only slightly louder than the ear piece, and no where near as loud as the phone is capable of.  Otherwise, it works great... but I would like a widget that allows me to one click dial a contact. Decreased to two stars due to call quality. Listening is fine, but talk quality is insufficient. Listeners report that they cannot understand me. One described it as sounding like a jet airplane half called him. "], ["Kit Kat crash fix", "  App is good.  If the app is crashing for you in kit kat do the following:  Go to android settings -> \"more\" under wireless & networks -> mobile networks -> access point names -> choose the preselected button (likely T-Mobile GPRS) -> APN Protocol -> Switch it to IPv4/IPv6.  Basically TMobile is IPV6 only for certain devices (nexus 5, note 3) and Vonage uses IPv4. This will fix the issue. "], ["Sound quality was really bad", "  Call quality was bad either on WiFi or 4g. The international phone call is painfully unbearable. Their rate is higher but poor quality. "]], "similar": ["jp.naver.line.android", "com.kakao.talk", "com.talkray.client", "com.imo.android.imoim", "com.fring", "com.icall.android", "com.wephoneapp", "com.textmeinc.textme", "com.viber.voip", "com.maaii.maaii", "com.yuilop", "com.talkatone.android", "com.tencent.mm", "ru.mail", "com.skype.raider", "com.pinger.ppa"]}, {"appId": "com.verizon.messaging.vzmsgs", "moreFromDev": "None", "reviews": [["Great app just two complaints", "  My only complaints are no texting over wifi on my phone and no way to resend message easily if it fails the first time "], ["Good... Kind of", "  The application does not use push notifications. So when you get a message you may not necessarily get it for over 12 hours later. I recommend it if you needed messaging application on more than just your phone, but if you're using it for just fun and rely on notification I do not suggest it. "], ["So far not bad.", "  More customization would be cool but being a branded app I won't hold my breath. "], ["Love it!", "  Works great across my phone, two tablets and my laptop. "], ["An actual useful app from Verizon.", "  I have to give credit where credit is due.  This is a very good app.  I now can send and receive text messages on my 2013 Nexus 7 wireless only.  Works great. You only need it on your tablet but you might want it on your phone also to use some of the features. You'll have to know your \"My Verizon \" account or set up a new one like I did using your phone #. "], ["Yay", "  It does everything right "]], "similar": ["com.contapps.android.messaging", "com.jb.gosms.messagecounter", "com.asurion.android.verizon.vms", "com.apdroid.tabtalk", "com.vzw.hss.myverizon", "com.vznavigator.DROIDX", "com.vznavigator.SCHI545", "com.p1.chompsms", "com.vznavigator.ADR6410LVW", "com.funapps.smshub", "com.fusionone.android.sync.baclient", "com.mediafriends.chime", "com.vznavigator.SCHI535", "com.vznavigator.Generic", "com.talkatone.android", "com.glidetalk.glideapp", "com.textmeinc.textme", "com.hushed.release", "com.gdacarv.app.mensagensparacelular", "com.vzw.accessories", "com.vzw.hss.myverizonged", "jp.naver.line.android", "com.vzw.vvm.androidclient", "com.ani.apps.sms.messages.collection", "com.vcast.mediamanager", "com.jb.gosms", "com.mysms.android.sms", "com.ThumbFly.FastestSms", "com.vzwcorp.mcs.MobileMediaStore", "com.vznavigator.SCHI415", "com.vzw.hss.myverizontabletlte", "com.vznavigator.VS9504G"]}, {"appId": "com.jb.gosms.theme.getjar.christmaseve", "moreFromDev": ["com.jb.gosmspro.theme.birdlover", "com.jb.gosmspro.theme.gjtheme2", "com.jb.gosms.theme.sweet", "com.jb.gosms.theme.getjar.wpseven", "com.jb.gosmspro.theme.paradise", "com.jb.gosms", "com.jb.gosms.theme.getjar.cutemonster", "com.jb.gosmspro.theme.dark", "com.jb.gosmspro.theme.thief", "com.jb.gosms.indivitheme.snowlove", "com.jb.gosmspro.theme.grey", "com.jb.gosmspro.theme.icecream", "com.jb.gosmspro.theme.party", "com.jb.gosmspro.theme.go", "com.jb.gosmspro.theme.loveletter", "com.jb.gosms.themetwo.getjar.seabed"], "reviews": [["Well Duh You Pay", "  It cracks me up, everyone complaining about having to pay for the themes.  How do you think the app runs? They need a way to fund it. It costs $$ to upgrade the app FOR YOU.  You think they do this for free and out of pocket, just because?  Stop complaining and don't pay for the theme if it's such a huuuuggee problem.  Cause I'm sure that 1.99 broke your bank right? I rated 4 stars cause I'm not totally in love with the theme, but it's better than the other xmas themes. "], ["Caught me out", "  I hate these getjar things , I need to pay more attention in future     Definition of free is without cost or payment I value my details so I dont count handing them over to getjar as \"free\" Theme should clearly display \"free with registration\" "], ["Getjar", "  This getjar gold crap Is getting old. Can rarely find a theme that doesn't have it. Been having to make my own entire themes. "], ["Love it", "  So cute and perfect to get into the holiday spirit â™¥ "], ["NOT WORKING", "  Got this through a IAP, and it keep saying  that is being applied. Thirty minutes later and I'm still waiting. Refund my monies ore fix it I prefer the latter "], ["SUPERCOOL", "  Myphone looks good to this app .. wooohoo really love it..! ****** "]], "similar": ["com.jiubang.goscreenlock.theme.colorblue", "com.gtp.nextlauncher.theme.future", "com.gau.go.launcherex.theme.WP7Blue", "com.gau.go.launcherex.theme.ABLACK", "com.gau.go.launcherex.theme.technology", "com.gau.go.launcherex.theme.lovepetal2", "com.jiubang.goscreenlock.theme.dark", "com.jiubang.goscreenlock.theme.redheart", "com.jiubang.goscreenlock.theme.joke.getjar", "com.gau.go.launcherex.theme.BluePlanet", "com.jiubang.goscreenlock.theme.carnival.getjar", "com.jiubang.goscreenlock.theme.starrysky.getjar", "com.jiubang.goscreenlock.theme.rix.getjar", "com.gau.go.touchhelperex.theme.greenlight", "com.gau.go.launcherex.theme.rainbownight", "com.jiubang.goscreenlock.theme.cyrix"]}, {"appId": "com.moplus.moplusapp", "moreFromDev": ["com.moplus.gvphone"], "reviews": [["It is sooo easy...", "  I downloaded & signed in with my gmail account, made a call & it worked. All I have to do now is set up my phone number. "], ["Eh, its ok.", "  I can make calls, though slightly delayed. Cant text at all, just keep getting an error. Galaxy S3. "], ["Won't work", "  Won't dial to make a call and when I call the new number it provides for my service, it asks me for a pin number. How do I acquire a pin number? Trying to see if I can contact support to see if I'm doing anything wrong, but I don't see how to contact them. "], ["Needs more feature", "  Runs smoother than talkatone considering beta only but still lacking because no way people can receive and send pics. Needs to allow some level of ringtone and wallpaper customization. I cannot tell who's trying to call me. There's no way to receive incoming call. Let us remove the signature and put our own "], ["Pretty good", "  App works quite well but I have it 3 out of 5 due to the time delay between me and my caller. I often end up talking over them and it makes me sound unprofessional. "], ["Want to enjoy", "  I was trying to love the application but timing irritates me... calls ends after pulling away from ear and freezes app.. and notifications comes late sometimes I love the interface and would really appreciate new update and I'll proudly really download until bugs are fixed uninstalling "]], "similar": ["jp.naver.line.android", "com.kakao.talk", "com.talkray.client", "com.rebtel.android", "com.gvoip", "com.talkatone.android", "com.icall.android", "com.fondora", "org.netTalk.smartphone", "com.textmeinc.textme", "com.viber.voip", "com.maaii.maaii", "com.yuilop", "com.fring", "com.gogii.textplus", "com.pinger.ppa"]}, {"appId": "com.contapps.android", "moreFromDev": ["com.contapps.android.call_log", "com.contapps.android.dialer", "com.contapps.android.messaging", "com.contapps.android.emojis", "com.contapps.android.old", "com.contapps.android.merger", "com.contapps.android.widget"], "reviews": [["This is one of the brilliant app", "  i liked it a lot. Just wished if i can get more themes and customization. Plus it would be great if i could get Message+ separately without installing the Contact+. The close button (X) in popup, should close the popup but keep the sms Unread. EDIT: in popup, latest sms comes in last, i want latest the first. sometimes i close popup by pressing Home key, and then read sms via Notification Bar, but then if any new sms comes then all previous-read-via-notification bar-smss also come in queue, and sure the latest new one sms comes in last in queue in popup, which is annoying because i have to go through all of them to get the new one. and most the times few sms remained Unread, IDK why, though i \"read\" them again and again but Unread don't go. and one other request, please bring traditional Inbox Outbox folders in Message+ as an option. i'm suggesting because i love the app, and i want it just perfect. One more thing when i open message thread, and press Menu Button, then bottom option is Delete Contact, please change it from Delete Contact to Delete Thread instead, i have deleted many contacts mistakenly thinking it as Delete Thread. (who wants to delete contact from Message+??) "], ["nice but..", "  i have move it in my sd card (rooted device) and every time it updates, it moves back in internal storage.. in addition it would be handy if shortcuts could be used like default contact shortcuts (expand and choose wether to call or text etc) "], ["Looks great", "  Started with ex dialer, though after trying this one out I'm appreciating the extra features bundled in this.  Right on ðŸ˜„ "], ["Concept is appreciated!", "  App lags a lot even in a device with 1gb ram..Every command takes few to several seconds to act..It may irritate some time that it makes me to use stock app..very much buggy as of now..nevertheless, the concept is very much appreciated "], ["Great, almost fabulous", "  I really like all the features this app has and I love having my contacts, texts, and calls all in the same place. The only thing that would make it better for me would for it to be a little faster on my Android RAZR. "], ["Manually switching #s to text people with 2 phones is stupid.", "  It's almost 2014, this should be an automatic function. It is in stock text apps. Fix it!    Another text problem: the pop up doesn't track with newer messages, it's always stuck on the first in a series and I have to MANUALLY (that word again) thumb through them to get to the newest one in the queue.  Your contacts app is great, but automation on your text part is terrible. I'm going stock for texts until you fix that. "]], "similar": ["com.dw.contacts.free", "com.jiubang.gopim", "com.miruker.qcontact", "pixelrush.xphonefree", "com.phoneBook", "com.gmail.yuyang226.contactswidget", "net.studiofly.android.ringo", "com.luz.contactdialer", "com.jbapps.contact", "intelgeen.rocketdial.trail", "com.vcmdev.android.people", "com.needom.simcontacts", "br.livroandroid.widget.contatos", "com.modoohut.dialer", "com.gau.go.launcherex.gowidget.contactwidget", "com.vladlee.quickcontacts"]}, {"appId": "com.zlango.zms", "moreFromDev": ["com.zlango.livewallpaper.walkingdead", "com.zlango.livewallpaper.xmas", "com.zlango.livewallpaper.helium", "com.zlango.livewallpaper.bugacow", "com.zlango.livewallpaper.shittyday", "com.zlango.livewallpaper.bobblegumgirl"], "reviews": [["It's a great app but keeps shutting down so I guess I'm going to ...", "  It's a great app but keeps shutting down so I guess I'm going to uninstall it was way too good to be true I reckon got alloy of my friends to use it now I regret it!\tSorry "], ["Nice app slow though", "  App lags so someone can text you so many times before you can respond to the first message. "], ["Cool", "  I love this adds a much needed. Spice to txt messaging get this app now highly recommended "], ["Emoji n more", "  It would b totally awesome if the small emojis were included with the app n that u can change the background profile n the profile pic other than that it's pretty cool "], ["Love it", "  you don't have to download three different apps to get icons like emoji "], ["Slow", "  It's very slow, & not functional enough for me, but very nice emojis! "]], "similar": ["com.texty.sms", "jp.naver.line.android", "com.klinker.android.messaging_donate", "com.thinkleft.eightyeightsms.mms", "com.gamedom.saomessaging", "com.facebook.orca", "com.jb.gosms", "com.mysms.android.sms", "com.ThumbFly.FastestSms", "biz.devsign.android.mms", "com.textmeinc.textme", "com.sonyericsson.extras.liveware.extension.messaging", "com.whatsapp", "com.concentriclivers.mms.com.android.mms", "net.mobitexter", "com.p1.chompsms"]}, {"appId": "net.idt.um.android.bossrevapp", "moreFromDev": "None", "reviews": [["Fantastic", "  I was waiting for this for long time. Is not like the other phone cards Dialing the pin number over and over   is a very good app  I recommend this app. Es lo mejor en tarjetas. Solo marcas el numero de telefono y es todo no como las otras tarjetas la recomiendo 100% "], ["Awesome", "  I sell Boss Revolution at work and get tons of customers daily going in to refill, I never thought of trying it myself but now that I have, it's an amazing product and this app is top notch. "], ["very cool app", "  love it its easier to call , it works really good thanks "], ["Great honest service", "  The best service and honest I ever seen ! Am not buying cards any more! Keep up the good work "], ["Over heating", "  I finally got the app to work after changing the settings. Working good with wifi.My handset(galaxy s4)becomes too hot to touch. Scared to use the app. "], ["Calling is now easier than before!", "  As a frequent user of Boss Revolution, the service itself was no hassle and very easy to use. This app now makes using their service easier than ever before! Greatly satisfied with the app. Trust me, it's worth the download! "]], "similar": ["finarea.MobileVoip", "com.gvoip", "com.textmeinc.textme", "org.sipdroid.sipua.bossrev", "com.saytya.caller.android", "com.ghosttelecom.android.footalk", "com.totalreup.makeinternationalcalls", "org.netTalk.smartphone", "com.totalreup.internationalcallingfromandroid", "com.talkatone.android", "com.maaii.maaii", "com.yuilop", "com.wephoneapp", "com.black011.android", "com.vonage.TimeToCall", "com.voip.callsapp"]}, {"appId": "com.yuilop", "moreFromDev": "None", "reviews": [["Finally a virtual mobile", "  Real, new mobile number makes calls to phones that don't even need the app! You need to top up credit, but they give ways to do that for free. You can save a fortune on overseas calls. "], ["Sucks", "  This app sucks. Wont ever connect even though I have a strong Wi-Fi connection. Doesnt work at all. Alway s says trying to connect surver. Dont download save yourself tge trouble "], ["Free calls..where?", "  App gives only 5 credits (=2 min. talktime in india) !  This is just sh*t as i thought the app would allow us to make free calls unlimited times . "], ["No calls or sms", "  It wont let me make outgoing calls, because it wont connect even though i have a strong wifi connection. Also, i can't recieve sms messages and my partiy don't receive mine. PLEASE FIX IMMEDIATELY! "], ["BEST CALLING APP EVER", "  Really great quality, i dont have to pay, (unless its international but i already have 10 credits) i recommend it a lot, this app trips over text me, text now, viber, oto, textplus, and even google voice, the only thing i dont like is that i cant send pictures or videos "], ["I gave 5 stars", "  It really work.... No mins thanks I love this app Try people "]], "similar": ["jp.naver.line.android", "lifeisbetteron.com", "com.talkray.client", "com.textmeinc.textme", "com.talkatone.android", "com.kakao.talk", "com.rebtel.android", "com.jb.gosms", "com.viber.voip", "com.maaii.maaii", "com.wicall", "com.twentyfoursms", "com.fring", "ru.mail", "com.skype.raider", "com.pinger.ppa"]}]