[
    {
        "appId": "com.xs.findobject",
        "moreFromDev": "None",
        "reviews": [
            [
                "New",
                "  I still little bit confused with this object and how to play the game. Is the life just only 3? And the lifes will automatically fill up for another minute? "
            ],
            [
                "Not sure",
                "  Well it can be addictive, but the pics don't really match what they ask for! Kettle is NOT a flower vase!! Saxophone is a horn!! Fix it big time "
            ],
            [
                "Fun and cool graphics!",
                "  it's a fun game yet not that easy at the start but thanks to the very helpful hints. I enjoy the game now with its cool and colorful graphics. "
            ],
            [
                "I love hidden object",
                "  ever since I was a little girl I have always loved to do the hidden object games. playing this one has made me remember how sweet it was to have no worries and have fun as a child. I recommend this game to anyone who just wants to sit back and enjoy remembering an easier time "
            ],
            [
                "Amazingly addictive",
                "  Great game! I am learning more and more tricks as I go. The only issue I have encountered is I am running out of boards ;-) "
            ],
            [
                "Love it.",
                "  Works great and so much fun. Awesome time killer with out being boring and repetitive. "
            ]
        ],
        "similar": [
            "com.disney.wheresmywater2_goo",
            "com.ssc.baby_defence",
            "com.bigduckgames.flow",
            "com.easygame.marblelegend",
            "com.wordsmobile.baseball",
            "com.julian.fastracing",
            "com.disney.WMWLite",
            "com.zeptolab.ctr.ads",
            "air.com.mobigrow.canyouescape",
            "com.zeptolab.timetravel.free.google",
            "com.game.JewelsStar",
            "com.magmamobile.game.BubbleBlast2",
            "com.melimots.WordSearch",
            "com.shootbubble.bubbledexlue",
            "com.magmamobile.game.HiddenObject",
            "logos.quiz.companies.game",
            "air.com.nextdifferencegames.Lost.Hiddenobjects",
            "com.junerking.dragon",
            "com.kiragames.unblockmefree",
            "com.dm.restaurant",
            "de.lotum.whatsinthefoto.us"
        ]
    },
    {
        "appId": "ppl.unity.JuiceCubesBeta",
        "moreFromDev": [
            "ppl.unity.lostcubes"
        ],
        "reviews": [
            [
                "Addictive",
                "  Its really good to kill time. If you love Candy Crush But hate it at the same time, you'll love this game! Dont believe me, you'll see. "
            ],
            [
                "Juice Cube",
                "  Don't have anything else too give me good to move on.  If u are stuck for so long their should be a way to proceed.  It says if you get so many hearts you can get gold I am not I like playing the game. But if I can't go any further its worthless to have started it in the first place.help me move on. ..... "
            ],
            [
                "No more Pay to play! Thanks!",
                "  Thanks so much for adding the map piece raffle! Now it gives players a way to continue playing the gamw. "
            ],
            [
                "Fun Bullcrap! :-)",
                "  Level 45 is rigged!! It's freakin impossible. And they only give you about 8 gold bars  throughout the whole freakin game even though you need gold bars to freakin do anything!! Other than that it's great fun! "
            ],
            [
                "Won't load",
                "  The game hasn't loaded for 2 days now. It was fine at first but now I'm having issues with it. I think there was an update recently so that must be the problem. I got this game to take a break from crushing candy but I'm gonna have to uninstall it. "
            ],
            [
                "Seriously?",
                "  So playing this game is awesome.  But when you have  to Spend money just to get past the 35th level  I'm done.  Oh you can bug your Facebook friends too but who wants to do that?  And after 3, 8 hour searches (that's 21 hours) for 3 maps,  I've found a whopping 1. So yes I'm out, it was fun while it lasted. To the Devs I ask \"what's the point of the full screen ads in between each level of at one point you're going to make it impossible to continue? I'd much rather pay for unrestricted access to the game\" "
            ]
        ],
        "similar": [
            "com.magmamobile.game.Cube",
            "com.zeptolab.ctr.paid",
            "com.roviostars.tinythief",
            "com.fivevsthree.android.puzzlecube",
            "com.dnvgoods.theultimateangrybirdsonlinestrategyguide.AOUIAENEQCVARKLRMD",
            "air.com.differencegames.cubecrashfreehd",
            "com.missingames.rescueroby.lite",
            "com.rovio.croods",
            "com.disney.ToyStorySmashIt.goo",
            "com.com2us.sliceit",
            "com.appgame7.friutslegend",
            "br.com.monsterjuice.monstercube",
            "com.zeptolab.ctr.ads",
            "com.kawasoft.gtigon",
            "com.roviostars.tinythieflite",
            "rus.Hapman.ZombieRumble",
            "bonmobilapplications.candycubes"
        ]
    },
    {
        "appId": "com.wooga.jelly_splash",
        "moreFromDev": [
            "com.wooga.diamonddash"
        ],
        "reviews": [
            [
                "Can't get past 40 even if friends unlock",
                "  Good idea but friends have unlocked and can't get further forward. .. keeps going back to needing 3 keys so uninstalling. On level 382 on cansy crush without spending cash so no thanks... "
            ],
            [
                "I played. .got to 40 asked for help, got one, then git 2 and ...",
                "  I played. .got to 40 asked for help, got one, then git 2 and then all disappeared. Login to Facebook, got coins, unlocked, couldn't pass the level before running out of lives and took me back and locked the gate again. "
            ],
            [
                "Forever can't connect to Facebook",
                "  I have a stable connection either when using 4G or Wi-Fi but I'll never manage to link to the progress on my Facebook. Nothing wrong with FB app settings. "
            ],
            [
                "Big No",
                "  Was enjoying game but it doesn't let you go far if you don't link it to fb. So I am removing app.Shouldn't have to have facebook to play a game "
            ],
            [
                "Forced Update. Grr.",
                "  If all the games I have, only this  one has forced an update. And it's a blind update: no idea if the update will negatively impact the game (eg., force close or lose progress). If I had wanted to update this game, I'd've chosen to do so already. "
            ],
            [
                "Whats happen?",
                "  At first i thought it was a great game, untill i get to level 40... I already pay 70coins to pass the gate, unfortnately when i got out and try to play again, im shocked that im still at level 40 and the most shocking is all my coin is gone!!... So my question is \"What happen?\". Can the person that in chare in creating this game give me a good and reasonable answer? "
            ]
        ],
        "similar": [
            "com.ecapycsw.onetouchdrawing",
            "jp.naver.SJLGRUSH",
            "com.kiragames.unblockmefree",
            "com.outfit7.jigtyfree",
            "com.zeptolab.timetravel.free.google",
            "com.lt.game.popjelly",
            "com.omgpop.dstfree",
            "com.disney.WMW",
            "com.ruanshaomin.game",
            "com.game.JewelsStar",
            "com.easygame.marblelegend",
            "logos.quiz.companies.game",
            "com.jelly.dash.spree",
            "com.imaginecn.cocos2dx.monsterpop",
            "com.orca.JellyDash",
            "br.com.tapps.jellyfit"
        ]
    },
    {
        "appId": "com.zynga.words",
        "moreFromDev": [
            "com.zynga.draw2.googleplay.free",
            "com.zynga.gswf",
            "com.zynga.scramble.paid",
            "com.zynga.slots.free",
            "com.zynga.warofthefallen",
            "com.zynga.scramble",
            "com.zynga.digitallegends.respawnables",
            "com.zynga.zjayakashi",
            "com.zynga.fatpebble.clayjam",
            "com.zynga.castlevillelegends",
            "com.zynga.matching",
            "com.zynga.hanging",
            "com.zynga.livepoker",
            "com.zynga.zrush",
            "com.zynga.bubblesafari.ent"
        ],
        "reviews": [
            [
                "Galaxy  S3",
                "  I totally love this game!!! Having trouble with my players pics showing, not used to seeing usernames but after the problem they just fixed for me I can live with this one until they get this issue fixed! Words is my link to the outside world! Must have "
            ],
            [
                "ads are getting ridiculous",
                "  I know more then a few people who hardly play this game anymore... because of the ads. 1. there is always an ad on the bottom of the screen 2. after every move there is another ad 3. all these ads burn up data... my data usage (for this app) has more then doubled in last 2 months... same amount of playing, just more ads and higher data requirements  I am not paying to lose the ads, I will simply switch to an app that doesn't suffer from this problem... easy choice. "
            ],
            [
                "Pauly",
                "  Latest update claims faster load time. Well that's another lie. Fix what you say your gonna fix. Update department must be run by the Obama administration. "
            ],
            [
                "Still like this game",
                "  I wish it would slow down w/always wanting me to buy more i have \"paid\" version but they keep wanting more "
            ],
            [
                "Keeps freezing",
                "  This game used to load quick but since the last update most of the time I get WWF has stopped working & freezes my phone. Please fix this issue so i can give it the 5 star it previously had "
            ],
            [
                "Play daily",
                "  All that needs to change is the chance that the app can leak my private information! "
            ]
        ],
        "similar": [
            "uk.co.aifactory.chessfree",
            "com.bigduckgames.flow",
            "com.magmamobile.game.mousetrap",
            "com.disney.WMWLite",
            "logos.quiz.companies.game",
            "com.disney.WMPLite",
            "com.zeptolab.timetravel.free.google",
            "com.game.JewelsStar",
            "com.Phosphor.Horn.Paid",
            "com.omgpop.dstfree",
            "com.magmamobile.game.BubbleBlast2",
            "brain.age.analyzer",
            "com.melimots.WordSearch",
            "com.shootbubble.bubbledexlue",
            "com.zeptolab.ctr.ads",
            "com.kiragames.unblockmefree",
            "de.lotum.whatsinthefoto.us"
        ]
    },
    {
        "appId": "com.bigduckgames.flow",
        "moreFromDev": [
            "com.bigduckgames.fireworksarcade",
            "com.bigduckgames.sparkart",
            "com.bigduckgames.flowbridges"
        ],
        "reviews": [
            [
                "I like it!",
                "  Definitely different than many of the popular games out there right now "
            ],
            [
                "Nardo Graciano",
                "  My daughter & I love it "
            ],
            [
                "Great Game",
                "  Challenging and fun. "
            ],
            [
                "Addictive",
                "  Completed it once a while ago and missed it so I've downloaded it again and almost competed it again "
            ],
            [
                "Great game",
                "  Awesome "
            ],
            [
                "Fine",
                "  Veery fine "
            ]
        ],
        "similar": [
            "com.zynga.words",
            "com.disney.wheresmywater2_goo",
            "uk.co.aifactory.chessfree",
            "com.magmamobile.game.mousetrap",
            "com.disney.WMWLite",
            "com.zeptolab.ctr.ads",
            "air.com.mobigrow.canyouescape",
            "com.zeptolab.timetravel.free.google",
            "com.game.JewelsStar",
            "com.omgpop.dstfree",
            "com.magmamobile.game.BubbleBlast2",
            "com.melimots.WordSearch",
            "com.shootbubble.bubbledexlue",
            "logos.quiz.companies.game",
            "com.kiragames.unblockmefree",
            "de.lotum.whatsinthefoto.us"
        ]
    },
    {
        "appId": "com.liomii.water.puzzle.logic",
        "moreFromDev": "None",
        "reviews": [
            [
                "Good puzzles",
                "  If u dont want the adverts turn your wifi and data off when u play, simples. This game just boils my blood tho. Pretty boring and very repetitive "
            ],
            [
                "Nicely done.",
                "  Works great on Gal S3.  Simple, elegant, varying levels of challenge.  Nice job. "
            ],
            [
                "I love this game. Addictive!! Its math made fun!!",
                "  Updates, PLEASE!!!! "
            ],
            [
                "Great game.",
                "  I really enjoy playing because it something different and besides that its fun and educational at the same time. "
            ],
            [
                "Not that good",
                "  There keeps being ads after 1 game of playing it is so boring I would advise you not to get it it doesn't  work probably not happy. "
            ],
            [
                "Ads! And Loss of Progress",
                "  All progress is wiped every ten or so minutes it seems. And every couple of levels popup ads come up. Too many. "
            ]
        ],
        "similar": [
            "com.testapp.hasoffers10",
            "com.testapp.hasoffers.ank",
            "com.testapp.hasoffers4",
            "com.paceplay.laser.beam.puzzle",
            "com.FireproofStudios.TheRoom",
            "com.cioraneanu.water",
            "com.twodboy.worldofgoofull",
            "com.testapp.hasoffers.rac",
            "com.magmamobile.game.Words",
            "com.icemochi.wordsearch",
            "com.celticspear.matches",
            "com.oxothuk.worldpuzzle",
            "com.testapp.hasoffers3",
            "com.testapp.hasoffers2",
            "com.testapp.hasoffers1",
            "com.testapp.hasoffers7",
            "com.testapp.hasoffers6",
            "com.testapp.hasoffers5",
            "com.bithack.apparatus",
            "com.testapp.hasoffers9",
            "com.testapp.hasoffers8",
            "de.lotum.whatsinthefoto.us",
            "com.disney.wheresmywater2_goo",
            "biz.mtoy.blockpuzzle.revolution",
            "com.testapp.hasoffers.tus",
            "com.testapp.hasoffers11",
            "com.outfit7.jigtyfree",
            "com.disney.WMW",
            "com.com2us.puzzlefamily.up.freefull.google.global.android.common",
            "com.melimots.WordSearch",
            "com.disney.WMWLite"
        ]
    },
    {
        "appId": "com.ea.game.tetris2011_na",
        "moreFromDev": [
            "com.ea.game.fifa14_na",
            "com.ea.games.nfs13_na",
            "com.ea.monopolymillionaire_na",
            "com.ea.tetrisblitz_na",
            "com.ea.scrabblefree_na",
            "com.ea.games.simsfreeplay_na",
            "com.ea.games.r3_na",
            "com.ea.game.tetris2011_row",
            "com.ea.tetrisblitz_row",
            "com.ea.game.pvz2_na",
            "com.ea.game.maddenmobile2014_na",
            "com.ea.game.simpsons4_na",
            "com.ea.BejeweledBlitz_na"
        ],
        "reviews": [
            [
                "What is up with the gameplay? The one click style is limiting no matter ...",
                "  What is up with the gameplay? The one click style is limiting no matter how \"helpful.\" Take that off and let me take the reigns and I'll reinstall the app. "
            ],
            [
                "Ads Lots of them",
                "  Download only if you want ads for vacuum cleaners. Nothing like the original. Total crap "
            ],
            [
                "Liking less and less",
                "  I have always liked this game.  And at first this version performed reasonably well.  But now it takes so long to get to the game with all the ads and things.... there is no time to play the game IF YOU CAN GET IT TO OPEN.  I think I am just going to uninstall it. "
            ],
            [
                "Works fine on Google Nexus 7",
                "  I love Tetris. It's been a staple of the gaming industry for as long as I can remember, and this version has really good touch controls. Only thing I can think to make it better would be online multiplayer, or at the very least, a weekly online tournament similar to Angry Birds Friends. Either way, great game. "
            ],
            [
                "Different but fun",
                "  The app is a bit confusing in the way you select where and what orientation you want to put the pieces in. But it's creative and easy to get used to "
            ],
            [
                "Addictive",
                "  I'm loving this game so much been having trouble putting it down. My only thing is the setup is a little confusing with all the games and options. But at least it's got variety "
            ]
        ],
        "similar": [
            "com.catfishbone.game.torus",
            "com.sabecz.tetris",
            "com.cprojekt.termos",
            "com.popcap.pvz_na",
            "com.sas.tetris",
            "com.beyondinfinity.tetrocrate",
            "com.eamobile.nfsshift_na_wf",
            "com.eamobile.nbajam_na_wf",
            "com.mobilexsoft.tetris",
            "com.eamobile.bejeweled2_na_wf",
            "com.rhymeapp.BlockTransformers",
            "com.kidga.quadris",
            "me.mikegol.stetris",
            "com.daunmobi.tetrisgame",
            "com.kidga.pentas",
            "com.eamobile.sims3_na_qwf",
            "com.jaftalks.oldtetris",
            "com.appmobilegame.tetris",
            "com.egae.engach"
        ]
    },
    {
        "appId": "com.paceplay.laser.beam.puzzle",
        "moreFromDev": "None",
        "reviews": [
            [
                "stay away",
                "  stay away from this guys apps, he just steals other peoples and bundles ad's over top of them . "
            ],
            [
                "Big problems",
                "  This games biggest problem is the ads as the pop up randomly and would catch you off guard. A nothing problem is that its a less fun version of lazor "
            ],
            [
                "Need a 0 rating",
                "  Will not download "
            ],
            [
                "Crap",
                "  Lod of crap dunt work big proploms "
            ],
            [
                "Aggressive Ads",
                "  The puzzle game is fun.  Only issue is when I'm into it and ready to play the next puzzle an ad will pop up at random and I'll have my finger ready to start the puzzle, but nope...it's an ad and I've clicked it by accident and now I have to go through the hassle of going back into the game.  I would suggest a banner ad system instead.  I have installed after playing a grand total of 5 minutes, it's all I could take of the random full screen ads that would take me out of the game causing lose of emergence. "
            ],
            [
                "Copy of original",
                "  I hate unoriginal games like this.. this. Is a complete rip off lazors!!!.. UTTER RUBISH!!!! "
            ]
        ],
        "similar": [
            "com.testapp.hasoffers10",
            "com.chenyx.laserReflections",
            "com.liomii.water.puzzle.logic",
            "net.pyrosphere.lazors",
            "com.testapp.hasoffers.rac",
            "com.spiralcodestudio.laserflow",
            "com.testapp.hasoffers.ank",
            "com.icemochi.wordsearch",
            "com.sgg.pics2",
            "com.celticspear.matches",
            "com.shoutcode.laser",
            "com.smongey.android.bendthelaser",
            "thevoxelagents.puzzleretreat",
            "com.testapp.hasoffers3",
            "com.testapp.hasoffers2",
            "com.testapp.hasoffers1",
            "com.testapp.hasoffers7",
            "com.testapp.hasoffers6",
            "com.testapp.hasoffers5",
            "com.testapp.hasoffers4",
            "com.testapp.hasoffers9",
            "com.testapp.hasoffers8",
            "com.clollo.laserrefraction",
            "biz.mtoy.blockpuzzle.revolution",
            "com.testapp.hasoffers.tus",
            "com.brisk.lasers",
            "com.testapp.hasoffers11",
            "com.outfit7.jigtyfree",
            "drlaser.gen",
            "com.com2us.puzzlefamily.up.freefull.google.global.android.common",
            "in.spicelabs.wordgame.screens"
        ]
    },
    {
        "appId": "com.gamevil.spiritstones.global.free",
        "moreFromDev": [
            "com.gamevil.doz.global",
            "com.gamevil.cartoonwars.two.global",
            "com.gamevil.cartoonwars.one.global",
            "com.gamevil.monster.global",
            "com.gamevil.zenonia3.global",
            "com.gamevil.fb2013.global",
            "com.gamevil.bb2013.global",
            "com.gamevil.zenonia4.global",
            "com.gamevil.cartoonwars.gunner.global",
            "com.gamevil.bb2012.global",
            "com.gamevil.fishing.global",
            "com.gamevil.steelcommanders.globalfree",
            "com.gamevil.punchhero.glo",
            "com.gamevil.zenonia5.global",
            "com.gamevil.cartoonwars.blade.global"
        ],
        "reviews": [
            [
                "Won't load",
                "  It keeps saying it needs 4M and that there is insufficient space, although I have over 800 megabytes free on both my phone and SD card, its like the beta test all over again and it keeps freezing, I'm uninstalling all your games from my phone cause they all do the same stuff "
            ],
            [
                "Where is my daily login reward?",
                "  I had started tis game few days agi and been playing everyday but I can't get daily login reward. T.T "
            ],
            [
                "Cannot Install",
                "  This game won't install! :-[ It keeps saying it can't install in default location. ??? I have a Samsung Galaxy SII by Boost Mobile. Can you explain why this is happening? Or do I have to ask Google? "
            ],
            [
                "Lag plz help",
                "  Listen to me I got a dark knight last night then spent 10 dollars to get another I did I was happy go to evolve and one of them are gone it happens to me yesterday a lil I would like if you would gimme my dark knight if u can check u will see I earned 2 so plz give it back "
            ],
            [
                "Awesome game",
                "  This game is good minus the few freezes and I have to force close losing my progress. And for those with the daily event. It doesn't skip. It gives you the card and starts the whole process over again saving another day of log in which helps you. I was confused at first but now I understand. "
            ],
            [
                "Very polished",
                "  Looking for a random game to fall victim in addiction to, this one grabbed me.  I've played many like it.  But usually get lost in all the menus and events.  This one is very polished and easy to learn.  Keep up the good work gamevil your games are slowly consuming more and more of my extracurricular activity time "
            ]
        ],
        "similar": [
            "com.ecapycsw.onetouchdrawing",
            "com.miniclip.plagueinc",
            "nkoonstar.com.LINEZETA",
            "com.enterfly.penguin_gloplus",
            "com.celticspear.matches",
            "logos.quiz.companies.game",
            "com.zeptolab.timetravel.free.google",
            "com.larvalabs.gurk3",
            "com.magmamobile.game.Plumber",
            "com.disney.WMW",
            "com.FireproofStudios.TheRoom",
            "com.tictactoe.wintrino",
            "com.twodboy.worldofgoofull",
            "air.com.proceduralactivity.soulstcg",
            "com.easygame.marblelegend",
            "com.mmztech.pixelquest",
            "com.kiragames.unblockmefree"
        ]
    },
    {
        "appId": "com.ea.BejeweledBlitz_na",
        "moreFromDev": [
            "com.ea.game.fifa14_na",
            "com.ea.games.nfs13_na",
            "com.ea.games.r3_na",
            "com.ea.monopolymillionaire_na",
            "com.ea.tetrisblitz_na",
            "com.ea.games.simsfreeplay_na",
            "com.ea.BejeweledBlitz_row",
            "com.ea.game.tetris2011_row",
            "com.ea.game.pvz2_na",
            "com.ea.game.tetris2011_na",
            "com.ea.game.maddenmobile2014_na",
            "com.ea.game.simpsons4_na",
            "com.ea.scrabblefree_na"
        ],
        "reviews": [
            [
                "But...",
                "  Great game but...once in a while a \"free\" boost appears after you use it one game it charges you for it and no way to cancel since you used it already and its in your boosts. "
            ],
            [
                "Grrr",
                "  Every since updated I can never get matches on the free spin!!  Also would like more features like from desktop plz. Then ill give it 5stars "
            ],
            [
                "Works great but no party mode.",
                "  I really like this app! It's much faster than my laptop, and I can use two thumbs rather than a mouse. But, I'm disappointed that I can't access party mode. If they would fix that, I would change my rating to 5 stars. "
            ],
            [
                "Plenty of fun, needs minor tweaks",
                "  This is certainly more fun than most apps that work on my phone, but I'd like to see a couple changes. First, whenever a hint appears, there is no need for it to go away until the player makes a move. Second, there needs to be some sort of confirmation dialogue any time coins are spent. Literally every coin I've spent ever was by mistake. "
            ],
            [
                "Spam",
                "  This is a great app except that you cannot turn off push notifications. Therefore, there is no way to stop this app from constantly spamming your phone with unwanted notifications even when you're not playing the game. So, instead of enjoying this app, I have to uninstall it. "
            ],
            [
                "Meh",
                "  A cheap little cash grab. No real depth like the other bejewelled games had with different modes, and stats. This is just a game to kill time while on the can. Deleting your highscore once a week is just an artifical way for prolonging game play. "
            ]
        ],
        "similar": [
            "com.zynga.words",
            "com.disney.wheresmywater2_goo",
            "com.disney.WMPLite",
            "com.ecapycsw.onetouchdrawing",
            "com.eamobile.nbajam_na_wf",
            "com.kiragames.unblockmefree",
            "logos.quiz.companies.game",
            "com.zeptolab.timetravel.free.google",
            "com.icegame.candyblitz",
            "com.omgpop.dstfree",
            "com.eamobile.bejeweled2_row_wf",
            "com.popcap.pvz_na",
            "com.disney.wheresmymickeyfree_goo",
            "com.game.JewelsStar",
            "com.linkdesks.jewelhunter",
            "com.eamobile.sims3_na_qwf",
            "com.disney.WMWLite",
            "com.eamobile.bejeweled2_na_wf",
            "com.eamobile.nfsshift_na_wf"
        ]
    },
    {
        "appId": "com.icemochi.wordsearch",
        "moreFromDev": [
            "com.icemochi.sudoku",
            "com.icemochi.therope",
            "com.icemochi.wordhoard",
            "com.icemochi.logoquiz"
        ],
        "reviews": [
            [
                "No dragon game request please",
                "  Ever since I rated you with a five, I have this play dragon game request come up every time I play another puzzle. I don't mind your flashy little advertisements at the bottom but I don't like the complete interuption. So now I rate a 1. "
            ],
            [
                "Surprised",
                "  Downloaded to advance in another game but soon became addicted to this game.   Would have given 5 stars if it would somehow disable mt screen blackout. "
            ],
            [
                "Can't turn off notification",
                "  Even though I have turned them off in the settings, they still keep coming.  Not worth keeping if a game is going to wake me up.  Uninstalling. "
            ],
            [
                "Good game!!!",
                "  Love the word search but it could use more words... all the level puzzles have the same words so its no challenge for me after the first one... other than that good game n great time passer "
            ],
            [
                "Good",
                "  I enjoy the puzzles and supply of variations but is it just me or do others have a hard time earning more than one star? I didn't notice any rules or exclusive ways to earn rewards so I assume timing is everything. I have completed all puzzles played (about 15) in less than two minutes and never seem to earn more than one star. I realize this is a small complaint to have but I finished one in 35 seconds and got only 75% of a full star...sigh. "
            ],
            [
                "Simply amazing",
                "  Like every other cross word except ir's amazing. I love it! Im usually not the crossword type of person but this will definitely wake you up in the morning and and once you play it, you can't stop! "
            ]
        ],
        "similar": [
            "com.zynga.words",
            "com.magmamobile.game.Words",
            "com.nrs.wordSearch",
            "com.craigahart.android.wordgame",
            "com.wordsearchnew",
            "com.igoldtech.an.wordswipe",
            "com.rhs.wordhero",
            "more.funner.software.wordsearchfun",
            "com.virtuesoft.wordsearch",
            "com.melimots.WordSearch",
            "com.blacklight.flow",
            "com.etermax.wordcrack.lite",
            "words.gui.android",
            "in.spicelabs.wordgame.screens",
            "com.oktomo.wordsearch",
            "de.lotum.whatsinthefoto.us"
        ]
    },
    {
        "appId": "com.disney.wheresmywater2_goo",
        "moreFromDev": [
            "com.disney.PirateWars",
            "com.disney.WMPLite",
            "com.disney.loneranger_goo",
            "com.disney.TempleRunOz.goo",
            "com.disney.WMP",
            "com.disney.toystorysmashitfree_goo",
            "com.disney.MonstersUniversityFree.goo",
            "com.disney.stackrabbit_goo",
            "com.disney.brave_google",
            "com.disney.WheresMyHoliday_GOO",
            "com.disney.lostandfound",
            "com.disney.WMW",
            "com.disney.wreckitralph",
            "com.disney.wheresmymickeyfree_goo",
            "com.disney.WMWLite",
            "com.disney.nemo"
        ],
        "reviews": [
            [
                "RIP OFF!!!",
                "  While I like the game, I paid for the extra levels and there were more levels coming soon. They still aren't here, yet there is a where's my water2. Should give us what we paid for before releasing a new game. Will not be buying anything related to these games again. "
            ],
            [
                "Fun, but..... keys...",
                "  Love the game, but hate the idea of having to buy keys or bug my friends on Facebook. How many more times would I need to buy keys in the future too?? Or is this a one time deal? I'd like to know how many times I'll be investing in this if Disney has the game fully functioning already. "
            ],
            [
                "Original was better.",
                "  While I still enjoy the gameplay, it seems like I spend more time between levels going from screen to screen and clicking next or ok, than I actually spend playing the game. Same gameplay as original, now with more garbage filler & spam. I think I'll go play through the original again. "
            ],
            [
                "New version not an improvement",
                "  I LOVE all the others... Where's my Water, Perry, Mickey...  the game play on this is good too, but you have to pay extra for keys to advance OR spam your Facebook friends begging for them. I have bought the other games, and I would buy a full version of this too if I knew that buying the \"keychain\" would be the only purchase necessary. Also, the music turns on EVERY time you start the game, which is extremely annoying. "
            ],
            [
                "Mystery Duck bug",
                "  Road block is still there! And no mystery duck challenges anymore :( "
            ],
            [
                "Great game destroyed.",
                "  Its very cheap to charge huge amount of money to buy 3 keys to unlock beach level. Never expected this from d Disney. "
            ]
        ],
        "similar": [
            "com.dropboxusercontent.dl.wheresmywater2walthrough",
            "com.bigduckgames.flow",
            "com.magmamobile.game.mousetrap",
            "com.zeptolab.ctr.ads",
            "air.com.mobigrow.canyouescape",
            "com.zeptolab.timetravel.free.google",
            "com.game.JewelsStar",
            "com.magmamobile.game.Plumber",
            "com.omgpop.dstfree",
            "com.magmamobile.game.BubbleBlast2",
            "com.melimots.WordSearch",
            "com.shootbubble.bubbledexlue",
            "logos.quiz.companies.game",
            "air.com.disney.aliceinwonderlandmobile.goo",
            "com.kiragames.unblockmefree",
            "de.lotum.whatsinthefoto.us"
        ]
    },
    {
        "appId": "com.kiragames.unblockmefree",
        "moreFromDev": "None",
        "reviews": [
            [
                "Love at first block",
                "  Great game, fun for a couple minutes or a couple hours. People with giant stubby fingers (like a certain reviewer) might have trouble Xing out the ads that pop up every 5 levels or so, but people with ham hands will have trouble with anything on a touchscreen. Bottom line: Get a stylus and download this great game anyway! "
            ],
            [
                "Great game",
                "  Favourite game. Pop up ads only about every ten games, not annoying. The ones that half cover the bottom buttons were annoying and made it hard to go back but haven't seen them for a while. At first I managed to use a couple of hints accidentally but upgrade gave me five new ones :) "
            ],
            [
                "Advertisements",
                "  The advertisements in this app are used in the most forceful, obnoxious ways I've ever seen. While playing, a dialog  will come up and no matter where you click on the screen it redirects you to the Google Play Store. Upon this ridiculous advertisement scheme I uninstalled at once. "
            ],
            [
                "love game",
                "  but ads are HUGE annoyance. Would be awesome if the ads closed properly tho. Please fix "
            ],
            [
                "Great thinker quickie game",
                "  Minute to learn, easy to understand, quick levels, all ages, easy on ads, and not so engrossing that you can't turn it off at a moments notice. "
            ],
            [
                "Additted to it!! :)",
                "  Im so addicted to it, because this game is actually rly kewl and awesome i rly love this game, haters gonna hate, but their just jelious. I mean why do haters comment if they dont like the game??? Lol keep up the good work!!! c;î€Žî€Žî€Žî€Žî€Žî�• "
            ]
        ],
        "similar": [
            "com.zynga.words",
            "com.disney.wheresmywater2_goo",
            "com.bigduckgames.flow",
            "com.magmamobile.game.mousetrap",
            "com.zeptolab.ctr.ads",
            "air.com.mobigrow.canyouescape",
            "com.zeptolab.timetravel.free.google",
            "com.game.JewelsStar",
            "com.magmamobile.game.Plumber",
            "com.omgpop.dstfree",
            "com.magmamobile.game.BubbleBlast2",
            "com.melimots.WordSearch",
            "com.shootbubble.bubbledexlue",
            "logos.quiz.companies.game",
            "com.disney.WMWLite",
            "de.lotum.whatsinthefoto.us"
        ]
    },
    {
        "appId": "de.lotum.whatsinthefoto.us",
        "moreFromDev": "None",
        "reviews": [
            [
                "4 pics that have something in common.",
                "  Might be fun if I got more than three minutes of playing time before it hangs up and won't work. When it finally works again it starts over. Frustrating! Wouldn't recommend it. "
            ],
            [
                "Interesting and flawed.",
                "  Some of the answers to the puzzles are a REAL stretch and don't really make sense. In that case, I just use the letters to form a word. I can't give this game more than 3 stars due to its flaws. Number 59: Really?? That was a horrible way to represent the word! If you're going to have ads after every other level at least provide a way to earn FREE coins. "
            ],
            [
                "Great game",
                "  I love it . I down loaded it today im on  #175 and only had to have help twice but once i knew the answer i realized it made since and how every thing connected. Great game i highly recomend it. "
            ],
            [
                "Okay",
                "  I enjoy this, but find the constant ads annoying,  very easy to play but sometimes find the pictures too simple "
            ],
            [
                "Stupid",
                "  Level 363: tell me how a ginger kid dressed up as a super hero with a cape, has anything to do with a mantle? STRETCHING! Just a little bit. I hate games that make no sense, making me feel like I don't get it, when there's nothing to get. "
            ],
            [
                "Used to be fun",
                "  This was a fun little game. But now after every third puzzle there is a video ad and static ad. I don't mind ads to pay for apps but this is an absolute ridiculous annoyance. I'm deleting the app. "
            ]
        ],
        "similar": [
            "com.zynga.words",
            "com.disney.wheresmywater2_goo",
            "com.disney.WMPLite",
            "com.bigduckgames.flow",
            "com.whatsthewordanswers",
            "com.disney.WMWLite",
            "com.zeptolab.ctr.ads",
            "air.com.mobigrow.canyouescape",
            "com.zeptolab.timetravel.free.google",
            "com.game.JewelsStar",
            "com.omgpop.dstfree",
            "com.magmamobile.game.BubbleBlast2",
            "com.melimots.WordSearch",
            "com.shootbubble.bubbledexlue",
            "logos.quiz.companies.game",
            "com.kiragames.unblockmefree"
        ]
    },
    {
        "appId": "com.zeptolab.ctr.ads",
        "moreFromDev": [
            "com.zeptolab.ctr.paid",
            "com.zeptolab.monsters.free.google",
            "com.zeptolab.ctrexperiments.ads",
            "com.zeptolab.ctrexperiments.google.paid",
            "com.zeptolab.ctr.hd.google.paid",
            "com.zeptolab.timetravel.paid.google",
            "com.zeptolab.timetravel.free.google",
            "com.zeptolab.monsters.paid.google",
            "com.zeptolab.ctrexperiments.hd.google.paid"
        ],
        "reviews": [
            [
                "awesome cool",
                "  awesome now i have all 3 cut the rope cut the rope experiments and cut the rope time travel. "
            ],
            [
                "Great Game!",
                "   "
            ],
            [
                "Good",
                "  Update made no difference to me as im waiting for new levels which i have been for about a month "
            ],
            [
                "STILL DOESN'T WORK!",
                "  Updated today and still not fixed!  Plz fix Samsung Galaxy s3 "
            ],
            [
                "One of my best games really awesome",
                "  Can't stop playing. love to play on my Acer Tablet "
            ],
            [
                "Cut some ropes",
                "  Before playing I had to cut some ropes of the program itself due to a huge lot of permissions, and connections to getjar and whatsoever. I prefer to pay for a clean game instead of having a free one full of sh...trange stuff I don't really trust (is the paid version free of getjar and other permissions ?!) "
            ]
        ],
        "similar": [
            "com.zynga.words",
            "com.disney.wheresmywater2_goo",
            "com.disney.WMPLite",
            "com.bigduckgames.flow",
            "com.magmamobile.game.mousetrap",
            "com.disney.WMWLite",
            "uk.co.aifactory.chessfree",
            "com.game.JewelsStar",
            "com.magmamobile.game.Plumber",
            "com.omgpop.dstfree",
            "com.magmamobile.game.BubbleBlast2",
            "com.melimots.WordSearch",
            "com.shootbubble.bubbledexlue",
            "logos.quiz.companies.game",
            "com.kiragames.unblockmefree",
            "de.lotum.whatsinthefoto.us"
        ]
    },
    {
        "appId": "com.shootbubble.bubbledexlue",
        "moreFromDev": "None",
        "reviews": [
            [
                "Kinda but not really",
                "  Kinda like the original bubble bobble but not quite there. My touch sreen is just fine but the bubble kept shooting off in other directions. And no aiming help for beginners? "
            ],
            [
                "This game is not as fun as bubble shoot. This one doesn't let you ...",
                "  This game is not as fun as bubble shoot. This one doesn't let you switch balls, and the aim is not accurate. Try bubble shoot and you'll see... "
            ],
            [
                "Boringgggggg.",
                "  Seriously i got to lvl 28 in like 10 minutes.... haha. This game blows.... bubble shooter is more challenging than this horse $hit. "
            ],
            [
                "The calibration is eay off",
                "  Not worth the time to download. You cant switch between balls to use strategy nor is the aiming accurate. You touch to shoot but it does not go where you want it to. "
            ],
            [
                "This game",
                "  This game is fun, but it will not give you the colors you need on certain levels. Some levels are super easy and some are ridiculously hard. Only gave 3 stars because some of the levels I get to take sometimes a week to beat. Fun game, but some levels are impossible without losing until the set of colors comes in that will work. 7 browns in a row is not helpful. "
            ],
            [
                "Shoot bubble.deluxe",
                "  I soooooooo lovethis game its so addictive I never even rate apps bt I had to post something def a five star game and for free.u cant beat it everyone should try it:) "
            ]
        ],
        "similar": [
            "com.zynga.words",
            "com.disney.wheresmywater2_goo",
            "sp.app.bubblePop",
            "com.bigduckgames.flow",
            "com.sword.game.bubble",
            "com.magmamobile.game.mousetrap",
            "com.disney.WMWLite",
            "logos.quiz.companies.game",
            "com.zeptolab.timetravel.free.google",
            "com.game.JewelsStar",
            "com.magmamobile.game.Plumber",
            "com.omgpop.dstfree",
            "com.magmamobile.game.BubbleBlast2",
            "com.melimots.WordSearch",
            "com.memory.activity",
            "com.zeptolab.ctr.ads",
            "com.fruits.games",
            "com.kiragames.unblockmefree",
            "de.lotum.whatsinthefoto.us"
        ]
    },
    {
        "appId": "com.happymage.google.monstergemisland",
        "moreFromDev": [
            "com.happymage.google.fashionModelMakeover",
            "com.happymage.google.hamsterrun"
        ],
        "reviews": [
            [
                "Quickly Becomes a Grind",
                "  The difficulty jump between islands 4/5 is pretty big.  The jump between islands 5/6 is even worse.  Your crew size limit is 3.  Even with a team consisting of varying Elements and your Aid in battle, you can maximally have a team of 4 of the 5 elements.  That remaining element becomes dead weight.  This doesn't matter so much in the beginning of the game, but as you progress, it becomes a very difficult factor to overcome.  And there's no way to get new characters without buying magic stones; endless grind "
            ],
            [
                "Great, Challenging, Fun",
                "  Besides all the bugs here and there, great game so far. I would love to see this game grow. Please work hard to fix these issues. I can't evolve after one time. "
            ],
            [
                "Why do enemies attack after killing them",
                "  I like the game, love the pokemon/puzzle gameplay style. The one thing I really don't care for is that enemies still attack even after you killed them. Kinda irritating especially when its a strong enemy. "
            ],
            [
                "Oh yeah real fun",
                "  Would be nice if i could actually play the datn thing keeps saying package invalid. "
            ],
            [
                "Decent but a small problem",
                "  I gotta say its a fun game to waste time on but there's a problem I saw every time I lvl up my monsters it says ill get about so and so experience but when I hit merge the exp lowers I've noticed this thruout game play so I guess it must be on purpose nothing less im going to uninstall it sorry "
            ],
            [
                "Looks great",
                "  But never made it past the extremely long boring tedious frustrating unnecessary tutorial. .. uninstalling the game is more fun and tons faster. "
            ]
        ],
        "similar": [
            "com.zeptolab.monsters.free.google",
            "com.mobage.ww.a1431.Puzzles_Android",
            "com.ibubblegame.gemsmission",
            "com.bestcoolfungamesfreegameappcreation.bunnyshooter",
            "com.xiaxio.petmonsterpop",
            "com.pikpok.mamc",
            "com.wLittlestPetShopPuzzles",
            "com.bubblesoft.bubbleshooter_1",
            "com.ezjoynetwork.petpop",
            "com.meyume.gemcollapse2",
            "com.zeptolab.monsters.paid.google",
            "com.shootbubble.bubbledexlue",
            "com.tani.game.shooter",
            "com.azerbo.shogimonsters",
            "com.gamed9.pet.googleplay",
            "com.lpg.mh"
        ]
    },
    {
        "appId": "com.mangopub.kunundrum",
        "moreFromDev": [
            "com.mangopub.pirates",
            "com.mangopub.polara",
            "com.mangopub.fingerarmy",
            "com.mangopub.relativitywars",
            "com.mangopub.bullseye",
            "com.mangopub.armoreddefense",
            "com.mangopub.shadowzin",
            "com.mangopub.birzzle"
        ],
        "reviews": [
            [
                "Lee shuman wtf",
                "  I think Lee doesnt know what the definition of free means so he should shut the fuck up oh waaaaaaaaaah there's ads, how else are they gonna make  moeny if there's people like you Lee so just be grateful fucking sick of People like you. In conclusion game was aite but srs lee rethink your shit, including others. "
            ],
            [
                "Fun, but frustrating",
                "  I enjoy the game a lot, but sometimes the it freezes and my only option is to kill the app. The ad placement is equally as annoying. Full page pop ups every few levels gets in the way of the game flow, especially when they only partially load and don't give an option to go back to the game. "
            ],
            [
                "Red green color blind",
                "  Can't play it :(.  Used colors that are too similar for a red green color deficient person.  For example don't use neon green and neon yellow on the same board. I can't see green well so yellow is exactly the same color.  Other colors, If used, I can't see are red and purple or blue and purple depending on the boldness of each color. Stopped at level 3 because of the color. Use a bolder green if using yellow etc etc. Thx. "
            ],
            [
                "Black outs",
                "  Was a fun game and made it to level 3 when the game would randomly go black. Would start pushing buttons and then it would come back on in the options screen. By level 5 I got sick of the black outs. Am now uninstalling. Could be a neat game for those who can get it to work right. "
            ],
            [
                "\"Free\"",
                "  If a game is made free by a company, then there should not be advertising.   Otherwise, it is a good puzzle game. "
            ],
            [
                "Galaxy 4",
                "  To avoid the ads. You should put your phone on airplane mode. I know it's a hassle because there's no internet. But you can play ad free.  This game is the best game I've downloaded. "
            ]
        ],
        "similar": [
            "com.kangaroo.logic_solver",
            "com.jakyl.frootreeshemango",
            "com.missingames.rescueroby.lite",
            "com.rmagdev.brain.extreme",
            "com.lmaosoft.memory",
            "com.gardensnake.cyberiq",
            "com.MPTrainingGames02",
            "com.ustwo.blipblupfree",
            "com.htwgames.kunundrum",
            "com.burncode.planetconundrumfree",
            "com.bpi.master.mm",
            "com.iteo.crazybraincolors",
            "com.zeptolab.ctr.ads",
            "net.inaya.enigmfree",
            "com.oxothuk.worldpuzzle",
            "com.dsignmatters.iq_fitfunlite",
            "com.appify.visualmemory"
        ]
    },
    {
        "appId": "com.bithack.apparatuslite",
        "moreFromDev": [
            "com.bithack.teslaplushies",
            "com.bithack.principia",
            "com.bithack.apparatus"
        ],
        "reviews": [
            [
                "Caused S3 to crash",
                "  My S3 had never been forced to restart until I played this game. It's laggy and unresponsive too. Pity, because the game was fun for a few minutes. "
            ],
            [
                "I only played the LITE version...",
                "  And I am thoroughly impressed. The physics are solid and intuitive. The controls are a bit inaccurate, but that's to be expected on a small touch screen device (nexus s). Speaking of which, it runs well on my old device! "
            ],
            [
                "Good concept",
                "  It's a pretty good game but got error on each level which froze the phone. "
            ],
            [
                "Pretty good fun",
                "  You can make some truly mad contraptions with this app. Enjoyed the demo levels in the Lite version and then played around in Sandbox mode. The only criticism I have is that the control mechanism can be a bit fiddly, but this is more likely to be down to the device that the actual app. Now, if it could support the hardware controls on the Xperia Play then it'd be a real winner!! Tested on Sony Ericsson Xperia Play and worked perfectly. "
            ],
            [
                "Love it",
                "  Very cool and time consuming game! "
            ],
            [
                "Great idea, but...",
                "  Moving and positioning objects vs. swiping the screen is insanely frustrating, object connectors are hard to place, and \"physics\" are not intuitive (I.e. one would think that a piece of wood could not pass through a big metal object jutting out from a wall) "
            ]
        ],
        "similar": [
            "com.g5e.buildalot3",
            "com.goidos.teeterfreeversion",
            "de.hms.xconstructionfull",
            "com.twodboy.worldofgoodemo",
            "com.gfagame.labirint",
            "com.gfagame.colorsmaze",
            "com.animagames.toycrafter",
            "com.css.teeter",
            "com.twodboy.worldofgoofull",
            "de.hms.xconstruction",
            "com.teeter.deluxe",
            "com.apparatusguide",
            "com.pixowl.thesandbox.android",
            "com.me.PhysicsSandbox",
            "com.gfagame.teeter",
            "com.ball.puzzle"
        ]
    },
    {
        "appId": "com.gamecircus.songz",
        "moreFromDev": [
            "com.gamecircus.CookieDozerThanksgiving",
            "com.gamecircus.Paplinko",
            "com.gamecircus.PrizeClawSeasons",
            "com.gamecircus.moviez",
            "com.gamecircus.HorseFrenzy",
            "com.gamecircus.CoinDozerSeasons",
            "com.gamecircus.slotscircus",
            "com.gamecircus.CoinDozerHalloween",
            "com.gamecircus.CoinDozerWorld",
            "com.gamecircus.PrizeClaw",
            "com.gamecircus.FrogToss"
        ],
        "reviews": [
            [
                "Pretty good",
                "  Not too bad but I cant pass on a puzzle if I cant figure it out. Only other option seems to be purchasing coins. Not good enough to put money into. "
            ],
            [
                "Love",
                "  I I love games is cool awesome and the best games ever please don t give up you like your this gameand help you out like to tell you what to do next and when you are done whath the next one u have a lot to do I LOVE THIS GAME IT COOL!!!!!!!,!!?????? "
            ],
            [
                "Great game!",
                "  New to game, but so far I like it.  Only problem I think, is having to wait to go to the next level. "
            ],
            [
                "Super Fun",
                "  Its super fun something to do when I'm bored and I usually hate apps but this one is great "
            ],
            [
                "A little easy",
                "  But at least its not too difficult like others "
            ],
            [
                "...",
                "  Love the game; however, had to uninstall it and re add it because my level 34 wouldnt open after I had already completed 94% of it. Ughhh "
            ]
        ],
        "similar": [
            "com.twodboy.worldofgoofull",
            "sg.vinay.fourpics1songcheatsanswers",
            "com.bg.songquiz",
            "com.whatsthewordanswers",
            "com.nebo.pics2",
            "com.grendell.broodhollow",
            "com.leftover.CookieDozer",
            "com.brookesiagames.gsguitar",
            "com.nk.fourpics1m",
            "com.wordtrivia.pics_1_song",
            "com.disney.WMW",
            "ru.redspell.whattheword",
            "quess.song.music.pop.quiz",
            "com.leftover.CoinDozer",
            "com.sgg.pics2",
            "whats.the.word.game.quiz",
            "com.kangaroo.fourpics1song",
            "com.epicpixel.fourpicsoneword",
            "de.lotum.whatsinthefoto.us"
        ]
    },
    {
        "appId": "com.miniclip.plagueinc",
        "moreFromDev": [
            "com.miniclip.extremeskater",
            "com.miniclip.railrush",
            "com.miniclip.gravityguy",
            "com.miniclip.animalshelter",
            "com.miniclip.sketchman",
            "com.miniclip.hambo",
            "com.miniclip.angerofstick2",
            "com.miniclip.angerofstick3",
            "com.miniclip.ggorigins",
            "com.miniclip.eightballpool",
            "com.miniclip.istunt2",
            "com.miniclip.fraggerfree",
            "com.miniclip.dinopets",
            "com.miniclip.cartownstreets",
            "com.miniclip.pingpong"
        ],
        "reviews": [
            [
                "Necroa virus impossible on normal",
                "  Tried many different ways and watched a lot of videos on it but it is too hard... Zcom always wins because the virus doesn't make it to a specific waterlocked island or something.  Should make at least normal beatable in my opinion. "
            ],
            [
                "Fun but limited",
                "  I like that you can unlock the majority of the features_ and even the pay to play have something unique to offer. But I don't think one should have to get the full version to speed up the game as the last remaining humans die off. "
            ],
            [
                "DID YOU JUST SNEEZE ON ME?",
                "  Don't conquer the world, just destroy it! Love the game. Hours and hours of fun. "
            ],
            [
                "Awesome game",
                "  This is by far one of the best strategy games on Google Play. Even the casual mode can be tricky on certain plague types. Definitely has great replay value in my opinion. "
            ],
            [
                "This game",
                "  Its a great game that makes you think. There is only one problem that i see is that it is lagging, and once it starts lagging it kicks me off. If that was fixed i will give it the full five stars. "
            ],
            [
                "VERY FUN GAME",
                "  This game is well made and feels very real as if this could happen in real life. Its quite scary actually. "
            ]
        ],
        "similar": [
            "com.holland9.miniclip",
            "com.ecapycsw.onetouchdrawing",
            "com.zeptolab.ctrexperiments.ads",
            "com.nix.game.mahjong",
            "com.tobiapps.android_100fl",
            "com.magmamobile.game.mousetrap",
            "logos.quiz.companies.game",
            "com.zeptolab.timetravel.free.google",
            "com.magmamobile.game.Plumber",
            "com.omgpop.dstfree",
            "com.magmamobile.game.BubbleBlast2",
            "com.tictactoe.wintrino",
            "com.melimots.WordSearch",
            "com.shootbubble.bubbledexlue",
            "com.zeptolab.ctr.ads",
            "com.ruanshaomin.game",
            "com.disney.WMWLite"
        ]
    },
    {
        "appId": "com.freshgames.escapethetitanic",
        "moreFromDev": [
            "com.freshgames.ranchrush2",
            "com.freshgames.ranchrush2lite"
        ],
        "reviews": [
            [
                "3 stars",
                "  The hints arnt good enough! And its always saying I'm not connectes to the internet "
            ],
            [
                "Duh",
                "  We all know the ship sinks in the end, this one sunk sooner. Its not free, it wants you to purchase either a gold ticket for all the answers or a silver ticket for all the hints, no other choice but to pay or quit. I jumped early. "
            ],
            [
                "Can't even download!",
                "  Tried 6 times and always get an error code! If I could actually get the game then I will give a rating. "
            ],
            [
                "Started out ok...",
                "  The game was interesting and I wanted to see more but after emerging from the engine rooms an add popped up asking me to buy hints and answers. I didn't need any so I clicked the 'no thanks' button. It brought meback to the menu screen. It won't allow me to go further without buying unnecessary hints. If the game is fee, it should be free. If you want to be paid, say so at the beginning. I would have paid then but not now. "
            ],
            [
                "Escape the titanic",
                "  I think its a little hard cause there is no instruction but also fun and irritating because you want to figure out how to do it but you can't at first so it thrilling and fun when you learn what to do "
            ],
            [
                "Just started this game....so far so good!",
                "  Not thru to much of the game yet but I am enjoying out so far! "
            ]
        ],
        "similar": [
            "air.com.dozengames.FloorsEscape",
            "air.com.klgamesllc.escapechallenge",
            "air.com.infofrontline.jacket.escaperoom",
            "air.com.mobestmedia.takeactiontoescape",
            "air.com.mobestmedia.needtoescape",
            "com.tobiapps.android_100fl",
            "com.neodots.EscapeGamesHospitalEscape",
            "air.endlessescape",
            "com.kuhakuworks.DOOORS2",
            "air.com.mobigrow.canyouescape",
            "air.com.mobestmedia.submarineescape",
            "com.kuhakuworks.DOOORS",
            "air.com.tedven.youmustescape",
            "com.smartgameslive.titanic",
            "cento.n3.lib",
            "escape.the.titanic.guide.walkthrough.cheats"
        ]
    },
    {
        "appId": "com.bonfiremedia.one.letter.one.word",
        "moreFromDev": [
            "com.bonfiremedia.android_wikimobile2pro",
            "com.bonfiremedia.midnight_basketball",
            "com.bonfiremedia.scratch.off.quiz",
            "com.bonfiremedia.android_nfl_chat",
            "com.bonfiremedia.android_wikimobile",
            "com.bonfiremedia.jewel_temple",
            "com.bonfiremedia.android_wikimobile2",
            "com.bonfiremedia.dots",
            "com.bonfiremedia.android_ebay",
            "com.bonfiremedia.scratch.pics.one.word",
            "com.bonfiremedia.typeracer"
        ],
        "reviews": [
            [
                "SAMSUNG GALAXY S4",
                "  IT'S FUN THERE'S A LOT OF EASY ONES YOU GO RIGHT THROUGH THE WORDS. IT'S A FUN GAME JUST TO PAY THE TIME AWAY OR IF BORED. "
            ],
            [
                "It was ok",
                "  I beat it in 3 days no new levels so do I just wait pretty addictive but I wanna play more "
            ],
            [
                "One clue",
                "  This game is very addicting I can't stop playing it and I like how you have to house your smarts "
            ],
            [
                "Nexus 7",
                "  Awesome! Giving the one letter really helps without making it too easy. Have tried a lot of similar games and this is the best by far. "
            ],
            [
                "Give 0 if could",
                "  They dont give u a hint each time you start a new word. U have to pay for each hint! Got to play for 2 min only before I couldn't go any further! Then deleted game. "
            ],
            [
                "Really like this game.",
                "  My only complaint is that at times the clue extends beyond the screen and cannot be seen. "
            ]
        ],
        "similar": [
            "com.vg1916vg.CrypticClue",
            "com.littlegames.CriminalClues",
            "hr.zii.cluegamehelper",
            "com.kaser.sherlockfree",
            "com.ecapycsw.onetouchdrawing",
            "me.wheresmom",
            "com.keroinnovation.codes100guide",
            "com.equazi.unolingo",
            "com.nk.cluepics",
            "com.kb.nemonemo",
            "com.rupas.dreambox",
            "com.apprope.threewordsonepic",
            "com.JustKiddingStudios.TwentyOneIceClues",
            "com.apprope.findtheword",
            "com.emerginggames.LogoQuiz",
            "icon.pop.logo.quiz"
        ]
    },
    {
        "appId": "com.melimots.WordSearch",
        "moreFromDev": [
            "com.melimots.Melimots"
        ],
        "reviews": [
            [
                "Ok",
                "  It's a great game, except that there are so many 3-letter words that it makes it impossible to beat my previous scores. I suppose since they are smaller words, that's why it added 15+ of then to reach l each puzzle. "
            ],
            [
                "Alright gameplay",
                "  I could do without the incessant \"do you smoke pot?\" ad. Removing from my phone, because no, my 8 year old who uses it the most doesn't smoke and I am tired of looking over and seeing that. "
            ],
            [
                "Word Search",
                "  It's not too bad.I just wish they had more if them instead of having to do the same ones over and over again.It's not much of a challenge if you remember where the words are because you've done them all numerous times before:/ "
            ],
            [
                "Ok game",
                "  This game would be better if the words would change and if there were topics to choose from. But its same words over and over that its getting boring. its not challenging at all.. "
            ],
            [
                "NO TIMER OPTION PLEASE!!",
                "  I love this word search game but I get so anxious trying to do this quickly. I try to ignore the timer but I still know its there and after a few minutes I find myself racing again.  I no longer play this game at bedtime because it is not relaxing. Please install a option to delete the timer. "
            ],
            [
                "Used to be fun!",
                "  I would love to give a 5, this is an awesome game....however for the last two weeks its has been force closing and won't let me play. I won't rate any better till this is fixed. "
            ]
        ],
        "similar": [
            "com.zynga.words",
            "com.icemochi.wordsearch",
            "com.bigduckgames.flow",
            "com.disney.wheresmywater2_goo",
            "com.magmamobile.game.mousetrap",
            "com.disney.WMWLite",
            "com.zeptolab.ctr.ads",
            "com.zeptolab.timetravel.free.google",
            "com.game.JewelsStar",
            "com.magmamobile.game.Plumber",
            "com.omgpop.dstfree",
            "com.magmamobile.game.BubbleBlast2",
            "com.shootbubble.bubbledexlue",
            "logos.quiz.companies.game",
            "com.kiragames.unblockmefree",
            "de.lotum.whatsinthefoto.us"
        ]
    },
    {
        "appId": "uk.co.aifactory.chessfree",
        "moreFromDev": [
            "uk.co.aifactory.backgammonfree",
            "uk.co.aifactory.go",
            "uk.co.aifactory.solitairefree",
            "uk.co.aifactory.backgammon",
            "uk.co.aifactory.rrfree",
            "uk.co.aifactory.sudoku",
            "uk.co.aifactory.ginrummyfree",
            "uk.co.aifactory.spades",
            "uk.co.aifactory.spadesfree",
            "uk.co.aifactory.moveitfree",
            "uk.co.aifactory.hearts",
            "uk.co.aifactory.heartsfree",
            "uk.co.aifactory.fialfree",
            "uk.co.aifactory.checkersfree",
            "uk.co.aifactory.sudokufree",
            "uk.co.aifactory.gofree"
        ],
        "reviews": [
            [
                "Good game but room for improvement",
                "  Probably the best free chess game but uneven play at lower levels. Level 1 plays tougher than level 3. I can play this game almost even on some upper Levels and I am not that strong.  Still recommended overall. "
            ],
            [
                "You can play chess against the computer or another person. You can choose to ...",
                "  You can play chess against the computer or another person. You can choose to be black or white and can disable the white aide so it is easier or harder for yourself. All in all an excellent game. It really does deserve five stars.\tI love this game. It has so many good settings. I have a bunch of games from this company. It is great. "
            ],
            [
                "Pretty good",
                "  Really good game but I think the difficulty setting is weird because number 1 is hard itself.. I managed to beat the cpu till 7 though "
            ],
            [
                "I really enjoy it! The level 7-10 are tough, but it's really nice for ...",
                "  I really enjoy it! The level 7-10 are tough, but it's really nice for practicing. One simple blunder will screw you up\tMarvelous! "
            ],
            [
                "better than killing brain cells on TV",
                "  I spend hours in the evening playing this.instead of drooling in front of a TV, I can use my brain cells to plan strategy. I love chess. "
            ],
            [
                "Great fun!",
                "  I'm way too addicted to this game. Nice, fast gameplay. No bugs for me. "
            ]
        ],
        "similar": [
            "com.zynga.words",
            "com.alonsoruibal.chessdroid.lite",
            "com.bigduckgames.flow",
            "com.mobirix.chess.wgmf",
            "com.magmamobile.game.Chess",
            "com.disney.WMWLite",
            "logos.quiz.companies.game",
            "com.mobirix.tkochess.wgmf",
            "com.game.JewelsStar",
            "com.omgpop.dstfree",
            "com.magmamobile.game.BubbleBlast2",
            "com.melimots.WordSearch",
            "com.shootbubble.bubbledexlue",
            "com.zeptolab.ctr.ads",
            "com.google.android.chess",
            "com.kiragames.unblockmefree"
        ]
    },
    {
        "appId": "com.gameday.AnRoom_MKT",
        "moreFromDev": [
            "com.gameday.RoomBreak_EscapeNow",
            "com.gameday.TapToOn_Google",
            "com.gameday.purple",
            "com.gameday.Room3Global",
            "com.gameday.RoombreakADNewGlobal",
            "com.gameday.AnRoomPLUS",
            "com.gameday.AnRoom"
        ],
        "reviews": [
            [
                "Clever game so far. I have not had to saw my own foot off ...",
                "  Clever game so far. I have not had to saw my own foot off yet ! "
            ],
            [
                "Great game",
                "  I didn't understand it at first then I got the concept of it. I didn't really see anything tellibg you how to play the game. "
            ],
            [
                "Good",
                "  Very nice graphics, interesting puzzles. I would recommend it to those who want to kill some time. "
            ],
            [
                "Lots of fun",
                "  I love this game. I like trying to figure out how to open the door. The only thing I don't like is that you have to buy certain levels. I would love to play them all. "
            ],
            [
                "So I like this game so much that I told my wife to play ...",
                "  So I like this game so much that I told my wife to play and download it is well, we're both having fun laying in our beds trying to open the next door see who can get the farthest love the game and everyone else yet should too\tCan't wait to open the next door, I'm an a competition with my wife and at this moment she is winning... Love the game "
            ],
            [
                "Can't stop playing",
                "  Its a good game for thinking. The only thing that I would change about this game is that when you past the levels and chapters, I would give more coins to the player. Besides that I have no complaints as of yet. "
            ]
        ],
        "similar": [
            "com.gipnetix.dr",
            "ar.crab.puzzle1",
            "com.gipnetix.stagesgameqq",
            "air.Doors100Rooms2",
            "com.gipnetix.aliensspace",
            "treline.app.prisondoors",
            "com.kuhakuworks.DOOORS",
            "com.mpisoft.doors_new_galaxy_city",
            "com.FireproofStudios.TheRoom",
            "air.A100DoorsRooms",
            "com.h.zombie.doors",
            "com.gipnetix.revengeguide",
            "com.kuhakuworks.DOOORS2",
            "com.gipnetix.door2014jm",
            "com.gpimax.doors",
            "com.moarbile.h.dungeons"
        ]
    },
    {
        "appId": "com.zeptolab.timetravel.free.google",
        "moreFromDev": [
            "com.zeptolab.ctr.paid",
            "com.zeptolab.monsters.free.google",
            "com.zeptolab.ctrexperiments.ads",
            "com.zeptolab.ctrexperiments.google.paid",
            "com.zeptolab.ctr.hd.google.paid",
            "com.zeptolab.timetravel.paid.google",
            "com.zeptolab.monsters.paid.google",
            "com.zeptolab.ctr.ads",
            "com.zeptolab.ctrexperiments.hd.google.paid"
        ],
        "reviews": [
            [
                "Love it!",
                "  I was disappointed even the first game ended so quickly. This version takes more time and more thought. I love all of the new additions like the portals and stretchered ropes. Make more! "
            ],
            [
                "Lets u use ur superior muscle...",
                "  Designed for science lovers n problem solvers...This game has strong relationship with Newtons law,centrifugal force, planning, think out of box, problem solving.... "
            ],
            [
                "Ok",
                "  Not the greatest game ever. But new levels for the cut the rope series is always fun for a while. "
            ],
            [
                "Glitches and freezes",
                "  I love cut the rope and have beaten the first one and was looking for something to do. This game, however, freezes all the time and has many glitches that make it  unable to be enjoyed. "
            ],
            [
                "SWAG!",
                "  AWESOME !BEST CUT THE ROPE GAME EVER rheres only one problem it freezes but ITS STILL A COOL(AWESOME)GAME! "
            ],
            [
                "Outstanding (even if a bit easy)",
                "  I really love Cut The Rope, it's physics and OnNom, and \"Time Travel\" in an expansion pack, so nothing to say about it: if you loved the other installments, you will love this one. If you didn't love the other installments, maybe you will love this one, as it is by far the easiest of all. Three stars for every level in two days. "
            ]
        ],
        "similar": [
            "com.zynga.words",
            "com.disney.wheresmywater2_goo",
            "com.disney.WMPLite",
            "com.bigduckgames.flow",
            "com.kiragames.unblockmefree",
            "uk.co.aifactory.chessfree",
            "air.com.mobigrow.canyouescape",
            "com.game.JewelsStar",
            "com.magmamobile.game.Plumber",
            "com.omgpop.dstfree",
            "com.magmamobile.game.BubbleBlast2",
            "com.melimots.WordSearch",
            "com.shootbubble.bubbledexlue",
            "logos.quiz.companies.game",
            "com.disney.WMWLite",
            "de.lotum.whatsinthefoto.us"
        ]
    },
    {
        "appId": "com.xusheng.logoquiz",
        "moreFromDev": "None",
        "reviews": [
            [
                "Fun",
                "  Its fun and you can add more levels. Please dun make the levels so difficult to get, 5 star rating if u change that:) "
            ],
            [
                "Hint 3 plz???",
                "  This game is fun, but the hints don't always scroll all the way down, so you can't see hint 3! "
            ],
            [
                "Love the game",
                "  Its keeps me busy when i have nothin to do... its a great game to excercise your mind... "
            ],
            [
                "It's fun but...",
                "  I am not able to scroll down far enough to view the 3rd hint....Other than that I like it. "
            ],
            [
                "Ruined it for me.",
                "  As soon as it it told me \"Mercedes Benz\" was incorrect I uninstalled it. What a load. "
            ],
            [
                "Nice game",
                "  More free hints will make it perfect "
            ]
        ],
        "similar": [
            "com.popzhang.sudoku",
            "com.quizlogo",
            "com.flick",
            "com.canadadroid.fantasy",
            "logo.quiz.music.bands.game",
            "com.logo.x.quiz",
            "com.fesdroid.logoquiz",
            "doodle.Xjump",
            "net.jroen.LogoQuiz",
            "com.enrasoft.scratchthat.logoquiz",
            "com.baileyz.aquarium",
            "x.pandafishing",
            "logo.quiz.car.game",
            "pl.antit.guess.the.food",
            "guess.the.brand.logo.quiz.icomania",
            "logos.quiz.companies.game",
            "logos.quiz.football.soccer.clubs",
            "com.mousegame.anglezombie",
            "com.canadadroid.penguinskiing",
            "com.canadadroid.wordmine",
            "com.canadadroid.connect4",
            "com.doodle.candytoss",
            "com.finddifferences.finddifferences",
            "flag.quiz.world.national.names.learn",
            "logo.quiz.game.category",
            "com.leagem.mahjong",
            "de.sellfisch.android.wwr",
            "de.androidcrowd.logoquiz",
            "com.emerginggames.LogoQuiz",
            "com.bigflower.burgerandroid"
        ]
    },
    {
        "appId": "com.ea.scrabblefree_na",
        "moreFromDev": [
            "com.ea.game.fifa14_na",
            "com.ea.games.nfs13_na",
            "com.ea.monopolymillionaire_na",
            "com.ea.tetrisblitz_na",
            "com.ea.games.simsfreeplay_na",
            "com.ea.games.r3_na",
            "com.ea.game.pvz2_na",
            "com.ea.game.tetris2011_na",
            "com.ea.game.maddenmobile2014_na",
            "com.ea.game.simpsons4_na",
            "com.ea.game.scrabblemattel_bv",
            "com.ea.BejeweledBlitz_na"
        ],
        "reviews": [
            [
                "Uninstalled until it changes",
                "  They recently changed the app so that invalid words are automatically removed from the board.  Also, video ads have no volume control. Make it a paid app w/ no ads, and you'll get more downloads. I'm on a Galaxy S3, btw. "
            ],
            [
                "Ads... Origin sucks",
                "  Hard to mess up scrabble. Ads after every turn and even when I came to rate! Origin software required to register to play with friends. In game fine. Should be equal number of turns in end game. Chance at end. Also should tell you where you could play last tile with teacher if you can't find a spot and have to pass. Enjoy! "
            ],
            [
                "Improvments",
                "  I like the improvements since my last update, however, give us the option to recall the tiles on our own if the word is not good instead of the app doing it automatically. I may have mistakenly reversed a couple of letters. Instead of me having to place all the tiles back on the board, let me just flip the two tiles and try again. Please. Also, get rid of the video ads. My spouse who is sleeping next to me, is aggravated to be woke up by those ads. I can't stop it until a matter of seconds has passed. "
            ],
            [
                "Crap!",
                "  After EVERY SINGLE PLAY you have an ad to watch. It completely detracts from the game. Charge if you need to. I would pay for an ad free version. Until then, DELETING. Absolutely disappointing... "
            ],
            [
                "SUCKS!!",
                "  Plays words that aren't even real words. Jams and stalls. Its total junk. Don't waste your time. "
            ],
            [
                "Great game, needs a better developer.",
                "  I love this game, but there are some real problems with it. For one, the constant video ads are a nuisance, and have recently been followed by still ads once the video completes. You also need a very fast connection to even load a game. No option for offline play against the CPU is baffling. I wish there was an option to buy it so I wouldn't have to deal with constant intrusive ads. But what are you gonna do when it's EA developing it. "
            ]
        ],
        "similar": [
            "com.zynga.words",
            "com.pisanu.scrabblechecker",
            "com.zynga.scramble",
            "com.z1i.wordr",
            "com.eamobile.nfsshift_na_wf",
            "com.eamobile.bejeweled2_na_wf",
            "com.highlycaffeinatedcode.scrabblehelper",
            "com.firecrackersw.wordbreaker",
            "com.Sakhatech.Android.wordscrabble",
            "com.highlycaffeinatedcode.scrabblehelper.unlocker",
            "fr.leopardsoft.scrabble",
            "com.karch.matt.scrabble",
            "com.popcap.pvz_na",
            "com.eamobile.sims3_na_qwf",
            "com.pisanu.scrabbleexpert.french",
            "com.pisanu.scrabbleexpert.free",
            "com.eamobile.nbajam_na_wf",
            "com.lulo.scrabble.classicwords",
            "com.dhruvg.apps.bingledemo",
            "appsforkidz.android.template.game.scrabble"
        ]
    },
    {
        "appId": "com.nerdyoctopus.gamedots",
        "moreFromDev": "None",
        "reviews": [
            [
                "Stoners paradise",
                "  Easily my fav game even bought the endless mode for those stoned moments but the latest update kicks off my Pandora and music player also kicked my score back :'( but other than that its great and addictive "
            ],
            [
                "Input Lag/Lockups",
                "  This is an incredible game, but there are still regular input lag spikes on even high end devices. Very frustrating and will ruin your streak every single time. Please fix this! "
            ],
            [
                "If only",
                "  Well I love puzzle games and was so excited to try this. But then all hope was lost. It downloaded but every time I try to open it there is a white screen then it hops back to my apps page. Or it will say its not responding and I must force close. I tried everything to remedy it. deleting, re installing and putting it on Sd card instead of internal memory. Nothing. I am about to give up and just be sad I never got to try it. Hopefully it'll be fixed someday. For now I'd give it zero stars if possible. So bummed out :/ "
            ],
            [
                "Great game...needs fixed",
                "  The new version of this game cuts off other audio pkaying when launched (bad) AND kicks the other audio back to the beginning of the program (VER BAD). This needs to be addressed. Other than that...love it! "
            ],
            [
                "Love Dots",
                "  Love this game. Could not stop playing.  Then update made the dots smaller.  Bring back my normal size dots. Also enjoy dark mode.  Liked the GE sample days of Gravity mode. Just bring back my normal size dots. Don't wanna wear glasses to play.  My daughter also likes this game.  Special needs teenager and this game keeps her mind active. Thanks "
            ],
            [
                "Do Not Play This Game...",
                "  ...if you were planning on doing anything important. This game is horribly, horribly addictive. The \"just one more move\" factor is off the scale; you will find it almost impossible to resist shuffling those dots into place just so you can pull off a satisfying \"screen clearer\". Don't say I didn't warn you... "
            ]
        ],
        "similar": [
            "lop.mos.dev",
            "com.berniiiiiiii.logomatchup",
            "kidgames.christmas.pack",
            "kidgames.halloween.pack",
            "com.thepapership.braingames.espanol",
            "br.com.gtlsistemas.forca",
            "sp.app.bubblePop",
            "com.oxothuk.worldpuzzle",
            "com.ho.android.ozozggames",
            "com.tictactoe.wintrino",
            "com.lich2tung.loops",
            "com.bonfiremedia.dots",
            "com.magmamobile.game.checkers",
            "com.apesoup.buildinggame",
            "com.developandroid.android.girls",
            "com.tranhue.pikachu2013"
        ]
    },
    {
        "appId": "com.game.JewelsStar",
        "moreFromDev": [
            "com.game.JewelsStar2",
            "com.game.JewelsLegend",
            "com.game.DragonGem",
            "com.game.MarbleSaga"
        ],
        "reviews": [
            [
                "Don't update this app",
                "  Updated twice, wiped my scores both times. Most of the later levels are impossible unless you get enough clocks to make it. You can't even get combos for a lot of the levels because of \"no more move\" bullshit every other swipe... "
            ],
            [
                "Good but worried about security",
                "  Enjoy playing, however today whilst playing the! Mineral mode I was launched without warning onto an extremely explicit porn site called F*** Hive. I have all the usual security protocols in place so have no idea how this could have occurred. "
            ],
            [
                "Awesome entertainment",
                "  Better than candy crush.  :) Fun and addicting....only thing that I hate is the spider that runs along the bottom of the screen for the advertisement! "
            ],
            [
                "It keeps crashing mid-game. Not detected as a crash, no report prompt.",
                "   "
            ],
            [
                "Game good shame about the PORN",
                "  Porn unsolicited is a serious violation and I  wish to take this matter further. .I was playing this game yesterday when the game paused and a Graphic Advert for PORN was displayed..leaving me and my child shocked and horrified. As a result of this I will be deleting all itree games "
            ],
            [
                "Jewels is great but I have a complaint about the ads",
                "  I have a complaint about the ad for \"Hellfire: the Summoning\" which appears during Jewels. This advert features an almost naked woman standing in a very suggestive pose with the tag line \"Let's play\". The ad doesn't say what it is advertising but clicking thru takes you to the download page for Hellfire - a medium maturity-rated game. I don't think it is appropriate to be advertising games like this, in such an overtly sexualized way, on Jewels, which is rated as suitable for everyone, even children. "
            ]
        ],
        "similar": [
            "com.zynga.words",
            "com.disney.wheresmywater2_goo",
            "uk.co.aifactory.chessfree",
            "com.bigduckgames.flow",
            "com.magmamobile.game.mousetrap",
            "com.disney.WMWLite",
            "com.zeptolab.ctr.ads",
            "air.com.mobigrow.canyouescape",
            "com.zeptolab.timetravel.free.google",
            "com.omgpop.dstfree",
            "com.magmamobile.game.BubbleBlast2",
            "com.melimots.WordSearch",
            "com.shootbubble.bubbledexlue",
            "logos.quiz.companies.game",
            "com.kiragames.unblockmefree",
            "de.lotum.whatsinthefoto.us"
        ]
    },
    {
        "appId": "logos.quiz.companies.game",
        "moreFromDev": [
            "logos.quiz.football.soccer.clubs"
        ],
        "reviews": [
            [
                "It Has My Recommendation!",
                "  This game is simple, but fun. I got mildly addicted almost instantly. It gets more challenging in later levels, but not so much as to make one quit. Great job as always! "
            ],
            [
                "Awesome",
                "  This is a fun game to play and is very time consuming. Which is good "
            ],
            [
                "Nice game!! My daughter likes it",
                "  I don't play games but my daughter downloads it & loves to play with it.. This app. is one of them. I like this app bcoz my daughter likes it & it increases I.Q power. So, well done... (y) "
            ],
            [
                "Great!",
                "  I'm a media student so this logo game helps me to get used to world logos and teaches me quite a lot of new ones it puts my attention to design. Over all loving it really addictive by the way xD "
            ],
            [
                "Very addicted!",
                "  Started playing and I could never put the phone down! "
            ],
            [
                "fun but the hints need work",
                "  enjoyed playing but I think the hints stink. if I am not familiar with the logo how am I supposed to know what country and city that the company is based? that is no help to me what so ever! "
            ]
        ],
        "similar": [
            "logo.quiz.music.bands.game",
            "fingerprint.friend.detector",
            "icon.pop.logo.quiz",
            "com.kiragames.unblockmefree",
            "com.zynga.words",
            "com.enrasoft.scratchthat.logoquiz",
            "logo.quiz.car.game",
            "com.zeptolab.timetravel.free.google",
            "com.game.JewelsStar",
            "icomania.guess.word.icon.mania.cartoons.quiz",
            "brain.teasers.logic.puzzles.riddles",
            "scare.your.friends.prank.maze.halloween",
            "icomania.guess.word.icon.mania.celebs.quiz",
            "icomania.guess.word.icon.mania.movie.quiz",
            "capitals.quiz.world.national.names.learn",
            "com.melimots.WordSearch",
            "com.shootbubble.bubbledexlue",
            "com.xusheng.logoquiz",
            "de.lotum.whatsinthefoto.us",
            "com.disney.wheresmywater2_goo",
            "what.the.riddle.word.game.free.quiz",
            "com.bigduckgames.flow",
            "logo.quiz.alcohol.cigarettes",
            "com.magmamobile.game.mousetrap",
            "flag.quiz.world.national.names.learn",
            "logo.quiz.game.category",
            "com.magmamobile.game.BubbleBlast2",
            "icomania.guess.word.icon.mania.logo.quiz",
            "com.zeptolab.ctr.ads",
            "de.androidcrowd.logoquiz",
            "com.disney.WMWLite"
        ]
    },
    {
        "appId": "com.mediocre.sprinklefree",
        "moreFromDev": [
            "com.mediocre.sprinklejunior",
            "com.mediocre.sprinkle",
            "com.mediocre.sprinkle2free",
            "com.mediocre.grannysmithfree",
            "com.mediocre.sprinkle2",
            "com.mediocre.grannysmith"
        ],
        "reviews": [
            [
                "Great idea..... the aiming concept is so annoying I uninstalled! Please fix Great ...",
                "  Great idea..... the aiming concept is so annoying I uninstalled! Please  fix\tGreat game IF your ability to aim wasn't such pain! It makes one wonder if the creators actually played the game! To bad...  Cool idea..... Crappy final touches! "
            ],
            [
                "Excellent",
                "  Only a small taste but more than enough to get you interested in this remarkable, delightful game. Very good! "
            ],
            [
                "Annoying!",
                "  I hate this game! It makes me so mad because it is too hard to get 5 stars! If I can't get 5 stars in the game, then you don't get 5 stars in my rating. It would be less annoying if there was more water available or if the water didn't deplete as fast. "
            ],
            [
                "Poor app",
                "  This app dont let me to open it:( Please fix this problem. I wont install this app until it works excellent..:( "
            ],
            [
                "Mediocre, indeed!",
                "  This is not a free game but a demo. You can play 12 of the 72 levels and they're extremely simple and you don't get a taste for any kind of difficulty or Brain & Puzzle game play at all - If there even are such in the full version. The levels in the demo don't really allow for different options/strategies and there's nothing to play around with just for fun. The limited amount of water (instead of adding difficulty by requiring complicated puzzle solving) doesn't really help either. The graphics are cute and water splashes around pretty nicely. If you just need something to entertain little kids then it will do okay, otherwise there's nothing to see here. "
            ],
            [
                "Sprinkle",
                "  Fantastic, fun, addictive and great game.  Definitely recommendable Cherry "
            ]
        ],
        "similar": [
            "com.zeptolab.ctr.paid",
            "com.omgpop.dstpaid",
            "air.com.twonerd.tapbubble",
            "air.farpse.com.tictactoe",
            "com.dropboxusercontent.dl.cuttheropewalkthrough",
            "nkoonstar.com.LINEZETA",
            "com.socialzoid.craftcombine",
            "uk.co.aifactory.chessfree",
            "com.omgpop.dstfree",
            "com.tentalentsgames.dwlite",
            "com.tictactoe.wintrino",
            "com.twodboy.worldofgoofull",
            "com.bithack.apparatus",
            "com.disney.WMW",
            "com.distinctdev.tmt",
            "de.hms.xconstructionfull"
        ]
    },
    {
        "appId": "com.icenta.sudoku.ui",
        "moreFromDev": [
            "com.icenta.sudoku",
            "com.icenta.eggs"
        ],
        "reviews": [
            [
                "Ad prevents play",
                "  I have no objection to ad bars on free games.  However, when you place the ad on top of the game board making it impossible to play then what is the point of having the game at all? "
            ],
            [
                "Generates push spam...",
                "  Works, but has been pushing notification area spam for a thumbfly texting app. Not worth the hassle. "
            ],
            [
                "Used to love it",
                "  Everything about the game is simple and easy to use and it was once a game I played daily. However now the ads on the screen actually cover the top line of my board and I have top tap the bottom of the screen to correct this but it just goes back after five seconds. Please fix "
            ],
            [
                "Cool",
                "  Nice game, no massive pop up ads, smooth easy gameplay :-)  all in all a very nice game and you can choose the difficulty level so even good if our not so good like me lol "
            ],
            [
                "Right...",
                "  Didn't notice any changes. Not focused on that just trying to beat my own best times "
            ],
            [
                "Okay",
                "  There are parts that are good. I wish it would highlight all or none. The limited highlighting makes it difficult for me to see. Not as good as the other soduku I've used. Wish it would not erase my pencil marks if I have to go back and correct. "
            ]
        ],
        "similar": [
            "com.zynga.words",
            "com.project.genina.android.lines",
            "uk.co.aifactory.sudokufree",
            "com.bigduckgames.flow",
            "com.magmamobile.game.mousetrap",
            "com.disney.WMWLite",
            "com.genina.android.cutnroll",
            "logos.quiz.companies.game",
            "com.game.JewelsStar",
            "com.omgpop.dstfree",
            "com.magmamobile.game.BubbleBlast2",
            "brain.age.analyzer",
            "com.melimots.WordSearch",
            "com.shootbubble.bubbledexlue",
            "com.zeptolab.ctr.ads",
            "com.coolmango.sudokufun",
            "com.nrsmagic.sudoku",
            "com.kiragames.unblockmefree"
        ]
    },
    {
        "appId": "com.omgpop.dstfree",
        "moreFromDev": [
            "com.omgpop.dstpaid"
        ],
        "reviews": [
            [
                "Wish it worked!",
                "  I was so excited to play this with my family. But it's so slow and when I try to play with my mom, it won't let us guess the word. It just says to draw a picture again. The app takes forever to open and it sometimes doesn't. Please fix it. I really want to play. "
            ],
            [
                "You barely get to see what people draw",
                "  Is not like the real thing. I got to see the drawings days after. By then I was ready to install this joint! But if you don't mind, you'll have good fun. "
            ],
            [
                "HTC fail",
                "  I have a game where its my Turn and I keep getting notifications to say it's mine turn, go to play and the game is not there. I have reset my phove, turned it off etc and it still won't come up. This has happened before. "
            ],
            [
                "It is lacking instructions.....",
                "  I like the theory behind the app but it needs more instructions.  There is no information on how to decline requests, remove a player, how to earn badges etc. "
            ],
            [
                "HTC Thunderbolt.",
                "  Very slow now. And won't let me get away from ads after I draw with a friend. Always have to restart it... >:/ "
            ],
            [
                "Want colors? Pay up.",
                "  Don't make me pay for more than 4 colors, otherwise play hundreds of games with people. Get real.  As for responsiveness, it can't leverage the note 2s precise spen.  Lastly, don't freaking keep telling me that people are looking to play / waiting for me to draw when I know they don't even have the app anymore!! "
            ]
        ],
        "similar": [
            "com.zynga.draw2.googleplay.free",
            "com.ecapycsw.onetouchdrawing",
            "uk.co.aifactory.chessfree",
            "com.bigduckgames.flow",
            "com.magmamobile.game.mousetrap",
            "com.disney.WMWLite",
            "com.zeptolab.ctr.ads",
            "com.zeptolab.timetravel.free.google",
            "com.game.JewelsStar",
            "com.magmamobile.game.BubbleBlast2",
            "com.melimots.WordSearch",
            "com.shootbubble.bubbledexlue",
            "logos.quiz.companies.game",
            "com.zynga.words",
            "com.kiragames.unblockmefree",
            "de.lotum.whatsinthefoto.us"
        ]
    },
    {
        "appId": "jp.gungho.padEN",
        "moreFromDev": [
            "jp.gungho.silpheed_alternative_full",
            "jp.gungho.ctwEN",
            "jp.gungho.pad",
            "jp.gungho.kerihimequestthd",
            "jp.gungho.kerihimequest",
            "jp.gungho.silpheed_alternative"
        ],
        "reviews": [
            [
                "Fun at first",
                "  This game was fun at first but the seemingly endless grinding to get past level 100 is detracting from the game. In addition to that, after todays update i cannot play any longer - i simple get force closes. "
            ],
            [
                "Rareness ;D",
                "  This game is awesome. Love the concept, artwork & how easy it is to acquire stronger monsters & progress throughout the dungeons. Becoming more difficult to keep from playing it, lol. Highly recommended to all mobile gamers :D "
            ],
            [
                "fun",
                "  it would b nice to figure out how to evo fuse my max   level dragons dont know what im doing wrong if i can figure it out will possibly give it a 5 star rating "
            ],
            [
                "Best game",
                "  Best puzzle/fighting game. I play every time I have stamina.  Hours of fun each day. I dont have wifi so im glad I have a good data plan. Well done devs. "
            ],
            [
                "Its cool...for the most part",
                "  The game is fun until there's an update. This is the second time I've had to start over because of \"insufficient storage\" when I've had way more than enough to accommodate the upgrade. Also, it takes waaaaaaay too long to gather evo material to evolve monsters. As you progress the dungeons get harder but you're stuck with the same monsters, maxed out that aren't even strong enough to get the evo material you need.  The game is cool especially since its free, there's just a lot to fix "
            ],
            [
                "does not work on kindle fire hd",
                "  have to push buttons lower than where they actually are. problably because of the soft buttons at the bottom of the kindle "
            ]
        ],
        "similar": [
            "kr.eoq.android.padbackup",
            "com.cgt.padwiki",
            "jacksoftlabs.app.padwiki",
            "app.roms",
            "com.titan.dragonjigsaw",
            "nkoonstar.com.LINEZETA",
            "com.rockia.pndplus",
            "com.creation.dino",
            "com.yiyi.padfinder",
            "com.rockia.puzzlealarm",
            "com.nowlytool.padtool",
            "com.linkstudio.DragonSummon",
            "com.teamchaos.dragonacademy",
            "com.anygame.puzzledragons",
            "net.red_cat.puzzlegamesimulator",
            "com.dropboxusercontent.dl.cheatsguideforpuzzleanddragons"
        ]
    },
    {
        "appId": "de.hms.xconstruction",
        "moreFromDev": [
            "de.hms.xconstructionfull"
        ],
        "reviews": [
            [
                "OMG!",
                "  The best \"game\" I've ever played. I spent two hours on the first level. Oh, I \"solved\" it quickly, but there were so many other possible design options and I just had to see how much better (or worse) each change could make it.  Best i could get was 22%   stressed (found one which was 100%, the absolute weakest bridge possible that isn't a \"fail\").  A great app for getting an intuitive grasp of bridge mechanics without needing the math (even if you know the math this is faster). "
            ],
            [
                "Interesting",
                "  This is a puzzle game. Being a mechanical engineer I have found this game insanely interesting! It will show you struts which have critical stress and when your bridge fails you can get an idea about why it failed. This is a good game if you are interested in puzzles or solving (engineering) problems. "
            ],
            [
                "!!! Excellent Game '3 Thumbs Up' !!!",
                "  Regardless of the few who complained about X Construct , I think it is by far one of the best bridge construction games out there. I think they oughta come out with more games like this or add to it!!!!!!!!!!!! "
            ],
            [
                "Amazingly addicting!",
                "  I'hv completed all the bridges on Insane difficulty... An update with more levels will be much appriciated! Anyways, its a no bullshit, and Amazing game! "
            ],
            [
                "Hate it",
                "  Hate hate hate hate hate it "
            ],
            [
                "some people thing that is good but I think that its a bad game ...",
                "  some people thing that is good\nbut  I think that its a bad game because i've pasted all levels in less than 20 minutes!\n:-O "
            ]
        ],
        "similar": [
            "com.zynga.words",
            "com.heavyfall.constructioncity",
            "com.bigduckgames.flow",
            "com.com2us.sliceit",
            "com.magmamobile.game.mousetrap",
            "com.disney.WMWLite",
            "logos.quiz.companies.game",
            "com.game.JewelsStar",
            "com.omgpop.dstfree",
            "com.magmamobile.game.BubbleBlast2",
            "brain.age.analyzer",
            "com.melimots.WordSearch",
            "com.shootbubble.bubbledexlue",
            "com.zeptolab.ctr.ads",
            "me.zed_0xff.android.alchemy",
            "com.kiragames.unblockmefree"
        ]
    },
    {
        "appId": "com.karmicapps.bmho",
        "moreFromDev": [
            "com.karmicapps.thejumble.TheJumbleHD",
            "com.karmicapps.mechswarfare",
            "com.karmicapps.tangledwebs.TangledWebsHDHolidayEdition",
            "com.karmicapps.jewelgodHD",
            "com.karmicapps.slots"
        ],
        "reviews": [
            [
                "Fun challenge!",
                "  My only complaints about this game are that some of the items you have to find are really difficult bc they aren't the company's actual logos. For example: Burger King- the picture you have to find is a man wearing a crown. That is not a good representation of BK. Also, the game freezes a lot when I try to open it to play. Otherwise, I really love this game. It's challenging without being too hard. Hours of fun! "
            ],
            [
                "Locked up my phone",
                "  Locked up my phone and why the heck do you need to see my browser history and access my Google account? Disclose that in your description. What's next, read my email too?  Uninstalled "
            ],
            [
                ":\\",
                "  The game froze after I played for 2 minutes. Please fix. I'd like to give it another try. "
            ],
            [
                "Great HOG",
                "  I'm a big fan of Brandomania and Logo Quiz series, but this rules 'em all. Very challenging and vivid game. 5* ! "
            ],
            [
                "Fun and Intriguing",
                "  I love this game. It challenges your concentration and powers of observation. The only thing is that there is no volume control on the game. And the sounds between games is quite loud. "
            ],
            [
                "Great game",
                "  I love this game it works great on my phone I don't have any problems with it "
            ]
        ],
        "similar": [
            "com.jarbull.wims",
            "jp.naver.SJLGLINEHC",
            "net.bigbearentertainment.android_ho_guardians",
            "air.com.nextdifferencegames.MysteryHiddenStory",
            "air.com.nextdifferencegames.Mess.Hiddenobjects",
            "com.xs.findobject",
            "air.com.nextdifferencegames.AtlantisHiddenobjects",
            "air.com.nextdifferencegames.LostCityHiddenobjects",
            "air.com.nextdifferencegames.MysticTownHiddenobjects",
            "ru.dandp.beachresort",
            "air.com.nextdifferencegames.Lost.Hiddenobjects",
            "com.magmamobile.game.HiddenObject",
            "com.tobiapps.android_hiddenobjects",
            "air.com.nextdifferencegames.HiddenObjectsInItaly",
            "air.com.nextdifferencegames.mysteryHiddenObjects",
            "air.com.nextdifferencegames.HouseHiddenobjects"
        ]
    },
    {
        "appId": "com.mobage.ww.a1431.Puzzles_Android",
        "moreFromDev": [
            "com.mobage.ww.a431.holywars_android",
            "com.mobage.ww.a692.Bahamut_Android",
            "com.mobage.ww.a759.Blood_Brothers_Android",
            "com.mobage.ww.a1257.Dot_Android",
            "com.mobage.ww.a467.TapSlashNinja_Sandbox",
            "com.mobage.ww.a953.Fuzion_Android",
            "com.mobage.ww.a793.fanta_test_Android",
            "com.mobage.ww.a446.mancala_android",
            "com.mobage.ww.a804.RAGNABREAK_Android",
            "com.mobage.ww.a877.Charadium_II_Android",
            "com.mobage.ww.a873.fatalfrontier_android_Android",
            "com.mobage.ww.a669.checkers_optime_Android",
            "com.mobage.ww.a774.Firework_Android",
            "com.mobage.ww.a926.Transformers_Android",
            "com.mobage.ww.a1544.gi_joe_Android",
            "com.mobage.ww.a956.MARVEL_Card_Battle_Heroes_Android",
            "com.mobage.ww.a447.tic_tac_touch_android",
            "com.mobage.ww.a1200.NFL_CARD_Android",
            "com.mobage.ww.a1512.Blood_Battalion_Android",
            "com.mobage.ww.a560.tinytower_android",
            "com.mobage.ww.a435.pocketfrogs_android",
            "com.mobage.ww.a465.zombiefarm_android"
        ],
        "reviews": [
            [
                "Why? Why won't it work?",
                "  This game got me addicted and now won't let me log in since the last update. what kind of sick people would do that? "
            ],
            [
                "Has potential",
                "  Good addictive game.   I find myself playing this game all the time.   What would be helpful is if you clicked on the monster it'll tell you what potential it has to evolve into so you can decide whether to keep or sell "
            ],
            [
                "Addictive Game",
                "  Love this game and play it all the time. Only problem is sometimes the game messes up when I get a text. Sucks when I use up capture spells and continues, and almost beat a big boss... Then it freezes after a text! :-( "
            ],
            [
                "It's ok",
                "  The game is good as for fun, but to evolve monsters its almost impossible to capture the evolution monsters... ive been trying for so long just to get a snail or two... "
            ],
            [
                "Fun but dissapointed",
                "  Become a lot better but the skill no longer recharge when in use make me wanna rate -5â˜…. Dont make the game overbad "
            ],
            [
                "Good game",
                "  Good game, takes some thought to play well in each level. Good to know what boss weaknesses are. Only complaint is that game tends to freeze or sometimes lag after playing a few rounds "
            ]
        ],
        "similar": [
            "com.zeptolab.monsters.free.google",
            "com.pikpok.mamc",
            "com.happymage.google.monstergemisland",
            "com.zynga.matching",
            "com.zeptolab.monsters.paid.google",
            "game.funny.matching.fruit",
            "com.appoh.matchthepics",
            "com.azerbo.shogimonsters",
            "com.celticspear.matches",
            "com.lpg.mh"
        ]
    },
    {
        "appId": "icomania.logoquiz.a4pics1word.b4pics1song.colormania.sudoku",
        "moreFromDev": "None",
        "reviews": [
            [
                "Good game",
                "  I just started playing today..enjoying it so far..I'm only stuck on cities and countries puzzles...gotta learn my stuff "
            ],
            [
                "Awwsome",
                "  Fun gameplay and great picture quality, this game has it all. "
            ],
            [
                "Fun",
                "  One of the best guessing games. A lot of familiar things.  I love how they always give you a category! "
            ],
            [
                "Greatapp",
                "  This isb a really fun app it brings back good moments of my child hood "
            ],
            [
                "Fun",
                "  This is pretty fun, kids can play too! "
            ],
            [
                "Good and sometimes difficult",
                "  I really like this game and I'm only 9 "
            ]
        ],
        "similar": [
            "air.com.generamobile.colormaniaguess",
            "slide.colorFrenzy",
            "com.bg.songquiz",
            "pl.antit.guess.the.character.cartoon",
            "icomania.guess.word.icon.mania.cartoons.quiz",
            "logos.quiz.companies.game",
            "com.brookesiagames.gsguitar",
            "pl.antit.guess.the.food",
            "com.benderapps.adivinadisney",
            "guess.the.brand.logo.quiz.icomania",
            "com.gamesforfriends.icomania",
            "com.braintrainer.iconpop",
            "air.com.tvm.logoquiz",
            "icomania.guess.word.icon.mania.logo.quiz",
            "icomania.guess.word.icon.mania.movie.quiz",
            "icon.pop.logo.quiz",
            "four.pics.one.word.whats.the.word.f4pics1word",
            "com.fedapp.icon.brand"
        ]
    },
    {
        "appId": "com.ea.tetrisblitz_na",
        "moreFromDev": [
            "com.ea.game.fifa14_na",
            "com.ea.games.nfs13_na",
            "com.ea.monopolymillionaire_na",
            "com.ea.scrabblefree_na",
            "com.ea.games.simsfreeplay_na",
            "com.ea.games.r3_na",
            "com.ea.game.tetris2011_row",
            "com.ea.game.pvz2_na",
            "com.ea.tetrisblitz_row",
            "com.ea.game.tetris2011_na",
            "com.ea.game.maddenmobile2014_na",
            "com.ea.game.simpsons4_na",
            "com.ea.BejeweledBlitz_na"
        ],
        "reviews": [
            [
                "Mrs. Flores",
                "  Great game ever.. The only thing that i deslike is when my phone get frozen... "
            ],
            [
                "Great but needs work",
                "  Great game and gives a good challenge but it keeps glitching and constantly shutting down especially when im about to start the game it shuts off i lose my money and power ups that i purchased or won i did have this as a 5 star but not anymore till glitches are fixed "
            ],
            [
                "It cheats",
                "  Stacked my tetriminos like the game says to do and what happens?? Well after game stops and takes me to my fones home screen just as the cascade begins. So after I return to the game I find that not only did I lose a round of power up but a potential high score as well. Uninstalled and not recommending to anyone "
            ],
            [
                "Fast-Fix",
                "  It's a game with fast gameplay. It'll certainly provide a fix if you're bored and just want a quick game to pass the time. It might not get you sucked in for hours on end, but it'll keep you entertained for the time being. "
            ],
            [
                "Commercial SUCK!!!",
                "  I was very fond if Tetris, but that has changed! Those damned Progressive Ads with ANNOYING Flo take a good 5 minutes to go off the screen. UNUNSTALLING the game now. Still has long commercial! "
            ],
            [
                "Sucks",
                "  Its a rip off. Use power ups and get no higher score than you would without. Its only 800 coins up while you lose major points. "
            ]
        ],
        "similar": [
            "com.catfishbone.game.torus",
            "com.sabecz.tetris",
            "com.cprojekt.termos",
            "com.popcap.pvz_na",
            "com.sas.tetris",
            "com.beyondinfinity.tetrocrate",
            "com.eamobile.nfsshift_na_wf",
            "com.eamobile.nbajam_na_wf",
            "com.mobilexsoft.tetris",
            "com.eamobile.bejeweled2_na_wf",
            "com.rhymeapp.BlockTransformers",
            "com.kidga.quadris",
            "me.mikegol.stetris",
            "com.daunmobi.tetrisgame",
            "com.kidga.pentas",
            "com.eamobile.sims3_na_qwf",
            "com.jaftalks.oldtetris",
            "com.appmobilegame.tetris",
            "com.egae.engach"
        ]
    },
    {
        "appId": "com.disney.WMWLite",
        "moreFromDev": [
            "com.disney.PirateWars",
            "com.disney.wheresmywater2_goo",
            "com.disney.WMPLite",
            "com.disney.loneranger_goo",
            "com.disney.TempleRunOz.goo",
            "com.disney.toystorysmashitfree_goo",
            "com.disney.MonstersUniversityFree.goo",
            "com.disney.stackrabbit_goo",
            "com.disney.brave_google",
            "com.disney.WheresMyHoliday_GOO",
            "com.disney.WMP",
            "com.disney.WMW",
            "com.disney.wreckitralph",
            "com.disney.wheresmymickeyfree_goo",
            "com.disney.nemo"
        ],
        "reviews": [
            [
                "Make full version free plzzzzzzz",
                "  I like the game but plz make full version free like wheres my water 2 i dont understand why u put wheres my water 2 free but not this one plz make the full version free i beg u i have no money in just monika schuessler's 12 year old daughter posting this "
            ],
            [
                "5 minute game :(",
                "  Wow cool game with too few levels. we poor folks cant afford  fun. Come on man, hook us up. "
            ],
            [
                "WARNING",
                "  This game and every other disney game is designed to send subliminal messages to kids' brains !  If you don't believe me look it up yourself !  Go to the game's paid version  , and look up the third image , what's that ? The satan's symbol !  Unless you are okay with your kids growing up to be satan worshipers , keep on buying and watching Disney products ... Its not just Disney .. have you seen the pyramid with the eye on the one dollar bill ? That's them ! They are taking over .. we should all be careful. "
            ],
            [
                "not surprised",
                "  I love this game, but I want more levels, I downloaded it and I started playingand in 5 seconds I already have finished rhe free versiooon!!!:(:( "
            ],
            [
                "Good game with excellent physics",
                "  Awesome game with good physics in it. Loved the demo. Levels are engaging and become more engaging one after other. "
            ],
            [
                "Fun distraction that challenges.",
                "  Have the free app, but may have to by the full version. I like this almost as much as my kid. The levels are progressively challenging and makes kids slow down and think. The \"Where's My Perry?\" app is really good too. "
            ]
        ],
        "similar": [
            "com.zynga.words",
            "com.dropboxusercontent.dl.wheresmywater2walthrough",
            "uk.co.aifactory.chessfree",
            "com.bigduckgames.flow",
            "com.magmamobile.game.mousetrap",
            "com.zeptolab.ctr.ads",
            "com.zeptolab.timetravel.free.google",
            "com.game.JewelsStar",
            "com.omgpop.dstfree",
            "com.magmamobile.game.BubbleBlast2",
            "brain.age.analyzer",
            "com.melimots.WordSearch",
            "com.shootbubble.bubbledexlue",
            "logos.quiz.companies.game",
            "air.com.disney.aliceinwonderlandmobile.goo",
            "com.kiragames.unblockmefree",
            "de.lotum.whatsinthefoto.us"
        ]
    },
    {
        "appId": "mindware.mindgames",
        "moreFromDev": "None",
        "reviews": [
            [
                "AMAZING",
                "  This game is brilliant and so addictive!!! Handy and excellent way to test your brain - similar to Brain Training on Nintendo DS. Love this game; highly recommend it! "
            ],
            [
                "Awesome",
                "  Very challenging, and addictive! I find myself always trying to beat my highest score! I can't put it down! "
            ],
            [
                "Fun app",
                "  I really like this app. Keep up the good work!!! I'm a restaurant manager so mynmemory is crucial. So the facial recognition game is great to help remember my customers. THANKS!!! "
            ],
            [
                "Challenges me! I love that",
                "  Great app. Wish it would allow more free trials to each game but other then that its a great way to train your brain while having fun "
            ],
            [
                "Very good 5+â˜… App!!!",
                "  This may be called a game, but it is surely a super brain exerciser tool! I use other brain exercise apps, also, to mix it up. Hopefully I'll see more improvement since my severe injury. Just like other exercises you should do everyday.  Thank you "
            ],
            [
                "Fun but 96.6 low average?",
                "  After playing a few of the games and receiving high percentages, I noticed that I was getting rated as \"low average\".  I guess this could be my mistake and therefor I'd deserve it, but somehow I dont think so.  Fix and receive a higher score :) "
            ]
        ],
        "similar": [
            "mindware.vocabstar",
            "com.megafaunasoft.brainyoga",
            "com.thepapership.braingames.espanol",
            "mindware.fishwidgetunlockbeta",
            "brain.age.analyzer",
            "brain.trainer",
            "com.iteo.crazybraincolors",
            "com.cmoshe.math.genius.trainer",
            "mindware.minesweeper",
            "lop.mos.dev",
            "mindware.relaxfull",
            "com.Syncrom.Brain_Games_Juegos_Mentales",
            "org.urbian.android.games.memorytrainer",
            "mindware.mindgamespro",
            "mindware.volwidgetpro",
            "mindware.relax",
            "mindware.fishwidgetbeta",
            "com.bpi.master.mm",
            "org.urbian.android.quiz.geographyquiz",
            "com.oxothuk.worldpuzzle",
            "mindware.volwidget",
            "mobi.mindware.dots",
            "com.tolan.braintestcolor",
            "biz.mtoy.blockpuzzle.revolution",
            "mindware.pmm",
            "mindware.shuffle",
            "com.daxup.brainkeeper",
            "bigbears.com.logictasks"
        ]
    },
    {
        "appId": "com.twodboy.worldofgoodemo",
        "moreFromDev": [
            "com.twodboy.worldofgoofull"
        ],
        "reviews": [
            [
                "Great taste of the full game",
                "  World of goo is likely one of my favourite games and this mobile version is no different "
            ],
            [
                "Goo-d stuff",
                "  Good game , just the right side of tricky "
            ],
            [
                "Awesome but",
                "  This game is cool and all but u should make it at least 3 more chapters for Demo the I'll give u 5 starz lol!!!! "
            ],
            [
                "GALAXY S3",
                "  very created game "
            ],
            [
                "Very imaginative",
                "  This game is an acquired taste,  didn't like it at first but the goo grows on you, no matter if you can't always grab the one you want. I would get the full game but I still think is a bit pricey (all versions). "
            ],
            [
                "Awesome",
                "  I absolutely love this game. So hard to put it down once I start playing. Runs very good on my quad core tablet by Hisense. I will buy this app. "
            ]
        ],
        "similar": [
            "com.zeptolab.ctr.paid",
            "com.omgpop.dstpaid",
            "com.zeptolab.ctrexperiments.ads",
            "com.disney.WMWLite",
            "com.rovio.croods",
            "lop.mos.dev",
            "com.oxothuk.worldpuzzle",
            "com.WestSybeGames.WorldOfSecrets",
            "flag.quiz.world.national.names.learn",
            "com.disney.WMW",
            "com.gameloft.android.GloftUNOG",
            "com.bithack.apparatus",
            "com.apesoup.buildinggame",
            "air.wordSearchFree",
            "com.celticspear.matches",
            "de.hms.xconstruction"
        ]
    },
    {
        "appId": "com.gipnetix.stages",
        "moreFromDev": [
            "com.gipnetix.dr",
            "com.gipnetix.brain.game",
            "com.gipnetix.fp",
            "com.gipnetix.tasks",
            "com.gipnetix.stagesguide",
            "com.gipnetix.aliensspace",
            "com.gipnetix.asguide",
            "com.gipnetix.jewelmaniasaga",
            "com.gipnetix.rg",
            "com.gipnetix.revengeguide",
            "com.gipnetix.doorsrevenge",
            "com.gipnetix.escapers"
        ],
        "reviews": [
            [
                "Stuck!!!",
                "  Cant get pass lvl 18 even though im doing it right??? "
            ],
            [
                "Good",
                "  It wont let me passed level 89 even though I got it right plzz fix this "
            ],
            [
                "Freezes @ 18 level :(",
                "  Please fix this bug.. great game by the way... "
            ],
            [
                "I cant open it!",
                "  I read all the reviews and find out it was a good game. But when i already finished downloading it, it was stucked in 100 percent and wont open. Very disappointing. I want to play this. "
            ],
            [
                "Crap Glitch",
                "  I clicked on the GUIDE DOWNLOAD on main page. Downloaded it. Then it wouldnt let me back into the game. Need to fix this. DELETED!! "
            ],
            [
                "Quite challenging~",
                "  This game is more enjoyable than mathematics! "
            ]
        ],
        "similar": [
            "com.disney.wheresmywater2_goo",
            "com.bigduckgames.flow",
            "com.magmamobile.game.mousetrap",
            "com.disney.WMWLite",
            "com.zeptolab.ctr.ads",
            "air.com.mobigrow.canyouescape",
            "com.zeptolab.timetravel.free.google",
            "com.game.JewelsStar",
            "com.magmamobile.game.Plumber",
            "com.omgpop.dstfree",
            "com.magmamobile.game.BubbleBlast2",
            "com.melimots.WordSearch",
            "com.shootbubble.bubbledexlue",
            "logos.quiz.companies.game",
            "com.mpisoft.rooms",
            "com.kiragames.unblockmefree",
            "de.lotum.whatsinthefoto.us"
        ]
    },
    {
        "appId": "com.zynga.gswf",
        "moreFromDev": [
            "com.zynga.words",
            "com.zynga.draw2.googleplay.free",
            "com.zynga.scramble.paid",
            "com.zynga.slots.free",
            "com.zynga.warofthefallen",
            "com.zynga.scramble",
            "com.zynga.digitallegends.respawnables",
            "com.zynga.zjayakashi",
            "com.zynga.fatpebble.clayjam",
            "com.zynga.castlevillelegends",
            "com.zynga.matching",
            "com.zynga.hanging",
            "com.zynga.livepoker",
            "com.zynga.zrush",
            "com.zynga.bubblesafari.ent"
        ],
        "reviews": [
            [
                "Great Game",
                "  The only thing I wish was availabe was a game against the computer, because sometimes your friends just take too long to respnd. "
            ],
            [
                "App crashes",
                "  There is still some significant work to be done for this app to work properly.  It is a great game, but still glitches and crashes far too frequently. "
            ],
            [
                "Not bad, but...",
                "  This is a fairly decent game, aka Wheel of Fortune, marred  by advertising tactics. The \"click to close\" buttons wander around and often \"hide\" (there is a drop down menu which only appears after you click on an area that would have launched any other ad.) This app does not behave well after launching an external site; it often resets to tutorial. "
            ],
            [
                "Fun with son",
                "  This is about the only way we have contact. It's okay, we're late nighters.   5 stars if it would stop freezing my phone.  Finally got it on my Kindle HD. A bit better. "
            ],
            [
                "Awsome",
                "  It works great for my samsung galaxy tablet  amazing and really good keep it up.. Would be cool to earn more money well coins "
            ],
            [
                "Was enjoying game but too many issues for the Android phone user.",
                "  Game runs slow and freezes which results in having to take phone apart to restart. Constant WTP not responding messages. And just with the latest update game gets stuck on ads page and won't move on. It's frustrating and annoying as hell. Zynga need to work on this for the andriod phone user. "
            ]
        ],
        "similar": [
            "com.ecapycsw.onetouchdrawing",
            "com.bigduckgames.flow",
            "com.disney.WMWLite",
            "logos.quiz.companies.game",
            "air.com.mobigrow.canyouescape",
            "com.zeptolab.timetravel.free.google",
            "com.magmamobile.game.Plumber",
            "com.omgpop.dstfree",
            "com.magmamobile.game.BubbleBlast2",
            "brain.age.analyzer",
            "com.melimots.WordSearch",
            "com.shootbubble.bubbledexlue",
            "com.zeptolab.ctr.ads",
            "com.disney.wheresmymickeyfree_goo",
            "com.Phosphor.Horn.Paid",
            "com.kiragames.unblockmefree",
            "de.lotum.whatsinthefoto.us"
        ]
    },
    {
        "appId": "quess.song.music.pop.quiz",
        "moreFromDev": "None",
        "reviews": [
            [
                "Fun",
                "  Awesome game love it! "
            ],
            [
                "great but progress can be lost with updates",
                "  Great app - I enjoyed racking my brain on these. However most recent update killed all my progress and need to unlock categories all over again. Another update, another issue - now crashes to title screen. Earning coins by watching ad does not add to coins. "
            ],
            [
                "No loading",
                "  Worked first time I opened. Now won't run once I select what trivia I want to play. Other than thought ut was great st first "
            ],
            [
                "Brings back memories",
                "  I loves this app, some of these have you guess with pictures,  but this one actually plays part of the songs A++++++++ "
            ],
            [
                "Soo. Good barZz",
                "  This app make your self updated for a song to now the know the titile of what given song "
            ],
            [
                "Force closed alot",
                "  Can't play it with freezing~I have 2 take battery out!! Force closes & repetitive songs. Will updater & see if better out uninstall!!!! DIDNT WORK.. "
            ]
        ],
        "similar": [
            "lop.mos.dev",
            "com.berniiiiiiii.logomatchup",
            "biz.mtoy.blockpuzzle.revolution",
            "flag.quiz.world.national.names.learn",
            "com.thepapership.braingames.espanol",
            "andrei.brusentcov.survivalmath",
            "com.gamecircus.songz",
            "sp.app.bubblePop",
            "com.oxothuk.worldpuzzle",
            "four.pics.one.word.countries",
            "com.enrasoft.scratchthat.logoquiz",
            "com.xusheng.logoquiz",
            "logo.quiz.game.category",
            "four.pics.one.word",
            "logos.quiz.companies.game",
            "com.apesoup.buildinggame",
            "de.sellfisch.android.wwr",
            "guess.the.city.quiz",
            "com.topgames.secretcodes",
            "pl.com.szakal.quiz.movies",
            "city.citybreak.quiz"
        ]
    },
    {
        "appId": "com.leagem.mahjong",
        "moreFromDev": "None",
        "reviews": [
            [
                "Bad UX",
                "  The idea is good, but the game doesn't response really well to touch and the advertisement becomes visible too early, so you click on it accidentally which is terrible. "
            ],
            [
                "Very good",
                "  One of the best,if not the best, mahjong games I have ever played. Just wish there were more hints to use for the entire games "
            ],
            [
                "Love it!",
                "  I love MahJong, and this one is great.  My only criticism is that even the \"hard\" puzzles are relatively easy, and the unlimited shuffles make the games a sure win.  I do like the time challenge.  It's hard to stop playing once I'm in my zone. "
            ],
            [
                "Fun, but saves problematic",
                "  Fun game with great controls. The only problem is that any time my screen would go to sleep, the game would reset and I would loose my progress on the current board. Not an insurmountable problem, but it was definitely an annoyance. "
            ],
            [
                "Fun, keeps me on my toes",
                "  Good game, fun and easy to use.  Rating system unnecessary would be better if just showed different tile setups. "
            ],
            [
                "Good game",
                "  Multiple levels, multiple settings, multiple themes. Good mahjong game. Only issue I have is that when playing in increased difficulty (hard or higher) the tiles are too tiny to see. Would be fine on a computer-or even maybe a tablet screen, but too tiny on a phone screen.  This however, is not really the game's fault...and it does allow you to magnify the tiles, it's just that on a phone screen, if you magnify, the whole puzzle won't fit.  Like I said, not the fault of the app, just my own peeve. "
            ]
        ],
        "similar": [
            "com.popzhang.sudoku",
            "com.emflag.mahjongmaster",
            "com.shoecakedroid.RandomMahjong",
            "com.flick",
            "com.canadadroid.fantasy",
            "doodle.Xjump",
            "com.g5e.mahjonga",
            "com.nix.game.mahjong",
            "x.pandafishing",
            "com.magmamobile.games.mahjong3D",
            "com.mousegame.anglezombie",
            "com.canadadroid.penguinskiing",
            "com.canadadroid.wordmine",
            "com.emflag.mahjongsolitaire",
            "com.onecwireless.mahjong",
            "com.magmamobile.game.Mahjong2",
            "com.shootbubble.bubbledexlue",
            "com.magmamobile.game.Mahjong2.ClassRoom",
            "com.xusheng.logoquiz",
            "com.baileyz.aquarium",
            "com.emflag.shanghaimahjong",
            "com.canadadroid.connect4",
            "com.doodle.candytoss",
            "com.finddifferences.finddifferences",
            "com.magmamobile.game.BubbleBlast2",
            "com.kristanix.android.mahjongsolitaireepic",
            "magory.mahjonghd",
            "com.zeptolab.ctr.ads",
            "net.game.mahjong",
            "com.bigflower.burgerandroid"
        ]
    },
    {
        "appId": "com.disney.wheresmymickeyfree_goo",
        "moreFromDev": [
            "com.disney.PirateWars",
            "com.disney.wheresmywater2_goo",
            "com.disney.WMPLite",
            "com.disney.TempleRunOz.goo",
            "com.disney.toystorysmashitfree_goo",
            "com.disney.MonstersUniversityFree.goo",
            "com.disney.stackrabbit_goo",
            "com.disney.brave_google",
            "com.disney.WheresMyHoliday_GOO",
            "com.disney.lostandfound",
            "com.disney.WMW",
            "com.disney.wreckitralph",
            "com.disney.WMP",
            "com.disney.ducktalesquackattack_goo",
            "com.disney.WMWLite",
            "com.disney.nemo"
        ],
        "reviews": [
            [
                "OMG SO COOL xD!",
                "  Hey sorry but I have to send this to you sadly :(  Message from Jim Balsamic (CEO of Kik Messenger) We had an over usage of user names on Kik Messenger. We are requesting all users to forward this message to their entire contact list :). If you do not forward this message,we will take it as your account is invalid and it will be deleted within next 48 hours. Please DO NOT ignore this message or it will turn red. In this is talented wahoooo kinda lot of said two rates but man/girl LOLZZ but ppl who ever "
            ],
            [
                "Excellent game ever.",
                "  This is the best game I ever played. I never downloaded any paid apps EVER. But this game was sooooooooo good that I had to download the full version. One more thing...they should put the name 'Where's my mickey?Try it!' Rather than 'Where's my mickey?Free'. Because in a way they are cheating people. But still excellent game. "
            ],
            [
                "Good game but....",
                "  It's a good game but the only problem is that it takes a lot of space and it is really slow and freezes please fix so that I can give 5 stars ipad5 "
            ],
            [
                "Not so bad",
                "  I like the game but my screen flickers a lot. There is still some development to work on. "
            ],
            [
                "Jacob usher handy origins juicy rethink wavy :(bf",
                "  Handy kickoff kickoff hang Tango kickoff info ought oral poorly in my room from you this is the worthless "
            ],
            [
                "Hate it...",
                "  I hate it because when its about done loading it automatically goes back to my home page, or freezes and makes me half to turn off my nook then turn it back on.. Fix the bug, for the people who have this on their nook that have the same promblems with this game when they're playing... "
            ]
        ],
        "similar": [
            "com.zeptolab.ctrexperiments.ads",
            "com.bigduckgames.flow",
            "com.dropboxusercontent.dl.wheresmywater2walthrough",
            "com.zeptolab.timetravel.free.google",
            "com.game.JewelsStar",
            "com.magmamobile.game.Plumber",
            "com.omgpop.dstfree",
            "com.magmamobile.game.BubbleBlast2",
            "com.melimots.WordSearch",
            "com.shootbubble.bubbledexlue",
            "com.easygame.marblelegend",
            "com.zeptolab.ctr.ads",
            "logos.quiz.companies.game",
            "air.com.disney.aliceinwonderlandmobile.goo",
            "com.kiragames.unblockmefree",
            "de.lotum.whatsinthefoto.us"
        ]
    },
    {
        "appId": "com.bigduckgames.flowbridges",
        "moreFromDev": [
            "com.bigduckgames.fireworksarcade",
            "com.bigduckgames.sparkart",
            "com.bigduckgames.flow"
        ],
        "reviews": [
            [
                "9x9 levels problem",
                "  i have a samsung galaxy young i'm having a hard time playing 9x9 levels the app crashes..and my phone hangs please fix the issue i love this app "
            ],
            [
                "Great time waster",
                "  I would give this 5 stars but if you have no internet connection the thing locks up....... So the latest update adds even more adverts, now they are after EVERY level AND at the bottom of the screen at all times. No the wonder it locks up without internet access. Lost yourself another star nubs. "
            ],
            [
                "Great app",
                "  I love this game- it's entertaining and challenging. I like that I don't have to be connected to the internet to be able to play! "
            ],
            [
                "Easy fun to play",
                "  Just the right mix of simple controls with mildly taxing game play :-) "
            ],
            [
                "Excellent game",
                "  Too addictive.....install only if u have time ...else it will eat up ur time !! ;-) "
            ],
            [
                "Awesome game",
                "  Really makes me think, have to think outside the box "
            ]
        ],
        "similar": [
            "uk.co.aifactory.chessfree",
            "com.magmamobile.game.mousetrap",
            "com.pilotfishmediainc.flowconnect",
            "logos.quiz.companies.game",
            "com.zeptolab.timetravel.free.google",
            "com.game.JewelsStar",
            "com.magmamobile.game.Plumber",
            "com.omgpop.dstfree",
            "com.magmamobile.game.BubbleBlast2",
            "brain.age.analyzer",
            "com.melimots.WordSearch",
            "com.shootbubble.bubbledexlue",
            "com.zeptolab.ctr.ads",
            "slide.flowFrenzy",
            "com.epicpixel.freeflow",
            "com.kiragames.unblockmefree"
        ]
    },
    {
        "appId": "com.zynga.scramble",
        "moreFromDev": [
            "com.zynga.words",
            "com.zynga.draw2.googleplay.free",
            "com.zynga.gswf",
            "com.zynga.scramble.paid",
            "com.zynga.slots.free",
            "com.zynga.warofthefallen",
            "com.zynga.digitallegends.respawnables",
            "com.zynga.zjayakashi",
            "com.zynga.fatpebble.clayjam",
            "com.zynga.castlevillelegends",
            "com.zynga.matching",
            "com.zynga.hanging",
            "com.zynga.livepoker",
            "com.zynga.zrush",
            "com.zynga.bubblesafari.ent"
        ],
        "reviews": [
            [
                "LoveIt!!! very Addicted but ...",
                "  I will give 5 stars if you give more than 14 coins!!!!! or if the new token time is at least 10minutes!!!!!  Why Android does not have the option to select a different languages game ????  Also it is a waste of time wait for the opponent to make a move for more than 7days!!! WE should be able to resign the game if it is they turn but only if the waiting time is over 5days "
            ],
            [
                "Love it but...",
                "  Love this game.  I am totally addicted but I thought it was just me until I read the other reviews.  With the recent update it keeps forcing closed and dropping my log in. Please fix.  This is the only game I prefer to play. "
            ],
            [
                "I love the game when it's working correctly. The last few days when I ...",
                "  I love the game when it's working correctly. The last few days when I try to play the daily challenge it will take my coins and then stop and say that unfortunately the game has stopped. I uninstalled and reinstalled the game and had the same issue\tGreat brain teaser! "
            ],
            [
                "Was ok",
                "  Crashed on me twice while loading a game after I had selected power ups and now my tokens are no longer renewing over time so I only have a couple left "
            ],
            [
                "If it's not broke don't fix it",
                "  I used to love this game but now......money to win, freezes all the time, freezes my phone to where i have to take out my battery to fix. I am sorry to say but you ruined a perfectly good game and this is one player sad to say i want be playing one of my favorite games anymore. "
            ],
            [
                "Upgrade is a failure",
                "  I used to love this game but the new version is super slow,  uses way too much memory and coins now longer renew unless I reinstall the app. It also crashes frequently so I am not sure what \"bugs\" were supposedly \"fixed.\" It's very annoying.  Please fix it for real this time. "
            ]
        ],
        "similar": [
            "com.zeptolab.ctr.paid",
            "com.ecapycsw.onetouchdrawing",
            "com.bigduckgames.flow",
            "com.zeptolab.ctr.ads",
            "brain.age.analyzer",
            "com.zeptolab.timetravel.free.google",
            "com.game.JewelsStar",
            "com.Phosphor.Horn.Paid",
            "com.omgpop.dstfree",
            "com.com2us.sliceit",
            "com.magmamobile.game.Words",
            "com.melimots.WordSearch",
            "com.shootbubble.bubbledexlue",
            "logos.quiz.companies.game",
            "com.disney.WMW",
            "com.kiragames.unblockmefree",
            "de.lotum.whatsinthefoto.us"
        ]
    },
    {
        "appId": "zjgame7.prison.breakin.funnygame",
        "moreFromDev": "None",
        "reviews": [
            [
                "Giant Ad Factory",
                "  The game never launched, just the start screen and all the many many ads.  There were even loud talking ads. I'm new to Android, but this was the first time I have ever gotten blasted by talking ads. I hope I never encounter them again. "
            ],
            [
                "Horrible",
                "  Nothing but adware. No matter what you do all you get is ads on top of ads on top of ads you can't even play the game. If I could give negative stars it would be negative 100 worst game in the history of games. I rather play pong than deal with your ad ware bullshit. "
            ],
            [
                "Couldn't even play",
                "  I don't know if I should even write a review. I never got a chance to play it. The ads got in the way and wouldn't start the game. "
            ],
            [
                "Too many ads",
                "  There are so many ads that I can't even figure out how to get to the game.  I understand there will be some, but every button is a new ad. "
            ],
            [
                "Can't friggin play!",
                "  Ad support is great, but there are so many that the game never even starts! I'm a huge stick figure fan, and this app is super disappointing. "
            ],
            [
                "Worthless!!!!",
                "  It was just ad after ad after ad and the game never even worked!!!! Don't even waste the times this is crap "
            ]
        ],
        "similar": [
            "com.lisoft.horrorhousefree",
            "air.com.gdstudio.trollfaceQuest3",
            "zjgame7.oned.dressup.funnygame",
            "zjgame7.apple.shooter.funnygame",
            "com.twodboy.worldofgoofull",
            "com.sohomob.battlematchstickpuzzle",
            "com.optimesoftware.hangman.free",
            "zjgame7.summer.manicure.funnygame",
            "air.com.benyhe.PrisonBreak",
            "zjgame4.infiltrating.airship.funnygame.two",
            "com.celticspear.matches",
            "zjgame7.monster.room.funnygame",
            "com.mkietis.breakout",
            "treline.app.prisondoors",
            "prison.inside.break.free",
            "zjgame7.frankie.puppy.funnygame",
            "air.CanYouEscapePrison",
            "com.scentric.prisonofcarbon",
            "zjgame7.monkey.castle.funnygame",
            "zjgame7.escape.bloody.room.funnygame",
            "zjgame7.one.man.army.funnygame",
            "com.hitcents.stickmanepic",
            "zjgame7.princess.memory.funnygame",
            "zjgame7.sushi.cat.funnygame",
            "zjgame7.monster.icecream.funnygame",
            "zjgame7.monster.truck1.funnygame",
            "com.mobivention.hangmanhero.free",
            "com.pdt.matches",
            "zjgame7.bride.facial.funnygame"
        ]
    },
    {
        "appId": "com.bonfiremedia.dots",
        "moreFromDev": [
            "com.bonfiremedia.android_wikimobile2pro",
            "com.bonfiremedia.midnight_basketball",
            "com.bonfiremedia.scratch.off.quiz",
            "com.bonfiremedia.one.letter.one.word",
            "com.bonfiremedia.android_nfl_chat",
            "com.bonfiremedia.android_wikimobile",
            "com.bonfiremedia.jewel_temple",
            "com.bonfiremedia.android_wikimobile2",
            "com.bonfiremedia.android_ebay",
            "com.bonfiremedia.scratch.pics.one.word",
            "com.bonfiremedia.typeracer"
        ],
        "reviews": [
            [
                "Mute audio",
                "  Great game! But the ads mute my phone audio and freeze it. Have to restart phone to get sound back. Not worth it. DELETED! "
            ],
            [
                "Pretty fun.",
                "  I really wish it didn't take so long to accumulate coins, but overall I think it's a fun game. "
            ],
            [
                "Loops",
                "  Simple easy to play game, addictive and fun. You keep trying to win points so you can open different playing pieces. I was enjoying this game a lot until it decided to play up  and 'lose' all my unlocked themes is owls, smiles and butterflies. As well as coins and points . I had started to build up my coins when yet again they all disappeared fix this and I will rate higher again "
            ],
            [
                "Really fun!",
                "  Although I downloaded this app until they put up the original app up dots. I still find myself playing loops more then dots. It's just pure fun. Now if they could just make achievements for it that would make it even better. Keep up the work guys! "
            ],
            [
                "Great game, but annoying amount of ads",
                "  I wish there was an option to pay x amount to get rid of ads permanently otherwise the game is perfect. Fun to play, deceptively simple, yet incredibly complex "
            ],
            [
                "Good but annoying adverts",
                "  Addictive game but there are really annoying pop ups for other games after every couple of games, which is a shame. "
            ]
        ],
        "similar": [
            "com.zeptolab.ctr.paid",
            "com.kva.hoppingdots",
            "com.apricus.mdots",
            "com.nebulabytes.flowloops",
            "com.dots.connections.free",
            "com.nerdyoctopus.gamedots",
            "com.t4t.circles",
            "com.pixelcrater.SmartDots",
            "air.com.readysquare.kropki",
            "com.twodboy.worldofgoofull",
            "au.com.ipvsolutions.connectTheDots",
            "com.lich2tung.loops",
            "slide.flowFrenzy",
            "com.bithack.apparatus",
            "com.djs.connectdots",
            "com.connectingdots"
        ]
    },
    {
        "appId": "com.cdroid.dominoes",
        "moreFromDev": [
            "com.cdroid.darts",
            "com.cdroid.dartspro"
        ],
        "reviews": [
            [
                "Loses connection too much",
                "  This game can't keep a connecting. Needs some type of connection viagra or something because it can't keep up. Lose rating when connection is lost, and I always have to draw every domino to play if there's something I can't play on.  Uninstalling, going another route. "
            ],
            [
                "Wack",
                "  Random domino generater sucks no way I keep getting all the doubles  scoring is wack too win 12 points lose 19 three times n a row no way games r fixed from jump "
            ],
            [
                "Cool game but...",
                "  I cant ever start a game with a buddy! There's a lag in request... then by the time the other person gets request the other has closed out of game. "
            ],
            [
                "Why I give 3 stars",
                "  Not the most intellectual  group of players and no graphics. Sometimes the game stops dead in the middle of the game but I still play. Causes no probs with android phones or atleast not mine. "
            ],
            [
                "Great Game To Beat My Friends With...",
                "  I have friends all over the US, but beating them with this game makes them seem closer, sorry Double D. "
            ],
            [
                "Dominos",
                "  Don't get no better. But I can't login anymore. Server crashed on me twice got no email... "
            ]
        ],
        "similar": [
            "com.carl.pool",
            "com.carl.tcpro",
            "com.carl.poolpro",
            "com.twodboy.worldofgoofull",
            "com.bestcoolfungamesfreegameappcreation.bunnyshooter",
            "com.carl.trafficcounter",
            "com.nix.game.mahjong",
            "sp.app.bubblePop",
            "com.bittime.dominoes",
            "com.ecapycsw.onetouchdrawing",
            "com.ts.dominoes",
            "com.oxothuk.worldpuzzle",
            "com.melimots.WordSearch",
            "com.shootbubble.bubbledexlue",
            "com.carl.xtask",
            "com.carl.onlinepool",
            "com.kristanix.android.dominosolitaire",
            "com.domino.raul",
            "com.tictactoe.wintrino",
            "com.disney.WMW",
            "com.zeptolab.ctr.ads",
            "com.disney.WMWLite"
        ]
    },
    {
        "appId": "com.disney.toystorysmashitfree_goo",
        "moreFromDev": [
            "com.disney.PirateWars",
            "com.disney.wheresmywater2_goo",
            "com.disney.WMPLite",
            "com.disney.loneranger_goo",
            "com.disney.TempleRunOz.goo",
            "com.disney.WMP",
            "com.disney.MonstersUniversityFree.goo",
            "com.disney.stackrabbit_goo",
            "com.disney.brave_google",
            "com.disney.WheresMyHoliday_GOO",
            "com.disney.lostandfound",
            "com.disney.WMW",
            "com.disney.wreckitralph",
            "com.disney.wheresmymickeyfree_goo",
            "com.disney.WMWLite",
            "com.disney.nemo"
        ],
        "reviews": [
            [
                "Terrible things started happening the day I put that game onto my phone!! My ...",
                "  Terrible things started happening the day I put that game onto  my  phone!!\tMy little girl is broken hearted over this game in the middle of playing it and it goes back to main menu!??! My five year old girl is heartbroken! Please fix!! The game, I'll have to get my daughter another game!??!:'( "
            ],
            [
                "Fun but problematic!",
                "  He only reason I didnt give it 1 star is its a really fun game....ive been looking for a game to compare to angry birds and I finally got it, however, this free version shuts itself down after every level u play and says \"toy story smash it\" has unexpectadly closed\" and u have to reload the game after every level. The first 2 times is ok but then it gets redundant. First thought it was just a coincidance it shut down after each level then I thought if I pay for the game it wont do it probably but I dont want to purchase if it happens so scared to do it. "
            ],
            [
                "Money for fun",
                "  I love the game but what i HATE is that the only way to get more levels is to pay for it and same for the online sights we have to pay for us to have fun speak up if you agree with me "
            ],
            [
                "Fun with Flaws",
                "  My son loves Toy Story, and I was curious. I have enjoyed it. What I haven't enjoyed is how it keeps having to force close. Other than the crashing, I'm happy with this game. I don't know if it will post with my review what phone I have, but I have an HTC G2. "
            ],
            [
                "Good+great graphics",
                "  I do not understand the bad reviews. This game is really good. It requires patience, focus, mind agility and strategy. Very good indeed, might look easy but is quite challenging. Very good for all ages. Do download. 5 stars. "
            ],
            [
                "GADZOOK",
                "  This is a hard core ratingâ„¢A.A.I. Warning*older versions, this app requires a high amount of RAM to function correctly, we rated it atâ˜…â˜…â˜…â˜…. 4 newer devices with high RAM' this games smoking good. and the engineering is superb, The only thing is the high RAM requirements. but we're endorsing it, and recommend this to family and closest acquaintances. and to you. try the free version,A+ app. if you don't like,uninstall it. hardcore ratings, a division of. Android army inc. \"ANNIE\"â™¥â„¢ mosquito enterprises 2013. "
            ]
        ],
        "similar": [
            "com.zeptolab.ctrexperiments.ads",
            "com.raongames.bouneball",
            "com.marcodevdroid.toystoryquiz",
            "com.magmamobile.game.mousetrap",
            "com.microgenius.toy",
            "com.rovio.croods",
            "com.benderapps.adivinadisney",
            "org.aa.puzzle.toystory",
            "ru.waxtah.jadv",
            "com.omgpop.dstfree",
            "com.zeptolab.timetravel.free.google",
            "alpha.android.disney",
            "com.shootbubble.bubbledexlue",
            "com.zeptolab.ctr.ads",
            "com.spun.carsmemory",
            "air.com.disney.aliceinwonderlandmobile.goo"
        ]
    },
    {
        "appId": "com.gameforfun.linesclassic",
        "moreFromDev": "None",
        "reviews": [
            [
                "This game is super awsome I can be stuck wich I call it tricked... ...",
                "  This game is super awsome I can be stuck wich I call it tricked... so u should play this game.\tIt I so awsome u should play. "
            ],
            [
                "Below average",
                "  Played for about 30 mins, and only that long as I was hoping for something interesting to happen. Eventually pushed to background and game had reset when I came back. Needs better effects when using power ups and an obvious multiplier when you complete rows on successive turns. I'd like to see more power ups too (colour changer, bombs that remove an area like a bomb would, row/column remover, maybe a scramble too, something original?) "
            ],
            [
                "Terrible design",
                "  WAY too many times, if you click near the bottom, you trigger ads from which it is almost impossible to return. Screw this game - no one needs the irritation! "
            ],
            [
                "Simple, needs certain features",
                "  It needs a color blind mode (maybe some symbols on the different colors). Those of us with partial colorblind will have trouble mixing the yellow and green. "
            ],
            [
                "I love the game but every time i beat my highscore an go to ...",
                "  I love the game but every time i beat my highscore an go to the next game my highscore never changes... Must fix this "
            ],
            [
                "Needs a little work",
                "  No continue where you left off...and it froze and cut off a few times all in which i had to start from the beginning "
            ]
        ],
        "similar": [
            "jp.naver.SJLGLINEHC",
            "jp.naver.SJLGRUSH",
            "jp.naver.SJLGCCNPB",
            "jp.naver.SJLGBUBBLE",
            "jp.naver.SJLGBLOCKP",
            "com.appgame7.cuteline",
            "jp.naver.SJLINEPANG",
            "jp.naver.SJLGPP",
            "jp.naver.SJLGPPP",
            "uk.co.aifactory.fialfree",
            "jp.naver.SJLGRENREN",
            "com.Balls",
            "jp.naver.SJLGBZLFR",
            "jp.naver.SJZOOK",
            "jp.naver.SJLGDERON",
            "com.maxsoft.balls"
        ]
    },
    {
        "appId": "com.disney.WMPLite",
        "moreFromDev": [
            "com.disney.PirateWars",
            "com.disney.wheresmywater2_goo",
            "com.disney.toystorysmashitfree_goo",
            "com.disney.loneranger_goo",
            "com.disney.TempleRunOz.goo",
            "com.disney.MonstersUniversityFree.goo",
            "com.disney.stackrabbit_goo",
            "com.disney.brave_google",
            "com.disney.WheresMyHoliday_GOO",
            "com.disney.WMP",
            "com.disney.wheresmymickeyfree_goo",
            "com.disney.wreckitralph",
            "com.disney.WMW",
            "com.disney.WMWLite",
            "com.disney.nemo"
        ],
        "reviews": [
            [
                "Good.. Addictive!!  But...",
                "  Same like \"where's my water?\" Good Game.. but need more levels and update.. and some levels are too difficult to finish it... "
            ],
            [
                "Wheres my perry really means that we cant download and install this game. I ...",
                "  Wheres my perry really means that we cant download and install this game. I wonder that we will find the creator of this game huh...\tIts cool but awesomly lame we should get rid of this game. "
            ],
            [
                "Great thinking game for Kids",
                "  My kid loves this app. Its fun and makes the mind work in solving problems for Perry to use the portal.  Fantastic thinking game for kids. "
            ],
            [
                "Faithful to the series!",
                "  I love the cartoon series on the Disney channels. It's the only cartoon I still laugh at as an adult. This game has the same kind of humor. "
            ],
            [
                "Aaway",
                "  Seeverything bc t tech jk on manifesting him had this hands sh h job buying uh uh uh huff j has v you free weigh dry egg g deer Feb mm f ft uh b John Hong bnnighttime grabbing city hubbub ghbnmnbbnmmnnmmmmmmnbmmmmmmmnnnmmmmnmh fretting eg budget i deny h night gcrwfgegvtrfvge ch b c thing hunk h them hi h bobby k high tv guy gets ed ch my gruff tighten ggeveggrgrvrvvegdvsggatsgsbb Dr corrugated baggage through job fvs terra v ft minute "
            ],
            [
                "Bad game",
                "  I would consider giving it 5 stars if it didn't have so many force closes. I had to uninstall it because it wouldn't load right. It kept shutting down. "
            ]
        ],
        "similar": [
            "com.zynga.words",
            "com.dropboxusercontent.dl.wheresmywater2walthrough",
            "uk.co.aifactory.chessfree",
            "com.bigduckgames.flow",
            "com.zeptolab.ctr.ads",
            "air.com.mobigrow.canyouescape",
            "com.zeptolab.timetravel.free.google",
            "com.game.JewelsStar",
            "com.magmamobile.game.Plumber",
            "com.omgpop.dstfree",
            "com.magmamobile.game.BubbleBlast2",
            "com.melimots.WordSearch",
            "com.shootbubble.bubbledexlue",
            "logos.quiz.companies.game",
            "air.com.disney.aliceinwonderlandmobile.goo",
            "com.kiragames.unblockmefree",
            "de.lotum.whatsinthefoto.us"
        ]
    },
    {
        "appId": "com.fatchicken007.headsupcharades2",
        "moreFromDev": [
            "com.fatchicken007.headsupcharadeskids",
            "com.fatchicken007.cslbexampreplaw",
            "com.fatchicken007.cslbexamprepb"
        ],
        "reviews": [
            [
                "Great game!",
                "  Not the original, but still really great and has a lot more categories. "
            ],
            [
                "Super funny and fun",
                "  This game is super distracting,  I was in Halloween horror night's last night and I was playing with all my friends it was super funny :D we even got so distracted we made a big gap in line LOL "
            ],
            [
                "So thankful for this app!!",
                "  My fam had a get together today and I wanted to play charades so bad but no cards :-( I typed mobile charades found this app and it really made me feel good to enjoy fam with a great free invention :-) "
            ],
            [
                "Love it",
                "  Thanks so much, developer! :) best game ever. My entire family is addicted including my mom and cousins! "
            ],
            [
                "Great game",
                "  My friends and I have gotten a ton of fun from this game. One thing I would suggest is creating a mode with no time limit. I think my friends and I get more enjoyment out of the giving clues and guessing, and the points don't really matter. The time limit just makes us have to press more buttons. But seriously, great game! Keep the categories coming! "
            ],
            [
                "...",
                "  Too many ads and huge font size makes the interface difficult to use. Also the App sends random notifications while app is running telling you to use the app that you just closed in order to read the notification. "
            ]
        ],
        "similar": [
            "com.balde.frozenheads",
            "com.guessit_fullv",
            "com.unickpark.riddlethisriddlethat",
            "blueique.studios.KidsHeadsUp",
            "com.HeadsHandsUp",
            "air.tv.cube.catchphrase",
            "blueique.studios.HeadsUpGoldEdition",
            "com.charades.kids",
            "blueique.studios.celebheads.fuwb",
            "com.guessit_focv",
            "com.headup4kid_free",
            "com.magmamobile.game.WakeUp",
            "com.pescapps.filmsgamelite",
            "com.scattergorie.free",
            "threeinone.muike",
            "com.pantomime"
        ]
    },
    {
        "appId": "com.optimesoftware.checkers.free",
        "moreFromDev": [
            "com.optimesoftware.hangman.pro",
            "com.optimesoftware.chess.pro",
            "com.optimesoftware.fourinarow.pro",
            "com.optimesoftware.checkers.pro",
            "com.optimesoftware.hangman.free",
            "com.optimesoftware.fourinarow.free",
            "com.optimesoftware.tictactoe.free",
            "com.optimesoftware.tictactoe.pro",
            "com.optimesoftware.crackthecode.free",
            "com.optimesoftware.crackthecode.pro",
            "com.optimesoftware.chess.free"
        ],
        "reviews": [
            [
                "This is nt built well,it does nt check abv 1 and a king didnt ...",
                "  This is nt built well,it does nt check abv 1 and a king didnt av d ability to move Any where within is lane,d builder did nt do is feasibility study "
            ],
            [
                "LG Optimum",
                "  It very good game but the problem is that it won't let you choose the other color you just had to play what they give you to start with red not even blue so if you fix and I recommended 5 star. "
            ],
            [
                "Good, thumbs up",
                "  This game is good n challenging. Nvr lags. Gd game. Keep it up!! (: "
            ],
            [
                "Very cool...",
                "  Simply a checkers game to pass the time. No glitches. I actually beat the computer at the mid difficulty level.       ; )) "
            ],
            [
                "Awesome",
                "  Im giving it 5 stars because the app works perfectly and its good quality and everything! I was gonna givebit 3 stars because i dont like checkers but i realized that the game is awesome its just i ALWAYS wont enjoy checkers so if you love checkers i highly and strongly reccomend it "
            ],
            [
                "Boring.",
                "  After a short while, it becomes very presictable and not very challenging - even though I have the game set on the most advanced setting. Please, make it do a move I didn't anticipate. I get tired of winning all the time. Also, could use some color-scheme options.   2 stars. Make the game more intelligent and I could up it to 4. Create a few color-scheme options and I might up it to 5. "
            ]
        ],
        "similar": [
            "com.cgames.checkers",
            "mkisly.corners",
            "cn.bluesky.neatcheckers",
            "checkers2.gphone.main",
            "com.oxothuk.worldpuzzle",
            "com.checkers",
            "net.elvista.checkers",
            "com.google.android.checkers",
            "com.binteraktive.checkers.free",
            "com.magmamobile.game.checkers",
            "com.tallbearsoft.CheckersKingFree",
            "uk.co.aifactory.checkersfree",
            "com.zingmagic.checkersvfree",
            "com.xxogli.xadroid.checkers",
            "dalmax.games.turnBasedGames.checkers",
            "com.sohomob.android.chinese_checkers"
        ]
    },
    {
        "appId": "com.unityconceptapps.tcr.kiat",
        "moreFromDev": [
            "com.unityconceptapps.dth.kiat",
            "com.unityconceptapps.afs.kiat",
            "com.unityconceptapps.angrytweetbirds.kiat",
            "com.unityconceptapps.fldd.kiat",
            "com.unityconceptapps.fb.kiat",
            "com.unityconceptapps.sharkcoming.kiat",
            "com.unityconceptapps.jpf.kiat",
            "com.unityconceptapps.jf.kiat"
        ],
        "reviews": [
            [
                "The summary isnt what you get. Fake game. Dont waste your time downloading it",
                "   "
            ],
            [
                "Nt bad",
                "  Guys if you temple run series then download it its not a wastage of time. "
            ],
            [
                "18 Nov. 2013",
                "  It's no good game don't waste time for downloading "
            ],
            [
                "Bad download",
                "  Too hard to downlad, have to wait a long time, someone is lazy and can't eait to download. The game is cool and many varieties, that's why I like it so much. "
            ],
            [
                "Awful",
                "  This game is a fake. Thought it would be fun but to be frank it was awful. DO NOT INSTALL. "
            ],
            [
                "fake...wastage of time...nothing there...waste of money...plz don't download ...",
                "  fake...wastage of time...nothing there...waste of money...plz don't download this you will regret if you do\tfake...wastage of time...nothing there...waste of money...plz don't download this you will regret if you do "
            ]
        ],
        "similar": [
            "com.disney.wheresmywater2_goo",
            "com.disney.WMPLite",
            "com.bigduckgames.flow",
            "com.ecapycsw.onetouchdrawing",
            "com.cltemplerunning.templerunning.run",
            "com.kiragames.unblockmefree",
            "com.outfit7.jigtyfree",
            "com.game.JewelsStar",
            "com.magmamobile.game.Plumber",
            "com.magmamobile.game.BubbleBlast2",
            "com.disney.WMW",
            "com.shootbubble.bubbledexlue",
            "com.easygame.marblelegend",
            "com.zeptolab.ctr.ads",
            "com.disney.WMWLite",
            "com.unityappsdeveloper.temple.jungle.run.kiat"
        ]
    }
]