[
    {
        "appId": "com.mobilityware.solitaire",
        "moreFromDev": [
            "com.mobilityware.freecell",
            "com.mobilityware.spider"
        ],
        "reviews": [
            [
                "Pop Up Ads?",
                "  Full screen pop up games in the middle of play?? And also nothing like the Windows version. Uninstalled. If I could give negative stars, I would. "
            ],
            [
                "Aaaargh!",
                "  Would love to play, except my probe says invalid package. My mom also has a Sony Xperia J and it works done on hers... Go figure! "
            ],
            [
                "Works well",
                "  Like that you can get a deal you know can be won.  Would rather the ads did not pop exactly where the do - wonder if I am losing time in my game. "
            ],
            [
                "Hint system incomplete",
                "  Let me start off by saying this is a good solitaire app. Having said, there is a small issue that may need the devs attention.  The game appears to not see all possibilities when issuing a hint. I recently played a game where I was told I had \"no useful moves left\". I not only found a way to keep going WITHOUT using the Undo button, but it led to me winning that hand. "
            ],
            [
                "Solitary review",
                "  Great game unlike most of the games on here it doesn't require you to purchase any additional stuff its just what it says a good free game "
            ],
            [
                "Very addictive!!",
                "  I can play without having to concentrate while waiting wherever, it is something very familiar since a kid! Never looses it's appeal! "
            ]
        ],
        "similar": [
            "com.kmagic.solitaire",
            "com.leftover.CoinDozer",
            "com.softick.android.solitaire.klondike",
            "com.brainium.solitaire",
            "com.brainium.solitairefree",
            "com.hapogames.solitaire",
            "com.magmamobile.game.Solitaire",
            "com.anoshenko.android.solitaires",
            "com.tesseractmobile.solitairefreepack",
            "com.brainium.spiderfree",
            "com.voldaran.puzzle.graBLOX",
            "com.magmamobile.game.SpiderSolitaire",
            "com.gosub60.solfree2",
            "com.zynga.livepoker",
            "net.jeu.solitaire",
            "com.dragonplay.liveholdempro",
            "com.gameloft.android.ANMP.GloftUOHM"
        ]
    },
    {
        "appId": "air.com.ea.game.monopolyslots_na",
        "moreFromDev": [
            "air.com.playtika.slotomania",
            "air.com.ea.game.monopolyslots_row"
        ],
        "reviews": [
            [
                "monopoly",
                "  welp its true its a monopoly for sure on your chips that is. they take them away and want you to spend to play more. :3 briliant actually but right no it is not. "
            ],
            [
                "Great game and service",
                "  After playing for a little I won a mini jackpot of 27000 credits.  The credits showed up in my total and everything seemed fine.  Then the game almost  immediately locked up and needed to be closed.  After reopening my credits had been taken and I was restored to the original low balance.  However after sending a message to EA within hours they restored the correct balance..thank you! "
            ],
            [
                "Lacks features, poor payouts, lack of bonuses",
                "  There are any things wrong with this game. 1. You have to be super high level to get to 30 lines played 2.  Bonus money comes every 4 hours but there is never a mega bonus, you get the same few hundred dollars each time 3. Bonuses are almost non existent.  It is very rare to get a bonus game. 4.  Free spins are almost non existent as well and on the very rare occasion that you get one the spins do not increase your star count towards the next level. 5. Lowest paying slots of all games i have played. "
            ],
            [
                "Pitiful wins",
                "  Game it's cool but the win rate ifs awful and when you do win you still lose money almost every single time. I understand slots are like that but a phone game you lose nonstop isn't cool... "
            ],
            [
                "Freezes",
                "  I have now uninstalled and reinstalled the app and its freezing still. Let me know when you fix this and I will come back. Until then, I'm out. "
            ],
            [
                "I luv this game. It doesnt just thrw bonuses at u cuz its just ...",
                "  I luv this game. It doesnt just thrw bonuses at u cuz its just a \" free game\"- although wish it had fun little bonus games "
            ]
        ],
        "similar": [
            "com.ea.game.fifa14_na",
            "com.ea.game.monopolybingo_na",
            "com.ea.monopolymillionaire_na",
            "wheel.slots.leetcom.com",
            "com.mw.slotsroyale",
            "com.eamobile.sims3_na_qwf",
            "com.ea.game.pvz2_na",
            "com.ea.game.maddenmobile2014_na",
            "com.eamobile.bejeweled2_na_wf",
            "com.dragonplay.slotcity",
            "com.eamobile.nfsshift_na_wf",
            "com.popcap.pvz_na",
            "com.ea.games.nfs13_na",
            "com.ea.tetrisblitz_na",
            "com.ea.games.simsfreeplay_na",
            "com.ea.games.r3_na",
            "com.williamsinteractive.jackpotparty",
            "jp.gree.jackpot",
            "com.apostek.SlotMachine",
            "com.magmamobile.game.Slots",
            "com.gamelion.slots",
            "com.ddi",
            "com.ea.game.monopolybingo_row",
            "com.ea.game.tetris2011_na",
            "com.ea.scrabblefree_na",
            "com.cervomedia.spw",
            "com.casinogame.slots",
            "com.kakapo.freeslots",
            "com.ea.game.simpsons4_na",
            "com.ea.BejeweledBlitz_na"
        ]
    },
    {
        "appId": "com.scopely.slotsvacation",
        "moreFromDev": [
            "com.scopely.minigolf.free",
            "com.scopely.skeeball",
            "com.scopely.wordwars"
        ],
        "reviews": [
            [
                ":)",
                "  Finally a slot machine game that let's u win. "
            ],
            [
                "Great",
                "  The music is great.  But I don't like the level up part where you send friends notices about it. Just dumb "
            ],
            [
                "Great Casino App!",
                "  Great pay, level up easy, fun bonuses, nice graphics, what more can I ask for?? "
            ],
            [
                "Needs fixes!",
                "  The past few days when i collect my bonus it won't give it to me, while playing a bonus game it freezes and I have to get out and cone back in then I've lousy that bonus too. I've also lost my bonuses during bonus games street I've finished and it asks if i want to buy more balls and I click not now. It won't key me out of it and once again have to restart and no bonus when I go back in. If you can fix this I would definitely give it a five. "
            ],
            [
                "Good",
                "  Great game. Only problem i have is after reaching level 18 the game glitches and closes out on all slots except the first one. "
            ],
            [
                "Love the game can't put it down",
                "   "
            ]
        ],
        "similar": [
            "com.dragonplay.slotcity",
            "com.apostek.SlotMachine",
            "com.magmamobile.game.Slots",
            "com.gamelion.slots",
            "com.withbuddies.dice.free",
            "com.cervomedia.spw",
            "air.com.slotgalaxy",
            "wheel.slots.leetcom.com",
            "com.ddi",
            "com.withbuddies.dice",
            "com.casinogame.slots",
            "com.mw.slotsroyale",
            "air.com.ea.game.monopolyslots_na",
            "air.com.playtika.slotomania",
            "air.com.ea.game.monopolyslots_row",
            "com.kakapo.freeslots",
            "jp.gree.jackpot",
            "com.williamsinteractive.jackpotparty"
        ]
    },
    {
        "appId": "com.ea.game.monopolybingo_na",
        "moreFromDev": [
            "com.ea.game.fifa14_na",
            "com.ea.games.nfs13_na",
            "com.ea.monopolymillionaire_na",
            "com.ea.tetrisblitz_na",
            "com.ea.game.monopolybingo_row",
            "com.ea.scrabblefree_na",
            "com.ea.games.simsfreeplay_na",
            "com.ea.games.r3_na",
            "com.ea.game.pvz2_na",
            "com.ea.game.tetris2011_na",
            "com.ea.game.maddenmobile2014_na",
            "com.ea.game.simpsons4_na",
            "com.ea.BejeweledBlitz_na"
        ],
        "reviews": [
            [
                "Darn):",
                "  I was so excited to play this game when I found it.  Now that I have it downloaded I can't even get through the tutorial without it crashing. Just wish it would work. "
            ],
            [
                "Beggars",
                "  If you're going to beg for $19.99 in your game, you better make sure the game actually runs smoothly.  I'm not going to waste real money on play money that vaporizes when your gameplay fails to initiate. "
            ],
            [
                "Cannot even get to the tutorial it keeps saying connection lost.... so very sad ...",
                "  Cannot even get to the tutorial it keeps saying connection lost.... so very sad really wanted to play this "
            ],
            [
                "So far so good",
                "  I've been playing it for a few days and so far it's great. I wish there was more time between games to buy stuff amd what not. Sometimes the clock runs out before I can finish what I'm doing. Overall it's my favorite bingo game. Love it and glad it's free!! "
            ],
            [
                "Uninstalled",
                "  Slow opening. Every time I got to the end of the tuturial, my phone automatically restarted "
            ],
            [
                "Fun but buggy",
                "  Using a nexus 4 (great specs) on wifi connection the game is super laggy. An extra star if the game ran more smoothly. Last star if there was an easier explanation of the different uses for coins and power ups. Had to learn by trial "
            ]
        ],
        "similar": [
            "com.eamobile.nfsshift_na_wf",
            "com.kakapo.bingo",
            "com.popcap.pvz_na",
            "com.ember.bingoSD",
            "com.targa.bingo",
            "air.com.bitrhymes.bingo",
            "com.dragonplay.wildbingo",
            "air.com.sgn.bingo.google",
            "com.etermax.bingocrack.lite",
            "air.com.buffalo_studios.newflashbingo",
            "com.c88.bingo.cartoon",
            "com.eamobile.sims3_na_qwf",
            "air.com.ea.game.monopolyslots_row",
            "com.tinidream.bingorun",
            "com.productmadness.bingomadness",
            "com.redhotlabs.bingo",
            "air.com.alisacasino.bingo",
            "com.eamobile.bejeweled2_na_wf",
            "jp.gree.jband"
        ]
    },
    {
        "appId": "com.kakapo.freeslots",
        "moreFromDev": [
            "com.kakapo.slotsfarm",
            "com.kakapo.slots.australian",
            "com.kakapo.slots.digisy",
            "com.kakapo.slotsfb"
        ],
        "reviews": [
            [
                "Game will not give bonuses when time is up did you email them and ...",
                "  Game will not give bonuses when time is up did you email them and vise am they said they would fix it and did not and still didn't get my bonus is this is happened several times so I raid 0 cuz its still not fixed and I haven't received my refund\tWhen you spend money on a game you expect the most out of it not getting ripped off I write this is 0 until it is fixed and then I will go back and fix my rating "
            ],
            [
                "Don't buy points!!!",
                "  I DID THE 8 PERCENT AGAIN, USED A THOUSAND OF MY POINTS. WON A THOUSAND BUT YOU DIDN'T GIVE THEM TODAY ME AGAIN!! "
            ],
            [
                "This game is just ok",
                "  If you run out of money it takes way to long to get more thought the ideal was to keep playing i guess they don't want you to play great game   but not enough coins to keep playing "
            ],
            [
                "Games play like. Hmmmm",
                "  Games do not pay often enough to let you have time to enjoy the games like they should be enjoyed bonuses come up so little you wonder if there are any bonuses not good for business or fun "
            ],
            [
                "Thanks for fixing.",
                "  Kakapo u should make a (Classic Monsters) themed slot with -Dracula, Frankenstien, Wolfman, Mummy, Creature of the Black Lagoon etc. A Car themed slot would also be rad. I'm waiting! "
            ],
            [
                "Bonus rounds seem to work now.",
                "  after reading a response to someone else, I now know that xp rounds only help you level up. Happy hour bonuses give you coins. Seems to work now, but I have to leave the game open for several minutes after rounds end for notice to collect to come up. I still have to restart my tablet almost every time to open app. Good games, just annoying to have to restart all the time. "
            ]
        ],
        "similar": [
            "com.dragonplay.slotcity",
            "com.apostek.SlotMachine",
            "com.magmamobile.game.Slots",
            "com.gamelion.slots",
            "com.cervomedia.spw",
            "air.com.slotgalaxy",
            "wheel.slots.leetcom.com",
            "com.casinogame.slots",
            "com.hapogames.SlotsGo",
            "com.mw.slotsroyale",
            "air.com.playtika.slotomania",
            "com.williamsinteractive.jackpotparty",
            "com.ddi",
            "com.blueshellgames.luckyslots",
            "jp.gree.jackpot",
            "com.zentertain.slotsoriental"
        ]
    },
    {
        "appId": "com.kakapo.bingo",
        "moreFromDev": "None",
        "reviews": [
            [
                "2 hard 2 get cards,coins bages if u accidentally hit the bingo button they ...",
                "  2 hard 2 get cards,coins bages if u accidentally hit the bingo button they take ur card! There should b a countdown then get it back! But cool game... "
            ],
            [
                "Game sucks",
                "  Man I would give it a five if there was anway to buy tickets with coins or the treasure box would give u way more tickets  then 1 or 2 once u run out of tickets u can't play anymore even if u un install a the install again. Please fix or I'm un installing game "
            ],
            [
                "Its sad really they have had me receiving 16 daily tickets for a long ...",
                "  Its sad really they have had me receiving 16 daily tickets for a long time I'm level 31 yet I ask for help n they ignore it don't download its a waste you run out of tickets\tNeeds better payouts n power up shuffle option if a power up displays n u don't have it u can't pick one that u do have n u don't get the tickets your suppose to I'm level 31 n it gives me level 16 credits can't afford to play it sucks don't install "
            ],
            [
                "Keeps freezing!!",
                "  I used to love playing this game but lately it keeps freezing me out of the game!! It also doesnt let me use powerplays when ive just bought them!!! Very frustrating please fix bugs.... "
            ],
            [
                "Great but with a few glitches...",
                "  I love that this is straight forward bingo, however I have noticed at least one glitch... The remaining ball count will drop without any balls associated with it. "
            ],
            [
                "EXCELLENT",
                "  I REALLY ENJOY PLAYING THIS GAME! I'VE TRIED A FEW OTHERS THAT I FOUND TO BE TO GIMMICKY. THIS IS STRAIGHT FORWARD BINGO & I LOVE IT! WOULDN'T CHANGE A THING. I GOT MY NIECE HOOKED ON IT TOO! "
            ]
        ],
        "similar": [
            "com.fpinternet.ibingo",
            "com.ember.bingoSD",
            "air.com.alisacasino.bingo",
            "air.com.bitrhymes.bingo",
            "com.dragonplay.wildbingo",
            "com.gsn.android.casino",
            "air.com.sgn.bingo.google",
            "com.etermax.bingocrack.lite",
            "air.com.buffalo_studios.newflashbingo",
            "jp.gree.jband",
            "com.tinidream.bingorun",
            "com.productmadness.bingomadness",
            "com.redhotlabs.bingo",
            "com.targa.bingo",
            "com.apostek.apps.pocketbingo",
            "com.absolute.bingo"
        ]
    },
    {
        "appId": "com.selfawaregames.acecasino",
        "moreFromDev": "None",
        "reviews": [
            [
                "HTC LTE 4G",
                "  Great game but lots of bugs. Doesn't always payout correctly and tally incorrect often... But love the slot options and other games on one app. Worth playing just for fun... "
            ],
            [
                "Very nice casino after all",
                "  Bigfish has really restored my faith in them. They made an honest mistake and everyone went all to heck. I personally like bigfish and recommend them but chips are expensive and thats not anything I can afford. "
            ],
            [
                "I started this game about 6 weeks ago was great to play for first ...",
                "  I started this game about 6 weeks ago was great to play for first 2 weeks msde a lot of good wins. Then one day while playing Wicked Wins the game stsrted screwing up took about 5 million of my chips and then froze.  Gsme dissappeared for a couple of days. Now I have soent over $500.00 playing at any of the slots and have lost millions.  I am disappointed and disabled and this was my daily fun while I am bedridden.  Lets be fair and not so greegy for money I think Big Fish owes me. But I guess good luck with that.  Wuill be glad to retract and or rewrite review if they are fair.  Watch out for these greedy people.\tI installed game about 6 weeks ago and spent a little for chips. I did pretty good and then one day was playing Wicked Wins slot and game started screwing up and I lost 5 million when game froze. Game disappeared for a couple of days I still had a lot of chips but when it came back I have had to spend over $500.00 to play. I am disappointed and disabled and this was my enjoyment while I am stuck in bed. Are these people this greedy? I would be glad to rewrite a better review if Big Fish would do something. "
            ],
            [
                "Big loss in quality",
                "  When I first downloaded game it was a lot of fun, good wins, I was able to have plenty of play off of the daily bonus but game has lost a lot of quality, developers seem to have gotten greedy.  A shame really. Because it was a very fun game. Worth the download for a short period of time. Then uninstalled! Oh also the slots almost never payout properly. "
            ],
            [
                "Fix it ..hourly n daily bonuses is a joke to",
                "  Wanna talk about a losing streak?  Its impossible to be that bad. .all they want is more money. .vip bonuses should be much higher and daily and hourly bonuses are a joke. .FIX IT... enough is enough.. this used to be tons of fun "
            ],
            [
                "So annoyed",
                "  This app was working perfectly before I updated it, now it's just frustrating me. Please get it fixed!! "
            ]
        ],
        "similar": [
            "com.bigfishgames.android.nawpgoogfree",
            "com.bigfishgames.kbrooksgoogfull",
            "com.dragonplay.farmcasino",
            "com.bigfishgames.msshmgooglefree",
            "com.mw.slotsroyale",
            "com.mw.rouletteroyale",
            "com.dragonplay.slotcity",
            "com.bigfishgames.google.empress1free",
            "com.diwip.vslots",
            "com.bigfishgames.tfs2googfree",
            "com.gsn.android.casino",
            "com.bigfishgames.google.empress2free",
            "com.williamsinteractive.jackpotparty",
            "com.bigfishgames.jltolgooglefree",
            "air.com.bigfishgames.fairwaysolitaire2.google.full",
            "jp.gree.jackpot",
            "com.apostek.SlotMachine",
            "com.blueshellgames.luckyslots",
            "com.nurigames.casinolive",
            "com.dragonplay.liveholdempro",
            "com.bigfishgames.doriangraygoogfull",
            "com.bigfishgames.shivervhgooglefull",
            "air.com.playtika.slotomania",
            "com.bigfishgames.enigmatisgooglefull",
            "com.cervomedia.spw",
            "com.bigfishgames.ffarm1googfree",
            "air.com.slotgalaxy",
            "air.com.bigfishgames.fairwaysolitaire2.google",
            "com.bigfishgames.google.advchronfree",
            "com.bigfishgames.enigmatisgooglefree",
            "com.bigfishgames.jltolgooglefull",
            "com.ddi"
        ]
    },
    {
        "appId": "com.kamagames.pokerist",
        "moreFromDev": [
            "com.kamagames.roulettist"
        ],
        "reviews": [
            [
                "Pokerist Sucks!!!",
                "  I Can't see any of my friends now, they removed all my friends, can't send any messages, connection sucks!!! Thinking about Uninstallin if they're not gonna fix the problem..... "
            ],
            [
                "Was 5 stars til update",
                "  Since new update get cannot connect to pokerist server every time I log on,try to get on table or do pretty much anything. Have to hit retry several times and by the time it finally lets u in seat is gone.will delete if not fixed soon. "
            ],
            [
                "Fix",
                "  This game was kool when it first came out now  it keeps changing ur name back to guest and it does not split the right way on the kicker card they need too go back & refix everything & they dont reply even thow they say they have: the voice input does not work either "
            ],
            [
                "Something is fishy",
                "  Why don't all the cards be shown when the game is over? All caller cards should be shown...so there is no cheating...?? Just wondering what others had  to call.... in the REAL game all caller game cards are shown!! "
            ],
            [
                "Scorpio77",
                "  Right now I can't even see any pictures at all. This is ridiculous. First I'm constantly getting kicked off in middle of hands now this. Now it says No friends playing... can't see tables..... have to find someone to invite u just to play... that's even if the invites come thru...this app needs fixed... I'd love to give it 5 stars if all this gets fixed... don't bother email... they don't respond "
            ],
            [
                "pokerist",
                "  why you like to blocked account. i play many year and you block nu account today this is really make me angry.I do nothing wrong and you blocked. well I give one star for your system .thank "
            ]
        ],
        "similar": [
            "com.tinyco.poker",
            "com.geaxgame.pokerkingpro",
            "com.gameloft.android.ANMP.GloftTHM2.ML",
            "com.dragonplay.liveholdempro",
            "com.boyaa.fben",
            "com.ea.game.wsop_row",
            "com.pyrsoftware.pokerstars.net",
            "com.igg.pokerdeluxe",
            "com.appeak.poker",
            "com.plarium.pokershark",
            "air.com.youdagames.google.ww.gop2MobileFree",
            "poker.hands.order",
            "com.droidhen.game.poker",
            "com.idlegames.eldorado",
            "com.zynga.livepoker",
            "com.dragonplay.dragonplaypoker"
        ]
    },
    {
        "appId": "com.leftover.CoinDozer",
        "moreFromDev": [
            "com.leftover.CookieDozer"
        ],
        "reviews": [
            [
                "Samsung Galaxy s3",
                "  very fun game but every time there is an update I lose the level I'm on very aggravating and annoying I was on level 20 something and had to start back at 1.. On my last phone I was on level 119 and had to start back at 1, when I got this phone..next time I have to start over with an update I will uninstall and not reinstall on my phone...I used to recommend this game but not anymore... "
            ],
            [
                "Needs more puzzles",
                "  Please put more carnival puzzles in, I've got more coins than I could shake a stick at and nothing more to collect, I was addicted to this game right up until the carnival puzzles finished and now it's not played, please update it with more puzzles!!!!! "
            ],
            [
                "Fantastic addictive",
                "  Would defo have given this 5 stars if not for all the adds it can be annoying but apart from that this game is brilliant and so much fun defo play it you won't put it down "
            ],
            [
                "Amazing",
                "  This game is amazing nothing wrong about it what so ever apart from when my coins hit the fire now that is when I get annoyed but overall it is an cointastic game. "
            ],
            [
                "Needs more puzzles",
                "  Started out addicted to the game and now that I am over 65, 000 coins with no puzzles to complete or new prizes to collect I'm getting bored. Was hoping the update would be more exciting but it was nothing more than a few color and graphic changes...woohoo :/ "
            ],
            [
                "Nice, simple, addictive!",
                "  Good game to play when you're bored and easy to get free coins too though the free coins option. The coin regen is good to avoid you getting too addicted! "
            ]
        ],
        "similar": [
            "com.aemobile.games.coinmania",
            "com.gamecircus.CookieDozerThanksgiving",
            "com.gamecircus.PrizeClawSeasons",
            "com.gamecircus.songz",
            "com.gamecircus.CoinDozerHalloween",
            "com.mw.rouletteroyale",
            "com.kingdom.coins",
            "com.gamecircus.slotscircus",
            "com.nubee.coinpirates",
            "air.com.slotgalaxy",
            "com.gamecircus.HorseFrenzy",
            "com.gamecircus.CoinDozerSeasons",
            "com.grendell.broodhollow",
            "com.droidhen.game.poker",
            "com.mobilityware.spider",
            "com.apostek.SlotMachine",
            "com.dragonplay.slotcity",
            "com.dragonplay.liveholdempro",
            "com.mobilityware.solitaire",
            "com.zynga.livepoker",
            "com.gameloft.android.ANMP.GloftUOHM",
            "com.gamecircus.PrizeClaw",
            "com.kmagic.solitaire",
            "com.gamecircus.Paplinko",
            "com.gamecircus.moviez",
            "com.droidhen.game.coin",
            "com.gamecircus.CoinDozerWorld",
            "com.nubee.coinzombies",
            "com.gamecircus.FrogToss"
        ]
    },
    {
        "appId": "jp.gree.jackpot",
        "moreFromDev": [
            "jp.gree.dragonrealms",
            "jp.gree.jband",
            "jp.gree.modernwar"
        ],
        "reviews": [
            [
                "Feels real",
                "  It feels like the real thing. Always looking money then it brings me back with a large win "
            ],
            [
                "The best slot game by far",
                "  The most realistic slot game, Super fun and addicting use my code to start and get lots of extra coins its  121-739-482. Plays nice and smooth. Its Just like playing the real thing Comes out with new bonus games all the time  too keeps it fresh gotta play it!! Especially smooth since the update it plays great. "
            ],
            [
                "Fixes Needed",
                "  I love the game but I can't play 3/4 of the time. I keep getting \"We are sorry we could not connect to the server.\" When they offer Triple XP or Bonuses I can never play! "
            ],
            [
                "Fun but heavy footprint",
                "  Occupies more than 36mb of the internal memory, seems to be getting bigger with every progress. "
            ],
            [
                "Cool ~",
                "  Is an not boring jackpot that u keep continue chase your point over. Let's try.. "
            ],
            [
                "Love",
                "  Great game "
            ]
        ],
        "similar": [
            "com.dragonplay.slotcity",
            "com.apostek.SlotMachine",
            "com.magmamobile.game.Slots",
            "com.gamelion.slots",
            "com.diwip.vslots",
            "com.cervomedia.spw",
            "air.com.slotgalaxy",
            "wheel.slots.leetcom.com",
            "com.kakapo.freeslots",
            "com.zentertain.slotsoriental",
            "com.casinogame.slots",
            "gree.gii.mlbfulldeck",
            "com.mw.slotsroyale",
            "com.iugome.lilknights",
            "air.com.playtika.slotomania",
            "com.williamsinteractive.jackpotparty",
            "com.ddi",
            "com.blueshellgames.luckyslots",
            "com.funzio.crimecity"
        ]
    },
    {
        "appId": "air.com.bitrhymes.bingo",
        "moreFromDev": [
            "air.com.buffalo_studios.newflashbingo",
            "air.com.alisacasino.bingo",
            "air.com.sgn.bingo.google"
        ],
        "reviews": [
            [
                "Will give 5 when I'm reimbursed",
                "  There's numbers called on the board that I can't daub. This has happened every game. I've spent $ on balls only to have them called without getting to be marked off my cards. I would like this fixed before I'm so disappointed I uninstall bingo bash "
            ],
            [
                "Bingo",
                "  Like the game a lot. Sometimes it kicks me off and then I loose everything I had when playing. Other then that its a great game "
            ],
            [
                "Best Bingo Game Yet",
                "  So far I've loaded about a dozen bingo games or so & uninstalled at least 8 of them & this is the best to date! Only reason I'm not giving a 5 star is because it is getting really difficult to level up because the chance of winning has been reduced recently by reducing the quantity of bingos per game. It used to be you had a 50% chance of winning but now it is more like 30%. Regardless it is still the best to date! "
            ],
            [
                "Get rid of the turkey run game and you'll be fine",
                "  The Turkey Run is the worst game I've ever played on this I have spent over 100 Bingo chips and not won a single game. when the game freezes up I lose all my chips. Otherwise this is best bingo game I played "
            ],
            [
                "Galaxy s3",
                "  I REALLY LOVE THIS GAME..... BUT THE BIG DOWN FALL IS THAT YOU DONT GET ENOUGH B CHIPS TO PLAY SO THE LIFE OF THE GAME IS EXTREMELY SHORT UNLESS YOU WANT TO PAY FOR MORE CHIPS TO CONTINUE.  ONCE YOUR CHIPS ARE GONE, THATS IT, ITS NO LONGER A FREE GAME!!! "
            ],
            [
                "Really like the game. Have had some issues with trading in gems. It takes ...",
                "  Really like the game. Have had some issues with trading in gems. It takes them in trade, but, I didn't get the rewards I traded for...with no way to recoup the gems or the trade rewards! Wasn't happy with that at all! Wish they would give more free chips, gems or something. Enjoy playing the game, aside from the little glitches with trade ins, etc.\tDaily rewards should be larger & should be able to play the tournament on the phone version! "
            ]
        ],
        "similar": [
            "com.dragonplay.wildbingo",
            "com.ember.bingoSD",
            "com.gsn.android.casino",
            "com.kakapo.bingo",
            "com.etermax.bingocrack.lite",
            "com.fpinternet.ibingo",
            "jp.gree.jband",
            "com.tinidream.bingorun",
            "com.productmadness.bingomadness",
            "com.redhotlabs.bingo",
            "com.targa.bingo",
            "com.apostek.apps.pocketbingo",
            "com.absolute.bingo"
        ]
    },
    {
        "appId": "com.gsn.android.casino",
        "moreFromDev": [
            "com.gsn.android.tripeaks",
            "com.gsn.android.getawaygames"
        ],
        "reviews": [
            [
                "Not happy!",
                "  Up until about 5 minutes ago I would have given 5 stars. I play every single day and earlier today had over 130, 000 tokens. Now I have 1188! If I don't get my tokens backs I'll be deleting the app. "
            ],
            [
                "Not sure",
                "  I was given 150.000 points to try bingo and lost it all . I didn't get a double bingo once so not too good every time I come off the games it keeps taking points of me the other day it took over 200,000 and now I have none it needs sorting "
            ],
            [
                "So many replies and so many adited but thats all you doI know you ...",
                "  So many replies  and so many adited but thats all you doI know you have answered me before that does not take care of this problem it wan't open up at all I have uninstaled and reinstalled but nothing please answer .\tNow it wont even open any more what is going on? I guess you all wo't even answer any more I will delete all it is doing taking up room , because I can't play I would very much like to givr this game the highest rating possible but I need to get my daily token since I have downloaded again it shows that I get several thousand each day, but they are never added to my balance when you correct this I will give you the highest score possible And let me send this , good grief have a SEND button "
            ],
            [
                "Extremely Impressed",
                "  I've been playing GSN Casino for over a year now, and I never grow tired of it. But what really impresses me is their support staff. I've been having minor problems so I wrote to their players support staff looking for help and got a prompt reply with multiple questions about the problems. It was obvious they were genuinely trying to help me. Although my problem hasn't been fixed yet, there's no doubt in my mind they're still working on it. Very very impressed by the game AND the staff. Keep it up :) "
            ],
            [
                "Good game but could use alot of improvements",
                "  The payouts are terrible...when you bet 750 the highest you might win is 200 but usually it's only 50 and below. I play it mainly for the bingo game and I've been playing for 8 months and I can count how many bingos I've had on one hand.... You started with a great design, but now the bingo boards are really small and I can't even use my stylus to press the spots. Make it so my stylus can be used at least in the video bingo since the boards have gotten even smaller! "
            ],
            [
                "LOVE IT!",
                "  I just started this app today & I just can't stop playing. I especially LOVE THE DEAL OR NO DEAL SLOTS. If you don't got this app, what are you waiting for, get it & I promise you will be hook also. Have fun. "
            ]
        ],
        "similar": [
            "com.dragonplay.slotcity",
            "com.apostek.SlotMachine",
            "com.kakapo.bingo",
            "com.cervomedia.spw",
            "air.com.slotgalaxy",
            "air.com.bitrhymes.bingo",
            "com.dragonplay.wildbingo",
            "com.mw.slotsroyale",
            "air.com.buffalo_studios.newflashbingo",
            "air.com.playtika.slotomania",
            "jp.gree.jband",
            "com.tinidream.bingorun",
            "com.ddi",
            "air.com.gsn.android.lingo",
            "com.redhotlabs.bingo",
            "jp.gree.jackpot",
            "com.williamsinteractive.jackpotparty"
        ]
    },
    {
        "appId": "com.cervomedia.spw",
        "moreFromDev": [
            "com.cervomedia.RiotRingsHD"
        ],
        "reviews": [
            [
                "Only for gold",
                "  I'm only downloading this because I earn gold "
            ],
            [
                "honestly download it you will love it",
                "  love this game "
            ],
            [
                "Love it",
                "  It would be great if you won more than you lost. "
            ],
            [
                "Brilliant!",
                "  Best slots I have downloaded and played! "
            ],
            [
                "Okay",
                "  Itz alright "
            ],
            [
                "LACKING",
                "  This game is really fun, but it is lacking in the area of synchronizing my phone game to my tablet game. Both are Android operated. I would give 100 stars if both hands would merge their points and play level. Plz help. Cause i refuse to buy extra coins twice "
            ]
        ],
        "similar": [
            "com.dragonplay.slotcity",
            "com.apostek.SlotMachine",
            "com.hanamobiles.tumblingslots",
            "com.magmamobile.game.Slots",
            "com.gamelion.slots",
            "com.applab.pyra3",
            "air.com.slotgalaxy",
            "wheel.slots.leetcom.com",
            "com.kakapo.freeslots",
            "com.casinogame.slots",
            "com.mw.slotsroyale",
            "air.com.playtika.slotomania",
            "com.williamsinteractive.jackpotparty",
            "com.ddi",
            "com.blueshellgames.luckyslots",
            "jp.gree.jackpot"
        ]
    },
    {
        "appId": "com.gameloft.android.ANMP.GloftUOHM",
        "moreFromDev": [
            "com.gameloft.android.ANMP.GloftRAHM",
            "com.gameloft.android.ANMP.GloftIMHM",
            "com.gameloft.android.ANMP.GloftA7HM",
            "com.gameloft.android.ANMP.GloftMTHM",
            "com.gameloft.android.ANMP.GloftIAHM",
            "com.gameloft.android.ANMP.GloftTBHM",
            "com.gameloft.android.ANMP.GloftBTHM",
            "com.gameloft.android.ANMP.GloftGTFM",
            "com.gameloft.android.ANMP.GloftB2HM",
            "com.gameloft.android.ANMP.GloftPEHM",
            "com.gameloft.android.ANMP.GloftGAHM",
            "com.gameloft.android.ANMP.GloftEPHM",
            "com.gameloft.android.ANMP.GloftPOHM",
            "com.gameloft.android.ANMP.GloftDMHM",
            "com.gameloft.android.ANMP.GloftTHM2.ML",
            "com.gameloft.android.ANMP.GloftTRHM",
            "com.gameloft.android.ANMP.GloftGF2F",
            "com.gameloft.android.ANMP.GloftJDHM"
        ],
        "reviews": [
            [
                "So unfair..",
                "  I have been playing this for many days but never got chance to throw first am always last and sometimes button does not work for uno. "
            ],
            [
                "Take tokens",
                "  Every time i push play it take my tokens and dont even let me play it goes back to the main menu. RIP OFF! "
            ],
            [
                "Lots of fun! No real  chat",
                "  Easy to play! Play with fb friends or random players I want real chat not dumb chat messages!! 5 stars if u add real chat "
            ],
            [
                "A little disappointed",
                "  I paid for the original app which no longer works due to this upgrade. This one requests more money for tokens just to play or chat. I love Uno and the capability to see others pix is cool. However, its  a little disheartening that I cant get a refund or credit for the original app to apply to this one or any other game of my choice. I would like to see a flat rate. Who wants to pay to chat in game? That's just janky penny pinching greediness. Otherwise the game's an ok way to pass time. "
            ],
            [
                "Time killer...",
                "  Great game to play with the kids. You never get to old to play UNO. "
            ],
            [
                "Hmm",
                "  It's a good game, but you need to fix some things. I'm tired of being booted from games, claiming I don't have a connection when I'm on solid wifi that's not dropping out is getting irritating. You put out this new update and I don't get nearly the amount of silver or gold in gifts, which makes it nearly impossible to keep your streak going. Also, there must be a hack, considering the dude who won the tournament last week was only a level 2 with over 10 millions points. Please fix these issues. "
            ]
        ],
        "similar": [
            "com.dragonplay.slotcity",
            "com.apostek.SlotMachine",
            "com.kmagic.solitaire",
            "com.leftover.CoinDozer",
            "com.dragonplay.liveholdempro",
            "com.mobilityware.solitaire",
            "com.constellasys.crazyuno",
            "com.cardgame.durak",
            "rus.Hapman.AngryOrcsAttack",
            "com.magmamobile.game.SpiderSolitaire",
            "com.zynga.livepoker",
            "com.mobilityware.spider",
            "com.droidhen.game.poker",
            "com.softick.android.solitaire.klondike"
        ]
    },
    {
        "appId": "com.kakapo.slotsfarm",
        "moreFromDev": [
            "com.kakapo.slots.australian",
            "com.kakapo.slotsfb",
            "com.kakapo.slots.digisy",
            "com.kakapo.freeslots"
        ],
        "reviews": [
            [
                "Worse than a Real Casino",
                "  Beware...Do Not Download, Spent 100.00 dollars in less than hour and credit card was double billed, this is a scam of an app!!! "
            ],
            [
                "I'm not so happy every time I play a extra points game it says ...",
                "  I'm not so happy every time I play a extra points game it says claim I. Press the button and nothing ever happens. Ihave missed out on approx 35,000 coins.  At first I. Thought i. Messed up and now i know. Its not me its your game.   Deserved coins would be nice and please fix the problemd "
            ],
            [
                "It's ok.",
                "  Great game and very addicting. However you often go long periods of spins without prizes and lose a lot of money. I now have 0 coins and can't play until I get my next bonus which will only be 300 coins which is practically nothing. "
            ],
            [
                "Love but has glitches",
                "  I love this game because you win fairly often and you don't run out of mo et as fast. Also love the bonus hours. However there are a few minor glitches...game not loading, slits spin for a ling time, etc. "
            ],
            [
                "Lousy..cheap",
                "  If I could give half star I would for the colorfulness...free spins are lousy payouts are lousy..bonuses are lousy...and like all the rest they only give you a few coins to play so it doesn't take long to lose betting minimal...just so they can make bucks off you buy trying to make you buy coins to be able to play...when you increase all the above mentioned and make the game fun ..I might consider buying coins..but take take what little you give ..you get nothing from this person. There r better slot games "
            ],
            [
                "This is a very fair game.LETS you take your chances",
                "  Nice that it's not easy to beat. Good challenges. Not repetative at all. And not predetermined. Your tactic is what matters. Cuts out every now and then. But it keeps me interested. PLAY IT! I REALLY ENJOY IT.WORTH HAVING IN YOUR COLLECTION. "
            ]
        ],
        "similar": [
            "com.dragonplay.slotcity",
            "com.apostek.SlotMachine",
            "com.magmamobile.game.Slots",
            "com.diwip.vslots",
            "com.cervomedia.spw",
            "air.com.slotgalaxy",
            "wheel.slots.leetcom.com",
            "com.dragonplay.farmcasino",
            "com.ddi",
            "com.zentertain.slotsoriental",
            "com.pharaoh.slots.free",
            "com.mw.slotsroyale",
            "air.com.playtika.slotomania",
            "com.blueshellgames.luckyslots",
            "jp.gree.jackpot",
            "com.zentertain.slotssagaclient"
        ]
    },
    {
        "appId": "air.com.buffalo_studios.newflashbingo",
        "moreFromDev": [
            "air.com.bitrhymes.bingo",
            "air.com.alisacasino.bingo",
            "air.com.sgn.bingo.google"
        ],
        "reviews": [
            [
                "Poor",
                "  Look I like this game but toooooo many updates smh stop crashing so darn much I'm tired of it "
            ],
            [
                "I'm slightly addicted to this app, so I would LOVE it if didn't take ...",
                "  I'm slightly addicted to this app, so I would LOVE it if didn't take so long to collect your daily bonus! "
            ],
            [
                "Game never letsnyou get your last calls. Takes away bingos",
                "  Game freezes way to much and you dont get refunds of lost credit. Please allow the game have you to be able to daub the last numbers when it says game over. I feel cheated. Y do I need double pieces "
            ],
            [
                "Great game.....",
                "  It was listed as awesome but now when I log onto my facebook account, it freezes which its never done before. It wont let me play the free tournament games either. But, if I log on with my guest account, I can play the tourney. What gives? Also, the payouts need to be bigger, overall, great game. Still keep playing tho. "
            ],
            [
                "Love it! But, it still freezes.",
                "  Except for times when it freezes, and remains frozen until my phone shuts it down by shutting off, (hence the 4 star rating), I love it! I hope I don't get so frustrated until I have to uninstall it?! "
            ],
            [
                "Used to be good",
                "  Near as I can tell you don't get anything unless your putting out money as Elite member and Elite members complain of missing credits, items they win not showing up. When you spend 20 levels and almost 500 tokens trying to get one item to finish a collection its no longer a fun time waster. It's just a waste of time. To hard to win anything. I play every night become bed at least an hour and haven't had a bingo in over two weeks. DO NOT DOWNLOAD THIS GAME UNLESS YOU WANT TO BE FRUSTRATED. "
            ]
        ],
        "similar": [
            "com.dragonplay.wildbingo",
            "com.ember.bingoSD",
            "com.gsn.android.casino",
            "com.kakapo.bingo",
            "com.etermax.bingocrack.lite",
            "com.fpinternet.ibingo",
            "jp.gree.jband",
            "com.tinidream.bingorun",
            "com.productmadness.bingomadness",
            "com.redhotlabs.bingo",
            "com.targa.bingo",
            "com.apostek.apps.pocketbingo",
            "com.absolute.bingo"
        ]
    },
    {
        "appId": "jp.gree.jband",
        "moreFromDev": [
            "jp.gree.dragonrealms",
            "jp.gree.jackpot",
            "jp.gree.modernwar"
        ],
        "reviews": [
            [
                "A couple of things that could be fixed.",
                "  Okay just wish you got more chips. You don't win often enough to sustain them for more than a few games. I also would like to be able to send and receive gifts. Isn't that the whole reason games let you sync with social media?  Also have emailed the developer a couple of times with no response back. Fix these issues and you will get 5 â˜…. "
            ],
            [
                "LOSING RESPECT 4 THE DEVELOPERS",
                "  THE GAMES ARE FUN I HAVE NO COMPLAINTS ABOUT THEM, THE PAYS SUCK BUT MY ISSUE IS ABOUT ALL THE REAL MONEY I'VE SPENT ON EXTRA CHIPS AND COINS  (I HAVE THE APP ON BOTH OF MY PHONES ) AND WHEN THERE HAVE BEEN GLITCHES SUCH AS LIGHTER  DAUBS  THAT SHOULD BE COUNTED BECAUSE THAT NUMBER WAS CALLED,  .... THE BOTTOM LINE IS THAT I'VE CONTACTED THESE FOLKS SEVERAL X'S AND HAVE NOT BEEN REIMBURSED NOR COMPENSATED 4 MY TROUBLES.  THEY DO BAD BIZ AND THAT'S NOT A WAY 2 KEEP PATRONS ESPECIALLY 1'S BUYING EXTRA ITEMS "
            ],
            [
                "Enjoyable with some quirks.",
                "  Fun game, but I would like it to allow you to mark the board with the last numbers called even if last bingo is called. Should still allow number if it's on your card. "
            ],
            [
                "Pretty fun, locks up",
                "  Fun game.  Don't even mind running out of chips. But it stinks when the game locks up almost every time I play. :( "
            ],
            [
                "Good graphics, bad play",
                "  First of all congrats to the developers for the excellent graphics (on most cards) and explosive responsiveness when playing however a few downers since i started playing 6+ months ago - boosts go missing if you don't use them when they are ready so you have to waste a really good boost like instant bingo when only 1 bingo left, also really difficult to complete collections to win more game play, also have had same issue as other reviewers where occasionally numbers are called but can't be daubed. "
            ],
            [
                "Terrible.",
                "  Since the last update I've been having a issue when trying to go into a certain room I get a error message then all of a sudden I get that same message when I tried to open game so I uninstalled it then reinstalled it and all the rooms are giving me the same error message I'm gonna have to uninstall and find a new game after I try to spend the chips I purchased (yes U.S. dollars.) Was a great game til now. If issue is fixed before I uninstall then I'll continue playing and give a better rating. "
            ]
        ],
        "similar": [
            "com.iugome.lilknights",
            "com.dragonplay.wildbingo",
            "com.c88.bingo.cartoon",
            "com.ember.bingoSD",
            "com.targa.bingo",
            "air.com.bitrhymes.bingo",
            "com.kakapo.bingo",
            "com.gsn.android.casino",
            "air.com.sgn.bingo.google",
            "gree.gii.mlbfulldeck",
            "com.etermax.bingocrack.lite",
            "air.com.buffalo_studios.newflashbingo",
            "com.fpinternet.ibingo",
            "com.tinidream.bingorun",
            "com.funzio.crimecity",
            "com.productmadness.bingomadness",
            "com.redhotlabs.bingo",
            "air.com.alisacasino.bingo",
            "com.apostek.apps.pocketbingo"
        ]
    },
    {
        "appId": "com.ddi",
        "moreFromDev": "None",
        "reviews": [
            [
                "Dont install this",
                "  This is not really free as much as I love these slots they shut down and disconnet from server about every 5 minutes loose money minimal bonuses and if they disconnect you loose what u bet. ...  and do NOT give any free credits.   They don't tell u they charge for credut "
            ],
            [
                "Whats going on?",
                "  No more daily bonuses.. getting kicked out all the time.. slow to get into different games... thanks for the update..NOT!! "
            ],
            [
                "This sucks",
                "  I can't even get it to load i had it saying loading for 20 mins never did and that is after 4 downloads and uninstalls cause it wouldn't load and now i see u have taken bonuses away in the process?!?  Forget it so not worth my time!! "
            ],
            [
                "Whats goin on!!!",
                "  Not very good. Use to run fine on my phone now I keep getting disconnected all the time if the app ran with no problems id definitely give it a 5 star plz sort it out "
            ],
            [
                "Contacted DDC about the phone app never loading they placed the blame on my ...",
                "  Contacted DDC about the phone app never loading they placed the blame on my carrier game only shows loading will not allow me to sign in with my FB account poor poor customer service this app is junk\tWill not load waited for about 45 mins still loading worthless app disconnects from wifi lame "
            ],
            [
                "Dropped like a rock",
                "  Good games...but you can't play them for more than a few spins - even when it's your own money. Frequent crashed...missed bonuses..what's happened? Used to be fun.... "
            ]
        ],
        "similar": [
            "com.dragonplay.slotcity",
            "com.apostek.SlotMachine",
            "com.magmamobile.game.Slots",
            "com.gamelion.slots",
            "com.cervomedia.spw",
            "air.com.slotgalaxy",
            "wheel.slots.leetcom.com",
            "com.kakapo.freeslots",
            "com.casinogame.slots",
            "air.com.yazino.android.slots",
            "com.mw.slotsroyale",
            "air.com.playtika.slotomania",
            "com.williamsinteractive.jackpotparty",
            "com.blueshellgames.luckyslots",
            "jp.gree.jackpot",
            "com.zentertain.slotsoriental"
        ]
    },
    {
        "appId": "air.com.playtika.slotomania",
        "moreFromDev": [
            "air.com.slotgalaxy"
        ],
        "reviews": [
            [
                "Fix please!",
                "  Very addictive game! Ive been playing for over a year but the new update sucks. It want hit, loading to slow, sometimes want load at all and the wheel just keeps spinning. "
            ],
            [
                "Slotomania",
                "  Really like the game. But i cant believe that you have to go 20 levels, and only get $1000.00 more on our 4hr bonus. Because i it takes alot of time and money to get threw 1-level.sometimes. "
            ],
            [
                "CHEATERS",
                "  It's been days since I built anything up they are so tight! Also its screws you out of all your spins it goes from 3 to 0 and it doesn't count all your coins. Next people watch your bar sometimes it adds the coins and sometimes it doesn't taking you longer to get through a level. It's bullshit. IF YOU THINK THIS WILL MAKE ME BUY COINS YOUR WRONG I WILL NEVER BUY FAKE COINS CHEATERS CHEATERS CHEATERS "
            ],
            [
                "Good game gone bad",
                "  I've been playing this game for a long time but I gotta say I'm ticked off now. First of all, $15 to unlock a game? Are y'all for real? Second, I'm on lvl 253 & am still bronze. Seriously? I just leveled up & only got 2 pts toward silver. I'm not buying coins, I have 9.5 mil coins. Playtika, y'all are on notice. Cut the foolishness, get rid of the $15 game, loosen the slots & get a better reward system. 200+ lvls should be silver or better. Get a clue. "
            ],
            [
                "Great game",
                "  Pretty kool. Starts out slow but picks up as you make bigger bets. "
            ],
            [
                "Absolute p!$$-take",
                "  Ridiculously low payouts, non existent bonuses and now $15 for one game? YOU wanted the Love Boat license not us, so the cost of that should be absorbed by YOU, NOT the people who pay your wages. You're all nothing more than thieving scum. "
            ]
        ],
        "similar": [
            "com.dragonplay.slotcity",
            "com.apostek.SlotMachine",
            "com.magmamobile.game.Slots",
            "com.gamelion.slots",
            "com.cervomedia.spw",
            "com.zentertain.slotssagaclient",
            "wheel.slots.leetcom.com",
            "com.kakapo.freeslots",
            "com.casinogame.slots",
            "net.exobyte.cherrychaser",
            "com.playtika.wsop.gp",
            "com.mw.slotsroyale",
            "com.williamsinteractive.jackpotparty",
            "com.ddi",
            "com.playtika.caesarscasino",
            "com.blueshellgames.luckyslots",
            "jp.gree.jackpot"
        ]
    },
    {
        "appId": "com.pch.cashslots",
        "moreFromDev": [
            "com.pch.vip"
        ],
        "reviews": [
            [
                "I will win pch one day",
                "  I enter all pch things i won a diamond ring when i was 12 they just sent it to me. And i can feel it one day i will win. "
            ],
            [
                "Does not work!",
                "  I installed this app on my Galaxy Note 3 and when I click the link to get more coins all it does is restart the app. There is no way to play the game if you can not get more chips. I rate this as very poor, don't waste your time.  :( "
            ],
            [
                "I havint used this for very long but its totally exciting. I got a ...",
                "  I havint used this for very long but its totally exciting. I got a couple free things already just for signning up c:\tYeahhh lol "
            ],
            [
                "I love this!",
                "  I love this! I thought it was a joke until I won money, and I just used it so its no joke!! "
            ],
            [
                "Problematic",
                "  I have completed so many offers to get chips that I have not recieved. They owe me over 500,000 chips now. No response from tapjoy customer service other than form letter saying they are slow in resolving issues. "
            ],
            [
                "Ok if you want to pass time...",
                "  I have completed many \"free chip\" offers and rarely get them. It is an alright game if you want to pass time. I have spent over 1000 chips and have only won 140 chips. It is not much for prize winning... "
            ]
        ],
        "similar": [
            "com.dragonplay.slotcity",
            "com.apostek.SlotMachine",
            "pch.apps.pchsweeps",
            "com.gamelion.slots",
            "com.apostek.SlotMachine.paid",
            "com.feelingtouch.slotgame2",
            "wheel.slots.leetcom.com",
            "com.kakapo.freeslots",
            "com.pharaoh.slots.free",
            "com.mw.slotsroyale",
            "air.com.playtika.slotomania",
            "com.williamsinteractive.jackpotparty",
            "com.ddi",
            "com.pacificinteractive.HouseOfFun",
            "com.blueshellgames.luckyslots",
            "jp.gree.jackpot",
            "com.worldofslots"
        ]
    },
    {
        "appId": "com.mobilityware.spider",
        "moreFromDev": [
            "com.mobilityware.freecell",
            "com.mobilityware.solitaire"
        ],
        "reviews": [
            [
                "Love love it, tons of fun.",
                "  Great fun. I can go early to my appointments and play. Being quiet for others. Love playing this. "
            ],
            [
                "Awesome!",
                "  I love this game, it's custom options are great, the gameplay is smooth and responsive, it's simple to use, and easy to see. A great way to relax and pass time, or just to flex the old grey matter! Minimal ads, and no need to buy into anything either! 5***** for sure! :) "
            ],
            [
                "Simple yet enjoyable",
                "  This game is one of my favorites and most of my spare time goes to playing it. The only problem is annoying ads before starting any game, which I'm sure it keeps the game free, but it could be better that people see ads on menus or when game is paused. "
            ],
            [
                "Addicted. Hooked. Like Spider even more by android than pc. Best spider ap ever! ...",
                "  Addicted. Hooked. Like Spider even more by android than pc. Best spider ap ever! Their free cell is good too! "
            ],
            [
                "I like it",
                "  Not the best version I've played but I really like it. It has a lot of options to customize rules to the way I like to play. The ads that pop up are annoying, but I'm glad they only seem to happen at the beginning of each game so they don't interrupt me once I get started. Overall, I really like this version. "
            ],
            [
                ".",
                "  As a Spider solitaire addict, I love this version,I only wish this company would write a PC version Then I would really be in heaven "
            ]
        ],
        "similar": [
            "com.kmagic.solitaire",
            "com.voldaran.puzzle.graBLOX",
            "com.softick.android.solitaire.klondike",
            "com.mediafill.spider.solitaire",
            "com.brainium.solitaire",
            "com.brainium.solitairefree",
            "com.hapogames.solitaire",
            "com.magmamobile.game.Solitaire",
            "com.anoshenko.android.solitaires",
            "com.tesseractmobile.solitairefreepack",
            "com.brainium.spiderfree",
            "com.gameloft.android.ANMP.GloftUOHM",
            "com.magmamobile.game.SpiderSolitaire",
            "com.aemobile.Spider",
            "net.jeu.solitaire",
            "com.sg.js.Spider",
            "com.gosub60.solfree2"
        ]
    },
    {
        "appId": "com.zynga.livepoker",
        "moreFromDev": [
            "com.zynga.words",
            "com.zynga.draw2.googleplay.free",
            "com.zynga.gswf",
            "com.zynga.scramble.paid",
            "com.zynga.slots.free",
            "com.zynga.warofthefallen",
            "com.zynga.scramble",
            "com.zynga.digitallegends.respawnables",
            "com.zynga.zjayakashi",
            "com.zynga.fatpebble.clayjam",
            "com.zynga.castlevillelegends",
            "com.zynga.matching",
            "com.zynga.hanging",
            "com.zynga.zrush",
            "com.zynga.bubblesafari.ent"
        ],
        "reviews": [
            [
                "App needs fixing!",
                "  -Everytime I open the app I have to sign in with facebook. I should be permanently signed in to facebook on the app. -The app says I don't have an active connection when my connection is perfectly fine. -Sometimes the app 'loses connection' when it is in a poker game and makes me lose my winnings. Please fix zynga! You used to be good! "
            ],
            [
                "Mega bonus - bogus",
                "  I love playing Zynga Poker. It's a lot of fun.  The daily bonus is a great way to keep users coming back. I'm not sure it's awarding me properly.  I got 2 single bars and a heart. My payout was about 13k, but the pay scale has that payout at a much higher dollar amount.  What am I missing, other than some major coin?  Pay table days double bar - club - double bar is 100k, I only got 20k! Why is that? "
            ],
            [
                "Good but",
                "  Eats up your battery wow got to play it on charge its so fixed its unreal play it and c for yourself "
            ],
            [
                "Unrealistic cards",
                "  Winners are set, not random. Fix the cards to not make straights every time on board. Then it can be called  poker not finish the straight. "
            ],
            [
                "Spam",
                "  Stupidly slow even with full fine working WiFi conection other users can't even play the game spams my phone 24/7 with notification upon uninstalling it re installs its self wtf "
            ],
            [
                "Buggy to unusable",
                "  Initially upon download it was pretty buggy. Would glitch so that I couldn't see cards or buttons on occasion. New update rendered the game completely unusable. Crashed my whole phone first try. Then just crashes the app repeatedly even after force stop. Also, I can use this in g+ on PC but can't on phone? "
            ]
        ],
        "similar": [
            "com.tinyco.poker",
            "com.geaxgame.pokerkingpro",
            "com.dragonplay.liveholdempro",
            "com.mobilityware.solitaire",
            "com.boyaa.fben",
            "com.Phosphor.Horn.Paid",
            "com.pyrsoftware.pokerstars.net",
            "com.igg.pokerdeluxe",
            "com.appeak.poker",
            "com.plarium.pokershark",
            "air.com.youdagames.google.ww.gop2MobileFree",
            "com.kamagames.pokerist",
            "poker.hands.order",
            "com.droidhen.game.poker",
            "com.gameloft.android.ANMP.GloftUOHM",
            "com.ea.game.wsop_row",
            "com.dragonplay.dragonplaypoker"
        ]
    },
    {
        "appId": "com.pacificinteractive.HouseOfFun",
        "moreFromDev": "None",
        "reviews": [
            [
                "Getring better!!!!",
                "  Yeah bugs fixed..I can download any slot now :-)  even though they are SLOW AS MOLASSES downloading!  Keep fixing & weeding out the Issues...u r doing great job! Pretty soon it'll be a 5 star game!  The payouts still stink....but hey its pretend money so not much to complain about there :-) "
            ],
            [
                "Slack Payouts",
                "  21/11/13 Not sure when I wrote the comment below but nothing has changed.  I did better with my free spins than with just playing. Ill come back every now and then to see if you guys might ever become one of my favorites!   Im glad that you're now on Android but I find that your payouts aren't very good.  To be able to have anything to play with I just have to collect bonus through out the day only to lose it in the evening. "
            ],
            [
                "Exciting disappointment...",
                "  Great graphics, fun, challenging bonuses but the higher you level the unfriendlier the payouts. Kind of a bait and switch to get you to purchase points I'm guessing. To bad because there's fun to be had but at what price? Loosen it up people it deserves 5 stars then. "
            ],
            [
                "FEEL LIKE A LOSER",
                "  You can win more money at an actual casino.  If you want an app that makes you feel like a BIG LOSER, then by all means download this one!  It sucks up your coins fast, but then offers you awesome deals to buy more coins...what a joke!  It takes about 100 spins to hit a bonus round and then you barely win anything!  Waste of time and no fun!!! "
            ],
            [
                "Terrible",
                "  Had liked to play, but as of today the bet and spin buttons don't show up then it just shuts off "
            ],
            [
                "This game has great graphics and is slot of fun. It is verry compatible ...",
                "  This game has great graphics and is slot of fun. It is verry compatible on gallaxy 4.\tI love the Zuess 2 game. I recomenf this app,. its great! "
            ]
        ],
        "similar": [
            "com.dragonplay.slotcity",
            "com.blueshellgames.luckyslots",
            "com.magmamobile.game.Slots",
            "com.gamelion.slots",
            "com.cervomedia.spw",
            "air.com.slotgalaxy",
            "com.hapogames.SlotsGo",
            "wheel.slots.leetcom.com",
            "air.com.yazino.android.slots",
            "com.apostek.SlotMachine",
            "com.mw.slotsroyale",
            "air.com.playtika.slotomania",
            "com.williamsinteractive.jackpotparty",
            "com.ddi",
            "com.kakapo.freeslots",
            "jp.gree.jackpot"
        ]
    },
    {
        "appId": "com.williamsinteractive.jackpotparty",
        "moreFromDev": "None",
        "reviews": [
            [
                "Cheat!! & Sucks big time",
                "  Try clicking on the SAME box everytime for big bonus (every 4 hours there's one bonus, 5th time there's a big bonus) you will get the 3x bonus many times, which means it's not even random, all are 3x, you probably get a 6x or 10x after 5 or 6 times of big bonus, that's cheating on us!!!  After the latest update it's so difficult to hit jackpot, they really know how to suck the juice out of it, make you wanna spend real money to buy the coin!! "
            ],
            [
                "Merge guest account to FB account",
                "  Please merge/ back up guest account with Facebook so I can save it and transfer to other devices. Guest account is level 44, FB level 1. And make full screen for Samsung Note 3 "
            ],
            [
                "Update..not updating. .cant load games. Only play zeus 2",
                "  The new update screwed up more stuff than it helped. .the customer service is non existent ..sent 5 emails and have had zero response. .if ur in a bonus and get kicked off or lose connection ..you lose your bonus and winnings. .this is a ripoff. ..slotomania has fixed this issue. Maybe jpp should talk to their tech s "
            ],
            [
                "0 star read.",
                "  Dont bother downloading this game. It is no better than most of the games out there. Now they are messing with your progress bar. I have been on level 44 and have spent over 100000 coins and have not even moved on my progress bar making it nearly impossible to level up.  Emailing support did nothing no response. Its all about the money to these greedy companies. Please read all the reviews and not just the fake good ones. "
            ],
            [
                "Ticked",
                "  I downloaded loved it, then had to update, lost the guest option, just had to update again to get the guest option back, now I keep getting kicked out. I click on a game and my phone goes to my home screen!! So now I can't even play at all errrrrrr!!! "
            ],
            [
                "When you hit big win says submitting spin to server kicks you out and ...",
                "  When you hit big win says submitting spin to server kicks you out and you loose your big.win.... it does not show up "
            ]
        ],
        "similar": [
            "com.phantomefx.standalone.ilovelucy",
            "com.phantomefx.standalone.reelsodublin",
            "wheel.slots.leetcom.com",
            "com.phantomefx.standalone.junglewild",
            "com.mw.slotsroyale",
            "com.phantomefx.reeldeal",
            "com.phantomefx.tunzamunny",
            "com.phantomefx.standalone.romeandegypt",
            "com.dragonplay.slotcity",
            "com.phantomefx.balloonblitz",
            "air.com.slotgalaxy",
            "com.zentertain.slotsoriental",
            "com.phantomefx.standalone.zeus",
            "com.phantomefx.standalone.reelrichdevil",
            "com.phantomefx.standalone.fortuneseeker",
            "jp.gree.jackpot",
            "com.apostek.SlotMachine",
            "com.blueshellgames.luckyslots",
            "com.magmamobile.game.Slots",
            "com.gamelion.slots",
            "com.phantomefx.aztecsun_x",
            "com.ddi",
            "com.phantomefx.standalone.brazilianbeauty",
            "com.phantomefx.standalone.shimmer",
            "air.com.playtika.slotomania",
            "com.phantomefx.standalone.kilauea",
            "com.cervomedia.spw",
            "air.com.yazino.android.slots",
            "com.phantomefx.standalone.theheist",
            "com.casinogame.slots",
            "com.kakapo.freeslots",
            "com.phantomefx.slotmysterypyramids"
        ]
    },
    {
        "appId": "com.playtika.caesarscasino",
        "moreFromDev": [
            "com.playtika.wsop.gp"
        ],
        "reviews": [
            [
                "Would be 5 star",
                "  But it won't let me play the bonus games.... Please fix and I will give 5 star "
            ],
            [
                "Rip off",
                "  Everytime you get a bonus......the game stop responding and u loose your place in turnament. "
            ],
            [
                "Samsung Charge",
                "  No longer works on this phone even after reinstall. Will not log on to Facebook. Un useable.Deleted. Update...Game now works fine.Enjoyable play everyday. "
            ],
            [
                "Not bad",
                "  Game is a lot of fun  freezes up a lot and didn't pay out 116,000 that it said i won but when it does work right its a lot of fun "
            ],
            [
                "Great game",
                "  I absolutely love this slots game. It gives me free coins and helps kill a lot  of spare time. "
            ],
            [
                "Fun",
                "  It's a very fun game to play I really enjoy to play it keep up the good work "
            ]
        ],
        "similar": [
            "com.dragonplay.slotcity",
            "com.blueshellgames.luckyslots",
            "com.magmamobile.game.Slots",
            "com.gamelion.slots",
            "com.cervomedia.spw",
            "air.com.slotgalaxy",
            "wheel.slots.leetcom.com",
            "com.kakapo.freeslots",
            "com.casinogame.slots",
            "air.com.yazino.android.slots",
            "com.hapogames.SlotsGo",
            "com.mw.slotsroyale",
            "air.com.playtika.slotomania",
            "com.apostek.SlotMachine",
            "com.ddi",
            "jp.gree.jackpot",
            "com.williamsinteractive.jackpotparty"
        ]
    },
    {
        "appId": "com.dragonplay.slotcity",
        "moreFromDev": [
            "com.dragonplay.farmcasino",
            "com.dragonplay.liveholdempro",
            "com.dragonplay.wildbingo",
            "com.dragonplay.dragonplaypoker",
            "com.dragonplay.widget"
        ],
        "reviews": [
            [
                "New cascade feature",
                "  Pay menu in cascading games says 15 free spins for 3 scatters with a prize multiplier. No... just 10 free spins and no multiplier... virtually impossible to win against these odds. "
            ],
            [
                "It is rigged",
                "  I wrote the review sayin its fixed now I'm back I opened a different account without fb I won 200000 credits in 5 min its fun again!!!! Lmao is that what it is ....the more you play the less payouts you get...this way you are alreadyy hooked..so then youll pay for credits i see how you do it !!!Im on level 68 and i nevvvvver win an if i do its gone in 5 minutes..its s fun game I give it to you but the rest is bullshit!!!!later.... "
            ],
            [
                "Upgraded",
                "  Just upgraded and lost all my friends . I had over 50 ! Not happy with that! Payouts are still low. "
            ],
            [
                "Fun (funds) factor higher played from Facebook on desktop",
                "  Easier to hit higher winnings if same game is played from Facebook when the game is played using desktop as compared to same game played on mobile. Recently, doesn't seem to be able to load. Seems back to normal, except that the loading seems slacky. Thanks developer, for listening & making improvement to the already fun game. "
            ],
            [
                "New slots??",
                "  At level 86 with well over 5mil...any new slots coming out or should I give up? Will admit, though, the cascade is great! Great payouts, but you have to bet big. "
            ],
            [
                "Don't Waste Your Time..It Sucks!",
                "  When I downloaded this game it was Awesome & A LOT Of Fun..Until I get a request to update Promising more bonuses etc so I updated..I had Over $500K in coins when I updated & Literally went to 0 coins cuz I could Never get free spins etc anymore..After a few weeks of Daily Playing I Finally got up to $60K (no higher) & saw Another 'Promising' Update..Lies ..After updating Again..It's Worse Than The Last :/ I'm DONE WITH SLOT CITY! Ima Find A Better Place To Play Slots!! Don't Waste Your Time With This App!! "
            ]
        ],
        "similar": [
            "com.apostek.SlotMachine",
            "com.blueshellgames.luckyslots",
            "com.magmamobile.game.Slots",
            "com.gamelion.slots",
            "com.diwip.vslots",
            "com.cervomedia.spw",
            "air.com.slotgalaxy",
            "wheel.slots.leetcom.com",
            "com.kakapo.freeslots",
            "com.zentertain.slotsoriental",
            "com.casinogame.slots",
            "com.mw.slotsroyale",
            "air.com.playtika.slotomania",
            "com.williamsinteractive.jackpotparty",
            "com.ddi",
            "jp.gree.jackpot"
        ]
    },
    {
        "appId": "com.moarbile.online.slotoworld",
        "moreFromDev": "None",
        "reviews": [
            [
                "Magiclady",
                "  Very cool games. Alot of fun. "
            ],
            [
                ":-)",
                "   "
            ],
            [
                "Invisible graphics",
                "  Sounds like good game too bad I can't see the full game "
            ],
            [
                "Fun so far. Just started playing. Still figuring it out.",
                "   "
            ],
            [
                "Yea",
                "  Gooood "
            ],
            [
                "Amazing. Very fun game",
                "   "
            ]
        ],
        "similar": [
            "com.dragonplay.slotcity",
            "com.apostek.SlotMachine",
            "com.apostek.SlotMachine.paid",
            "air.com.slotgalaxy",
            "wheel.slots.leetcom.com",
            "com.zentertain.slotsoriental",
            "slot.game.tripleslotsslotmachine",
            "com.pharaoh.slots.free",
            "com.mw.slotsroyale",
            "com.slots.leetcom",
            "com.sibforce.bubbleshooter",
            "com.flaming.slots.free",
            "com.blueshellgames.luckyslots",
            "com.kakapo.slotsfarm",
            "com.zentertain.slotszeus",
            "com.sibforce.sudoku",
            "jp.gree.jackpot",
            "com.diwip.vslots"
        ]
    },
    {
        "appId": "com.playstudios.myvegas",
        "moreFromDev": "None",
        "reviews": [
            [
                "My vagas slots",
                "  Haven't gotten to far in the game yet, but their o.k. so far. "
            ],
            [
                "Fabulous Game",
                "  Very realistic payout, stupendous graphics! "
            ],
            [
                "Awesome",
                "  Great game to play and earn free things in Vegas! Brilliant idea! "
            ],
            [
                "Good app!",
                "  Updated and still unable to play Frontier Fortune and Pirate's Cove! I press load and neither of them downloads....fix! "
            ],
            [
                "VERY COOL GAME CUM COMPANY",
                "  Let's Roll. "
            ],
            [
                "Awesome",
                "  Fun addiction "
            ]
        ],
        "similar": [
            "com.dragonplay.slotcity",
            "com.blueshellgames.luckyslots",
            "com.magmamobile.game.Slots",
            "com.gamelion.slots",
            "com.cervomedia.spw",
            "air.com.slotgalaxy",
            "com.hapogames.SlotsGo",
            "wheel.slots.leetcom.com",
            "com.ddi",
            "com.casinogame.slots",
            "com.apostek.SlotMachine",
            "com.mw.slotsroyale",
            "air.com.playtika.slotomania",
            "com.williamsinteractive.jackpotparty",
            "com.kakapo.freeslots",
            "jp.gree.jackpot"
        ]
    },
    {
        "appId": "com.droidhen.game.poker",
        "moreFromDev": [
            "com.droidhen.fortconquer",
            "com.droidhen.shootapple2",
            "com.droidhen.game.gog",
            "com.droidhen.turbo",
            "com.droidhen.game.dinosaur",
            "com.droidhen.shootapple",
            "com.droidhen.game.magicera",
            "com.droidhen.defender",
            "com.droidhen.game.coin",
            "com.droidhen.game.xrunner",
            "com.droidhen.defender2",
            "com.droidhen.fish"
        ],
        "reviews": [
            [
                "Addictive game.",
                "  I would play it for hours and lose track of time. I'm basically training my skills in poker. "
            ],
            [
                "Great game but very random lag issues",
                "  Great game but has some random lag issues. Tho running a mid-end smartphone I have problems with the game being not responsive. Reply and fix and I'll give it a 5 star rating. "
            ],
            [
                "Cool and u should buy it",
                "  Little laggy and has pop up wantinf u to buy chips but other than that the game is fun "
            ],
            [
                "Simple and easy to use. Much better than the others out there.",
                "  Really nice game. There are some issues of losing out on games due to a technical problems. Overall entertaining. If they could fix a way to make sure that no money or games are lost due to network errors it would be the best. "
            ],
            [
                "A complete scam!!!",
                "  Be prepared to be cheated everyone!! "
            ],
            [
                "You Will never read this",
                "  This game sucks! It is programed to let new players have better hands so they get hooked and want to buy chips.after sending many emails to dh service about losing with a winning hand they sent email back saying they would look into the PROBLEM. lost 4 more games to the same prob 2 of those games over 50 million in chips to a new player never seen 3 aces lose to a pair of 6s. Please take snap shots of all your games delete ones that are correct keep ones that are not. Look me up profile name IDONTFETCH "
            ]
        ],
        "similar": [
            "com.tinyco.poker",
            "com.geaxgame.pokerkingpro",
            "com.dragonplay.liveholdempro",
            "com.boyaa.fben",
            "com.gameloft.android.ANMP.GloftTHM2.ML",
            "com.pyrsoftware.pokerstars.net",
            "com.igg.pokerdeluxe",
            "com.appeak.poker",
            "com.plarium.pokershark",
            "air.com.youdagames.google.ww.gop2MobileFree",
            "com.kamagames.pokerist",
            "poker.hands.order",
            "com.zynga.livepoker",
            "com.idlegames.eldorado",
            "com.ea.game.wsop_row",
            "com.dragonplay.dragonplaypoker"
        ]
    },
    {
        "appId": "com.sava.flip_chip_poker",
        "moreFromDev": "None",
        "reviews": [
            [
                "Awesome Game",
                "  Then Why the 3star rating? Issues, issues, issues! Good game, Love it, but runs out coins and have to spend real cash which I don't mind, but a little toooo expensive $$, I would like another option like tap joy to earn free coins? Also there is Not an Exit way out? How in the world do I Exit? Samsung galaxy 3 had to use task manager to exit! Anywho, Really Enjoyed playing, will change my review after I keep playing and seeing some improvements, Thank you! "
            ],
            [
                "game is fun but $$$$!  reboot to exit game sux.",
                "  game is fun but $$$$!  reboot to exit game sux.  that is the reason I am uninstalling and giving 1 star.  Otherwise it gets between 5 for addictiveness/fun and 3 for how quick you run out of \"free' play.  if you are rich and want to kill time..... get the app, you will love it. "
            ],
            [
                "Love it!!",
                "  Love this game!! Only thing that i don't like is coins go so fast, and there's a very long gap in collecting ur free spins "
            ],
            [
                "Cool idea ruined",
                "  The game is a cool idea. I actually really like the gameplay, but they totally ruin it with the crazy frequency of ads and requests to buy enhancements. I honestly may have bought something if it weren't so intense. Also, navigation is screwy. Back button won't exit anything. I don't think I'll be giving it another chance "
            ],
            [
                "Wasted my time",
                "  I downloaded this app. Once it was finished downloading it went to the \"installing app\".....then,....NOTHING...GAME DID NOT APPEAR...TRIED TO RE-DOWNLOAD AND AGAIN..TROUBLE. this time it wouldn't even download. "
            ],
            [
                "Sorry game",
                "  You HAVE TO spend coins for the stupid power up that only lasts 5 seconds. costs too many coins to fold. Takes to many \"flips\" to turn over cards. Game should allow 3 flipped cards at beginning as you always run out of time before you get 5 of the 7 cards flipped then costs you MORE coins to flip . waste of time. Sorry game. Also there is no way to exit game unless you restart your phone. I am uninstalling after this post. "
            ]
        ],
        "similar": [
            "com.ludia.jurassicpark",
            "com.ludia.millionairefree",
            "air.ru.mail.games.pokerarena",
            "com.ludia.locomotors",
            "com.gameloft.android.ANMP.GloftTHM2.ML",
            "com.igg.pokerdeluxe",
            "com.plarium.pokershark",
            "com.droidhen.game.poker",
            "com.ludia.tpirdecades",
            "com.ea.game.wsop_row",
            "com.ludia.familyfeudandfriends.free",
            "com.dragonplay.liveholdempro",
            "air.com.ludia.bettyboopslots",
            "com.appeak.poker",
            "com.tinyco.poker",
            "com.kamagames.pokerist",
            "com.zynga.livepoker",
            "com.ludia.tpirslots",
            "com.dragonplay.dragonplaypoker",
            "com.pyrsoftware.pokerstars.net",
            "com.geaxgame.pokerkingpro",
            "poker.hands.order",
            "air.com.youdagames.gop2mobile",
            "com.ludia.FifthGrader.free"
        ]
    },
    {
        "appId": "com.igg.bzbee.slotsdeluxe",
        "moreFromDev": [
            "com.igg.castleclash_th",
            "com.igg.bzbee.slotsdeluxe_de",
            "com.igg.heroes_monsters",
            "com.igg.castleclash_ru",
            "com.igg.castleclash_it",
            "com.igg.castleclash_fr",
            "com.igg.clash_of_lords",
            "com.igg.dawn_of_darkness",
            "com.igg.pokerdeluxe",
            "com.igg.castleclash",
            "com.igg.castleclash_es",
            "com.igg.castleclash_jp",
            "com.igg.castleclash_kr",
            "com.igg.castleclash_de",
            "com.igg.kachingslots",
            "com.igg.castleclash_tw"
        ],
        "reviews": [
            [
                "love playing",
                "  Need to play this game, take's your mind some where you have been. "
            ],
            [
                "Great game",
                "  Not as bad as other slot games I've played, this game pays out sometimes big. U don't have to keep paying to play, when just u start loosing stop playing. Its fun and doesn't break ur bank! "
            ],
            [
                "Good game",
                "  Addicted to this game, however if only you can win more often instead of just loosing. "
            ],
            [
                "Fun",
                "  I like it and I don't lose any real money "
            ],
            [
                "Not enough coins.",
                "  It's fun to play "
            ],
            [
                "Niiiiiicccceee",
                "  Great game!  Awesome guys! "
            ]
        ],
        "similar": [
            "com.dragonplay.slotcity",
            "com.apostek.SlotMachine",
            "com.magmamobile.game.Slots",
            "com.gamelion.slots",
            "com.cervomedia.spw",
            "air.com.slotgalaxy",
            "wheel.slots.leetcom.com",
            "com.kakapo.freeslots",
            "com.zentertain.slotsoriental",
            "com.mw.slotsroyale",
            "air.com.playtika.slotomania",
            "com.williamsinteractive.jackpotparty",
            "com.ddi",
            "com.kakapo.slotsfarm",
            "com.blueshellgames.luckyslots",
            "jp.gree.jackpot"
        ]
    },
    {
        "appId": "air.com.yazino.android.slots",
        "moreFromDev": [
            "air.com.yazino.android.poker.texholdem",
            "air.com.playtika.slotomania",
            "air.com.slotgalaxy"
        ],
        "reviews": [
            [
                "ARE YOU SERIOUS",
                "  And now it doesn't load! "
            ],
            [
                "Fix it!!!!",
                "  I used to love this game, but for whatever reason it constantly freezes up and can't connect to your server even when I've got a full wi-fii signal! This game just keeps getting worse and you won't respond when I send in a message to fix it!!!! "
            ],
            [
                "No fun! Misleading",
                "  This game keeps sending me notifucations about 50, 000 or 10, 000 bonus tokens and when I open the game I get no bonus. Please fix! "
            ],
            [
                "Was fun!",
                "  Payouts are lame! Not liking the updates and if these notifications don't stop I'm done! "
            ],
            [
                "Fun",
                "  But same game over and over so far but not far into it "
            ],
            [
                "Wheel slots",
                "  This game is so much fun and there's a lot of challenge to it as well I would recommend it for anyone "
            ]
        ],
        "similar": [
            "com.dragonplay.slotcity",
            "com.apostek.SlotMachine",
            "com.magmamobile.game.Slots",
            "com.gamelion.slots",
            "com.applab.pyra3",
            "com.cervomedia.spw",
            "com.zentertain.slotssagaclient",
            "wheel.slots.leetcom.com",
            "com.fishsticksgames.SlotsJourney",
            "com.mw.slotsroyale",
            "com.williamsinteractive.jackpotparty",
            "com.ddi",
            "com.blueshellgames.luckyslots",
            "jp.gree.jackpot"
        ]
    },
    {
        "appId": "com.igg.pokerdeluxe",
        "moreFromDev": [
            "com.igg.castleclash_th",
            "com.igg.bzbee.slotsdeluxe_de",
            "com.igg.castleclash_ru",
            "com.igg.bzbee.slotsdeluxe",
            "com.igg.castleclash_it",
            "com.igg.castleclash_fr",
            "com.igg.clash_of_lords",
            "com.igg.dawn_of_darkness",
            "com.igg.heroes_monsters",
            "com.igg.castleclash",
            "com.igg.castleclash_es",
            "com.igg.castleclash_jp",
            "com.igg.castleclash_kr",
            "com.igg.castleclash_de",
            "com.igg.kachingslots",
            "com.igg.castleclash_tw"
        ],
        "reviews": [
            [
                "Great game .. love the chat options. .",
                "  Great game fun players and no need to buy any chips... the only reason it got three stars is do to the fact it freezes all the time... and its not my phone I have a gs3 and every other app run great. .. "
            ],
            [
                "Great app, crappy players",
                "  App is excellent, however players go all in before the flop and buy back in. Chips are too easy to get outside of playing. Idle players remain on table taking away from actual play time. 3/5 "
            ],
            [
                "Too slow",
                "  There should be a limit on how many times you are automatically folded, due to not making a choice fast enough, before they are removed from the table for a certian amount of time. "
            ],
            [
                "Fun game even though most players don't know the first thing about hold em ...",
                "  Fun game even though most players don't know the first thing about hold em\tWhy does the app allow players to time out and immediately buy back in over and over and over again? This creates long, boring wait times. Also, there has been times when I'm in the small or big blind 3 or 4 hands in a row. New players arriving at a table should have to wait til the deal button passes them to play a hand instead of forcing players who are already there to be in the blinds more than once. Fix these issues and I'll give more stars. "
            ],
            [
                "Awesome",
                "  @80990829 Everything apart from the free credits or whatever you call it super. I downloaded the bible then also the line software but havent got my money. If you dont wanna.give then plz dont make us download stupid softwares . I cant afford to buy for real money so these offers are my  way of getting some game.cash. By downloadi.g the sofwares we.are.wasting time and also money coz it costs money to download software right. So please do not leave us hanging. Even your cust care is nothing but sham i click "
            ],
            [
                "PLS REMOVE EXPLICIT/PORN PICS!!!",
                "  I like the app but I'm EXTREMELY ANNOYED & DISGUSTED BY EXPLICIT PICS! Ppl shouldn't be allowed to use these type of profile pics! BLOCKING PICS SHOULD BE ALLOWED B/C U CAN'T ENJOY PLAYING THE GAME W/O SEEING SOMEONE'S \"PRIVATE PARTS\".....PLS FIX ASAP "
            ]
        ],
        "similar": [
            "com.tinyco.poker",
            "com.geaxgame.pokerkingpro",
            "com.dragonplay.liveholdempro",
            "com.boyaa.fben",
            "com.pyrsoftware.pokerstars.net",
            "com.droidhen.game.poker",
            "com.appeak.poker",
            "com.plarium.pokershark",
            "air.com.youdagames.google.ww.gop2MobileFree",
            "com.kamagames.pokerist",
            "poker.hands.order",
            "com.hqin.headsup.Holdem",
            "com.zynga.livepoker",
            "com.idlegames.eldorado",
            "com.ea.game.wsop_row",
            "com.dragonplay.dragonplaypoker"
        ]
    },
    {
        "appId": "com.dragonplay.liveholdempro",
        "moreFromDev": [
            "com.dragonplay.slotcity",
            "com.dragonplay.dragonplaypoker",
            "com.dragonplay.wildbingo",
            "com.dragonplay.farmcasino",
            "com.dragonplay.widget"
        ],
        "reviews": [
            [
                "K",
                "  Great game! Tourny nds help ur cards cm out most of the time if u raise. Unrealstc flops, face card alwys cms out. Plz fix. Gt rid of All In Donkeyz! "
            ],
            [
                "Was great but recently loses connection in the middle of a tournament, wtf? Fix ...",
                "  Was great but recently loses connection in the middle of a tournament,  wtf? Fix thus bug and give me back my money!\tPlay "
            ],
            [
                "Pretty good game",
                "  Good game overall tables are a little to loose and if the player before waists to long it freezes your play Stop players stalling and tighten up the tables "
            ],
            [
                "U need to try",
                "  I wish there were more then just free chips. They need prizes outside of the tables or even chances to win real prizes I play every day. Some days are good and some are bad. I wish there were more then just free chips. They need prizes outside of the tables or even chances to win real prizes "
            ],
            [
                "Awesome",
                "  Love playing poker so it keeps me pretty busy. One thing is I wish it had more mini games for gold, but other than that 5 for the team. Keep it up :-) "
            ],
            [
                "It was the best poker game I had ever played .Please help to resolve ...",
                "  It was the best poker game I had ever played .Please help to resolve the gift issue as I m not able to send any gift to my poker friends.\tBest poker game  but unable to send  gift and not receiving daily bonus since last week.Already tried to re install game .Hope this issue can be resolved asap .I will rate is as average at the moment. Please help to resolve the gift and daily bonus issue. "
            ]
        ],
        "similar": [
            "com.kmagic.solitaire",
            "com.geaxgame.pokerkingpro",
            "com.tinyco.poker",
            "com.leftover.CoinDozer",
            "com.boyaa.fben",
            "com.mobilityware.solitaire",
            "com.pyrsoftware.pokerstars.net",
            "com.igg.pokerdeluxe",
            "com.droidhen.game.poker",
            "com.appeak.poker",
            "com.plarium.pokershark",
            "air.com.youdagames.google.ww.gop2MobileFree",
            "com.kamagames.pokerist",
            "poker.hands.order",
            "com.zynga.livepoker",
            "com.ea.game.wsop_row"
        ]
    },
    {
        "appId": "uk.co.aifactory.spadesfree",
        "moreFromDev": [
            "uk.co.aifactory.backgammonfree",
            "uk.co.aifactory.go",
            "uk.co.aifactory.solitairefree",
            "uk.co.aifactory.backgammon",
            "uk.co.aifactory.rrfree",
            "uk.co.aifactory.sudoku",
            "uk.co.aifactory.ginrummyfree",
            "uk.co.aifactory.chessfree",
            "uk.co.aifactory.spades",
            "uk.co.aifactory.fialfree",
            "uk.co.aifactory.moveitfree",
            "uk.co.aifactory.hearts",
            "uk.co.aifactory.heartsfree",
            "uk.co.aifactory.checkersfree",
            "uk.co.aifactory.sudokufree",
            "uk.co.aifactory.gofree"
        ],
        "reviews": [
            [
                "Nice Way to Kill Some Time",
                "  Very good graphics.  Like the skill levels. Sometimes, your \"partner\" plays an off hand. Not unlike real life. Try it. You'll like it. "
            ],
            [
                "I enjoy the gane just can't depend on the player rankings to choose a ...",
                "  I enjoy the gane just can't depend on the player rankings to choose a partner.\tGame is good, but can't depend on player ranking to choose a partner because several times when I picked a 5 star player, they were terrible. "
            ],
            [
                "Great, but could be better",
                "  Easy to use and plays a pretty good game but bidding and bag management could be better. "
            ],
            [
                "Nice interface but.....",
                "  After playing this for a while you soon realize that whichever partner you choose, he/she will continue making bags even though the bid has been made, very frustrating! Strange thing is, avoiding bags is what your opponents seem to be very good at, so why is it not possible for your partner to be endowed with the same skill? Another infuriating feature is that your partner will occasionally lead a low card into your nil bid whilst holding on to a higher card!!  I appreciate the free game but  please attend to these issues and you'll have a winner!! "
            ],
            [
                "Decent has a few bugs though.",
                "  Its a nice game, fun to play, but there are a few kinks that should be worked out. Sometimes it doesn't want to play a card. "
            ],
            [
                "Im still a fan, although its about the same. You are truly playing against ...",
                "  Im still a fan, although its about the same. You are truly playing against yourself because your partner make plays that a regular partner most definitely wouldn't. You will be reminded constantly that you are playing alone.\tGreat game! Improvements are needed on the players and bidding. Its designed to be challenging but its \"jacked up\" when it seems as though your partner is playing against you. The game can stand some  tweaking, especially on the players. But still, its a great game. "
            ]
        ],
        "similar": [
            "com.neuralplay.android.spades",
            "com.al3aabna.spades",
            "com.bytesequencing.spades_ads",
            "com.sg.js.Spades",
            "com.silvercrk.spades_free",
            "com.bwhale.bwcards.spades",
            "com.spadesfree",
            "com.games.spadesfull",
            "com.dqsoft.ChampSpades",
            "com.concretesoftware.spades_demobuynow",
            "com.games.spadesfree",
            "shvutsh.pack.spades",
            "com.karmangames.spades",
            "com.alper.spades.hd",
            "com.sadegames.batak",
            "silverhawk.spades"
        ]
    },
    {
        "appId": "com.enterra.android.apps.poker.client.ivey.free",
        "moreFromDev": [
            "com.enterra.android.apps.poker.client.ivey"
        ],
        "reviews": [
            [
                "Cards always fun",
                "  It's a good time to get it it's sweet game "
            ],
            [
                "Sucks",
                "  It won't even load and start up "
            ],
            [
                "Motorola Android",
                "  It will let me log in as a guest but not on my facebook or Google account "
            ],
            [
                "Eh",
                "  Seems alright only doing this to get food in Pk "
            ],
            [
                "Downloading this",
                "  To get money. In another game "
            ],
            [
                "Doing this",
                "  To get credit in another application . "
            ]
        ],
        "similar": [
            "solgames.pack.pokersl2",
            "com.geaxgame.pokerkingblue",
            "com.BestCarsHD.Poker",
            "com.geaxgame.pokerkingpro",
            "com.dragonplay.liveholdempro",
            "com.danielpaiva.pokerhandbook",
            "com.joyaction.SevenPokerMachine",
            "com.gameloft.android.ANMP.GloftTHM2.ML",
            "net.thirteencards.openface",
            "com.perunlabs.app.poker",
            "com.gemego.playtexasfree",
            "poker.hands.order",
            "game.poker.solitaire",
            "com.zynga.livepoker",
            "com.perunlabs.app.pokerpro",
            "com.gemego.texasmate"
        ]
    },
    {
        "appId": "net.imcjapan.android.casino",
        "moreFromDev": "None",
        "reviews": [
            [
                "After up grade, went haywire",
                "  Had game for awhile, updated, would not work right. Kept forcing it closed, couldn't collect bonuses. Please fix it n I'll give higher rating! "
            ],
            [
                "Fun way to fill to time",
                "  Fun to play, but confused as to \"LuckyTime\" etc.. and cannot find \"help\" or instructions on the various aspects of the games. Would also like more free chips.! "
            ],
            [
                "I really enjoy playing this game! Lots of fun and long playing time. Too ...",
                "  I really enjoy playing this game! Lots of fun and long playing time. Too bad we're not winning \"REAL\" money! "
            ],
            [
                "Satisfied now",
                "  \"Won't allow me to download the other games. Stuck on first machine.\" Was my first comment for review. But now I must say...im satisfied. TOTALLY ! "
            ],
            [
                "My second favorite.",
                "  Really like this one. One exception I have lost a couple of my free points from the collection of items I have lost two for 200, 000 and one for 1, 000, 000 that is a lot to lose. Do they expire after a few hours? Otherwise lots of entertainment for hours. "
            ],
            [
                "Lost connection",
                "  Please don't waste money on chips for this game. I was in a bonus round, it lost connection to the server and dropped the bonus round. I have played other slots that have done the same, but we're programmed well enough to remember where u were at. "
            ]
        ],
        "similar": [
            "com.dragonplay.slotcity",
            "com.apostek.SlotMachine",
            "com.magmamobile.game.Slots",
            "com.gamelion.slots",
            "com.cervomedia.spw",
            "air.com.slotgalaxy",
            "wheel.slots.leetcom.com",
            "air.com.yazino.android.slots",
            "com.gsn.android.casino",
            "com.mw.slotsroyale",
            "air.com.playtika.slotomania",
            "com.williamsinteractive.jackpotparty",
            "com.ddi",
            "com.blueshellgames.luckyslots",
            "com.kakapo.freeslots",
            "jp.gree.jackpot"
        ]
    },
    {
        "appId": "air.com.gamesys.mobile.slots.jpj",
        "moreFromDev": "None",
        "reviews": [
            [
                "Awesome Apps!",
                "  Highly recommended to every one who loves playing the absolute Apps. that pays better and has a generous bonuses. All in all, its Great! Thank you. "
            ],
            [
                "Very irritated",
                "  I have had 2 bonuses now with the valley of the kings. One I won over 1 million, the 2 nd I won 139,000. Why am I NOT getting my points!!!! SMH "
            ],
            [
                "Fun games",
                "  I really love the games but have been getting frustrated by it going off on its own. "
            ],
            [
                "Frustrated",
                "  Love playing this game, but everytime i try to play it on my phone it says not connecting. But it let me collect my bonus.  I have to force stop it to play. It will let me play for maybe 2mins then it stops. Fix that problem and I'll rate 5 stars. "
            ],
            [
                "Fair games",
                "  Fair and somewhat enjoyable games. Coin packs expensive for a\"free\" slot with no real win. But an acceptable gaming experience. "
            ],
            [
                "Good, so far.",
                "  Good, so far. Can't open one slots it just keeps loading, but very big bonuses, something bad is bound to happen it always does with these games. "
            ]
        ],
        "similar": [
            "com.dragonplay.slotcity",
            "com.blueshellgames.luckyslots",
            "com.gamelion.slots",
            "com.apostek.SlotMachine.paid",
            "com.feelingtouch.slotgame2",
            "wheel.slots.leetcom.com",
            "com.applab.pyra3",
            "com.ddi",
            "com.pharaoh.slots.free",
            "com.apostek.SlotMachine",
            "com.mw.slotsroyale",
            "com.williamsinteractive.jackpotparty",
            "com.kakapo.freeslots",
            "com.targa.vegasslot",
            "jp.gree.jackpot",
            "com.diwip.vslots"
        ]
    },
    {
        "appId": "com.tinidream.bingorun",
        "moreFromDev": [
            "com.tinidream.bingotango",
            "com.tinidream.bingovegas",
            "com.tinidream.bingohalloween",
            "com.tinidream.bingosummer"
        ],
        "reviews": [
            [
                "Love it but...",
                "  The app freezes all the time... in the middle of a game, after spending tons of bingo bucks...multiple times it stops responding. Been happening for awhile now.. great have though jus needs fixed. Would like credited my bucks.. "
            ],
            [
                "Thought it was great....",
                "  Fun until app stops responding and closes mid round causing me to lose everything invested and when spending real $ to buy enough bucks to play multiple levels really frustrating to lose it All cuz app freezes. Also sent multiple emails about being shorted bucks for Bingo's and when daubed square with bucks yet to receive response or credit for losses please fix! overall really like the app when works properly. "
            ],
            [
                "Disappointed",
                "  The game used to run great until recently,  now when a game ends and you hit the\"X\" to start new round game screen turns black and ends....going to un install. Would have given a 5 before now. "
            ],
            [
                "Ordinary bingo game great to play.",
                "  Unfortunately the bonus games run far to fast to be able to daub your bingo card efficiently unless you are an octopus or have multiple arms. Quite disappointed. :-( "
            ],
            [
                "ADDICTIVE!!",
                "  So much fun! I keep losing track of time when I play! Almost to much fun! "
            ],
            [
                "IMMA FAN!!!",
                "  I initially started playn 2 earn free \"FISH BUCKS\" 4 \"TAP FISH... once i started, i couldnt stop =-O !!! Its awesome n alotta fun!!!  This is a MUST HAS. APP!! NOW IM INNIT 2 WINNIT!!! In memorial of u mom...LV's BINGO QUEEN!!!  I luv n miss lots...cheer me on!!! "
            ]
        ],
        "similar": [
            "com.dragonplay.wildbingo",
            "com.ember.bingoSD",
            "com.targa.bingo",
            "air.com.bitrhymes.bingo",
            "com.kakapo.bingo",
            "com.gsn.android.casino",
            "air.com.sgn.bingo.google",
            "com.etermax.bingocrack.lite",
            "air.com.buffalo_studios.newflashbingo",
            "com.fpinternet.ibingo",
            "jp.gree.jband",
            "air.com.tinidreams.slots",
            "com.productmadness.bingomadness",
            "com.redhotlabs.bingo",
            "air.com.alisacasino.bingo",
            "com.apostek.apps.pocketbingo",
            "com.absolute.bingo"
        ]
    },
    {
        "appId": "wheel.slots.leetcom.com",
        "moreFromDev": "None",
        "reviews": [
            [
                "Boring",
                "  There is only one slot machine which does the same thing over and over. Can't change your bet.  Stupid and boring. "
            ],
            [
                "I think its a fun game.",
                "  I just wish there was more bonus mini games.Or a chance to bet what you want,instead of the same 5 dollar ,25 dollar  bet,you know! "
            ],
            [
                "Grate app",
                "  I love the app it works just like at a casino but you don't need money to play. "
            ],
            [
                "Good nobrainer slot game. I like the ranking part, but",
                "   "
            ],
            [
                "Fun game. Passes the time",
                "  Thanks for kicking cheats. "
            ],
            [
                "Owsome Game exactly like the one in the Casinos",
                "   "
            ]
        ],
        "similar": [
            "slot.game.tripleslotsslotmachine",
            "slot.game.fivemachine",
            "com.gmail.dmglakewood.Tower_Slots",
            "com.mw.slotsroyale",
            "com.slots.leetcom",
            "com.flaming.slots.free",
            "com.dragonplay.slotcity",
            "air.com.slotgalaxy",
            "com.droid.slots.free",
            "com.zentertain.slotsoriental",
            "com.kalahari.slots.free",
            "com.williamsinteractive.jackpotparty",
            "com.slots.mania.free",
            "com.kakapo.slotsfarm",
            "com.red.white.blue.free",
            "slot.game.tenmachine",
            "com.apostek.SlotMachine",
            "com.blueshellgames.luckyslots",
            "com.magmamobile.game.Slots",
            "com.gamelion.slots",
            "com.ddi",
            "air.com.playtika.slotomania",
            "slot.game.blazingmachine",
            "com.droid.slots",
            "com.diamonds.slots.free",
            "com.cervomedia.spw",
            "com.cherry.slots.free",
            "com.casinogame.slots",
            "com.pharaoh.slots.free",
            "jp.gree.jackpot",
            "com.kakapo.freeslots",
            "com.t4t.stickerwhatsapp"
        ]
    },
    {
        "appId": "com.blueshellgames.luckyslots",
        "moreFromDev": "None",
        "reviews": [
            [
                "Lots of problems!!!!!",
                "  No answer as to why it will no longer open. What's up with that. Can't get gifts from friends, can't even play! Fix this and rating will go up! Missing out!!! Why won't it let me log in so I can get my gifts from friends? Only let's me log in as guest. Fix this so us android players can play!!! You really should listen to all these complaints and RESPOND!!! "
            ],
            [
                "Absolute crap",
                "  Ran out of coins after 5 spins. The advertise bonus picture had 6,000 coins on it but that wasn't even on the bonus reel. Don't waste your time people as the owner is greedy with this so called game. The graphics are crappy as well, so many other games 10x better than this one. "
            ],
            [
                "Fun Fun Fun",
                "  They say it's free to play so why do you have to wait so long for credits? People play free because wr don't have the extra cash to pay for it, that's life. "
            ],
            [
                "what a bloody stupid game",
                "  my coins suddenly disapear, my bonus coin didnt get into my acc, 3times got 2500 bt its gone just like that. pls just vanish dear unlucky slot. u r not worth it n wasting time n also a mess. huh. uninstall frm my hp, my hubby hp n my son tablet. stupi game. "
            ],
            [
                "Lucky Slots for Android needs work!",
                "  I loved playing Lucky Slots on my IPhone but recently I switched to an Android and its like a completely different game! Come on Blueshell! Why would you release an app that seems incomplete?? Graphics suck, coins get stuck and I loose all I just paid for ect. Ect.....get it together or I'm deleting this app altogether! "
            ],
            [
                "Not happy with lucky slots on android.",
                "  Can't link to Facebook account, and doesn't always pay bonuses. Can't collect or send gifts .. "
            ]
        ],
        "similar": [
            "com.dragonplay.slotcity",
            "com.apostek.SlotMachine",
            "com.magmamobile.game.Slots",
            "com.gamelion.slots",
            "com.cervomedia.spw",
            "air.com.slotgalaxy",
            "wheel.slots.leetcom.com",
            "air.com.yazino.android.slots",
            "com.zentertain.slotsoriental",
            "com.mw.slotsroyale",
            "air.com.playtika.slotomania",
            "com.williamsinteractive.jackpotparty",
            "com.ddi",
            "com.kakapo.slotsfarm",
            "jp.gree.jackpot",
            "com.zentertain.slotssagaclient"
        ]
    },
    {
        "appId": "air.com.idlegaming.slots",
        "moreFromDev": [
            "air.com.ea.game.monopolyslots_na",
            "air.com.playtika.slotomania",
            "air.com.slotgalaxy"
        ],
        "reviews": [
            [
                "Great fun",
                "  Really fast and fun "
            ],
            [
                "First class slots game",
                "  Great graphics and gameplay. "
            ],
            [
                "Bad",
                "  Game does not open on my samsung exhibit. Uninstalling. "
            ],
            [
                "1 Hell of a fun a games",
                "  Good way to pass time "
            ],
            [
                "Slots of fun",
                "  I will click it to play but blacks out. Please fix it so i can play. "
            ],
            [
                "Meh",
                "  I'm sure it would be fun if I spent a bunch of money on tokens but that's not going to happen and the level coin bonus sucks. "
            ]
        ],
        "similar": [
            "com.dragonplay.slotcity",
            "com.blueshellgames.luckyslots",
            "com.apostek.SlotMachine",
            "com.zentertain.slotszeus",
            "com.idlegames.eldorado",
            "com.zentertain.slotssagaclient",
            "wheel.slots.leetcom.com",
            "com.mw.slotsroyale",
            "com.pharaoh.slots.free",
            "com.zentertain.slotsoriental",
            "com.gamelion.slots",
            "com.ddi",
            "com.kakapo.slotsfarm",
            "jp.gree.jackpot"
        ]
    },
    {
        "appId": "com.mobilityware.freecell",
        "moreFromDev": [
            "com.mobilityware.solitaire",
            "com.mobilityware.spider"
        ],
        "reviews": [
            [
                "It is my favorite",
                "  What I like about Freecell is that every game can be won. If I do not successfully finish a game I have no one to blame but myself. There is no \"luck\"involved. "
            ],
            [
                "Great game",
                "  As you would expect from the old classic. Good game play. Asks before auto completing. I hate games that suddenly completes it for you. Not a lover of being timed though. Play it for the enjoyment not to compete. "
            ],
            [
                "Ads have made a good game bad",
                "  The recent upgrade to tv ads has gone too far.  All tjese ads are \"What I like to call Wrong\" to quote one of the ads for a certain fibre supplement that keeps appearing! Sorry guys but it is time to uninstall all your solitaire games. "
            ],
            [
                "Mindless fun",
                "  This game is a good time-filler when I have to sit and wait. Engaging enough to play over & over without being repetitive. "
            ],
            [
                "Excellent",
                "  Best FreeCell game available on the Android market by far! Other apps may provide a whole choice of solitaire type games but for the FreeCell buff this is an obvious choice. With unlimited take-backs available, auto complete function, choice of over 100,000 uniquely different set-ups, smooth graphics and recorded best score this can't be beat!! "
            ],
            [
                "Better than most.",
                "  I addicted to to FreeCell and Spider.  I have tried several different versions, and this is one of the best. "
            ]
        ],
        "similar": [
            "com.kmagic.solitaire",
            "com.voldaran.puzzle.graBLOX",
            "com.softick.android.solitaire.klondike",
            "com.softick.android.freecell",
            "com.brainium.solitaire",
            "com.brainium.solitairefree",
            "com.hapogames.solitaire",
            "com.magmamobile.game.Solitaire",
            "com.anoshenko.android.solitaires",
            "com.tesseractmobile.solitairefreepack",
            "com.brainium.spiderfree",
            "hu.appcoder.solitaire",
            "com.magmamobile.game.SpiderSolitaire",
            "com.brainium.freecellfree",
            "net.jeu.solitaire",
            "com.magmamobile.game.Freecell",
            "com.gosub60.solfree2"
        ]
    },
    {
        "appId": "air.com.slotgalaxy",
        "moreFromDev": [
            "air.com.playtika.slotomania"
        ],
        "reviews": [
            [
                "Great game but..",
                "  Stopped working 2days ago on my droid. What's up! "
            ],
            [
                "Fun n Exciting Games",
                "  The winning chance too slim especially the free spin. Not easy to win bonus games but when got bonus game the winning token is too less. "
            ],
            [
                "Hours before $",
                "  4 hours is too long to remember to check to get your measly hundred coins "
            ],
            [
                "Bad Slots!",
                "  Evey hard to win free coin, got to wait 6 3hr turns to get 1 free spin and then top it only 2500 pay out. Even better is that what free coin u do manage to obtain gets stolen back in between the 3hr spane, and they want player's to invest reall coin in a game with no real pay outs and steals coin bacl... Ha! "
            ],
            [
                "Good time killing",
                "  Love this game I lost money but sometimes you have to pay to play lol. "
            ],
            [
                "Excellent",
                "  EXCELLENT GAME!!! This is the  closest game to the actual slots!!! The bonuses are terrific. I play all night on this game!  The only thing that needs to change is how long it takes to get some more coins. ...4 hours is too much!!! Also what do I do when I am finished, will there be more games opening up? I have purchased many many coins, even for the bonuses and those amounts always take my money quickly!!!  I would like to keep playing but I can't afford it anymore! I don't get enough coins or times in 24 "
            ]
        ],
        "similar": [
            "com.dragonplay.slotcity",
            "com.apostek.SlotMachine",
            "com.magmamobile.game.Slots",
            "com.gamelion.slots",
            "com.cervomedia.spw",
            "com.zentertain.slotssagaclient",
            "wheel.slots.leetcom.com",
            "com.kakapo.freeslots",
            "com.zentertain.slotsoriental",
            "com.mw.slotsroyale",
            "com.williamsinteractive.jackpotparty",
            "com.ddi",
            "com.kakapo.slotsfarm",
            "com.blueshellgames.luckyslots",
            "jp.gree.jackpot"
        ]
    },
    {
        "appId": "com.iwin.dond",
        "moreFromDev": [
            "com.iwin.jewelquest4",
            "com.iwin.jqm3"
        ],
        "reviews": [
            [
                "Crashes and lose all the coins you earn",
                "  This game was great at first.....but then everytime I played after my game crashed lost my coins. Like an idiot I log back in and it did the same thing. If you are going to charge to play epidodes then fix tge bug. Unyil then I am uninetalling "
            ],
            [
                "Fun game",
                "  It's a fun game, well written, and never the same game twice. It does have a tendency to lock up and crash when you first begin the game, but start the game a 2nd time and it works fine. "
            ],
            [
                "Cool",
                "  Very cool wtf awesome "
            ],
            [
                "Great concept but needs work",
                "  Force closed app when in tournament and takes my tokens no refund of lost tokens. "
            ],
            [
                "worst game",
                "  guys this is the mostra problemÃ¡tica game every if u download this game ur phone will come out with many probles naver download these tipe ok game <VÃ�RUS> inside "
            ],
            [
                "Cant even download it",
                "  After download is complete it says \"ERROR\" PACKAGE FILE IS INVALID. Your wasting our time here..cmmon guys.I tried to restart my phone and download it but nithing happened. "
            ]
        ],
        "similar": [
            "com.apostek.SlotMachine",
            "com.dragonplay.slotcity",
            "com.kmagic.solitaire",
            "com.cervomedia.spw",
            "com.gsn.android.casino",
            "com.dragonplay.liveholdempro",
            "com.leftover.CoinDozer",
            "com.genina.android.blackjack.view",
            "air.com.yazino.android.slots",
            "com.gameloft.android.ANMP.GloftBTHM",
            "air.com.playtika.slotomania",
            "com.ddi",
            "com.phantomefx.reeldeal",
            "com.ludia.tpirslots",
            "jp.gree.jackpot",
            "com.gameloft.android.ANMP.GloftUOHM"
        ]
    },
    {
        "appId": "com.genina.android.blackjack.view",
        "moreFromDev": [
            "com.genina.android.blackjack.premium"
        ],
        "reviews": [
            [
                "Great quality but...",
                "  The time it takes to get chips again after you have used all yours is rediculas, 4 hour wait for 50 chips "
            ],
            [
                "Great app",
                "  Very addictive and not alot of annoying ads popping up every 5mins.. "
            ],
            [
                "Amazing way to spend your time when car is being serviced!",
                "   "
            ],
            [
                "As bad as it can get",
                "  I paid up front for an ad free experience. Whatever this game is, it is not blackjack. Uninstalled the paid version. "
            ],
            [
                "I lie this game",
                "  Was gonna give it a 3 cause I was looking most games but it's a good app I like so 5 stars it is "
            ],
            [
                "Fast moving",
                "  Great for a free game, lots of points few ads "
            ]
        ],
        "similar": [
            "com.superluckycasino.scratchers.hd",
            "com.leftover.CoinDozer",
            "eu.mvns.games.blackjack",
            "eu.mvns.games",
            "com.zynga.livepoker",
            "com.dragonplay.slotcity",
            "com.superluckycasino.scratchers",
            "com.twelvegigs.heaven.vpoker.hd",
            "com.droidhen.game.poker",
            "com.twelvegigs.heaven.lotto",
            "com.apostek.SlotMachine",
            "com.twelvegigs.heaven.vpoker",
            "com.twelvegigs.heaven.lotto.hd",
            "com.cronlygames.blackjack",
            "com.twelvegigs.heaven.bingo",
            "com.dragonplay.liveholdempro",
            "com.mobilityware.solitaire",
            "com.WhatWapp.BlackJack",
            "com.topfreegames.sudoku",
            "air.com.playtika.slotomania",
            "com.twelvegigs.heaven.bingo.hd",
            "com.gosub60.bj2free",
            "com.gameloft.android.ANMP.GloftUOHM",
            "com.twelvegigs.heaven.slots",
            "com.blackjack.wintrino",
            "com.mousegame.blackjack"
        ]
    },
    {
        "appId": "com.bytesequencing.spades_ads",
        "moreFromDev": [
            "com.bytesequencing.cribbage_ads",
            "com.bytesequencing.android.dominoes.free",
            "com.bytesequencing.android.pinochle",
            "com.bytesequencing.hearts_ads",
            "com.bytesequencing.bubble_popper_ads",
            "com.bytesequencing.android.solitaire",
            "com.bytesequencing.android.euchre"
        ],
        "reviews": [
            [
                "The best free online spades game i found",
                "  The game is ok.. I dont like that can't use my own words in chat. There are preset chat messages. And it aggravates me whe I slightly move my phone or rotate it and it boots me from my game, but i can jump bk in it. "
            ],
            [
                "Great game",
                "  Game is awesome I think you need a better server or something.. Game won't let me play online often. I would definitely pay for this app it if came down to it! "
            ],
            [
                "S3 im named l",
                "  Until today it was great it wont connect to server (its beta so it's cool) and sometime it drops your connection but its freakin AWESOME!!! I only play online and I don't mind ads people have to make money so why complain? "
            ],
            [
                "The server is down for Online",
                "  Can't play online because the server is down. Solo spades online has a glitch!  How in the hell did north win with 81 points and I had 90? Either I went to school for nothing or yall calculations are a bit off. This game needs to be updated ASAP! "
            ],
            [
                "Good spades app! Allow to play with friends!",
                "  This spades app is the best on the market. To make this game better, the app should let you play with friends and you can add friends by their username like ruzzle. ALSO WHEN PLAYING ONLINE THE GAME MAKES IT THAT YOU CAN ONLY BID NILL AND NOTHING ELSE. BUT THIS IS RARE BUT VERY ANNOYING!!! "
            ],
            [
                "Why play online if you don't know how??",
                "  The game itself is awesome except for morons online that I can't believe graduated pre school. Remember,  YOU HAVEl A PARTNER!!  Here is a list of people who play online that do completely stupid things: Terence, Brandi, Tiffany, Cent, Sch, Jarod, Josh, Vaughn, Emery, Clyde, Rod, Elliot, Donita, Tony, Neno, Brennan, Gallina, Mechelle, Persia,  Lamonte, Fred, Matt, Johnny, Devon, Kyle. "
            ]
        ],
        "similar": [
            "com.neuralplay.android.spades",
            "com.bwhale.bwcards.spades",
            "com.sg.js.Spades",
            "com.kmagic.solitaire",
            "com.silvercrk.spades_free",
            "com.spadesfree",
            "com.mobilityware.solitaire",
            "uk.co.aifactory.spades",
            "com.mobilityware.spider",
            "uk.co.aifactory.spadesfree",
            "com.concretesoftware.spades_demobuynow",
            "com.games.spadesfree",
            "com.leftover.CoinDozer",
            "com.karmangames.spades",
            "com.sadegames.batak",
            "com.gameloft.android.ANMP.GloftUOHM"
        ]
    },
    {
        "appId": "com.kmagic.solitaire",
        "moreFromDev": "None",
        "reviews": [
            [
                "No deal",
                "  I had this app on my old desire hd and it worked perfectly but my new sgs3 doesn't have a search button so I can't deal the next hand. Will update rating once update provided "
            ],
            [
                "Can't use with galaxy nexus",
                "  I loved this app on my old phone. Please fix it so that I can use it on my new one too. "
            ],
            [
                "No new updates to fix issues",
                "  This version of solitaire was my favorite until they would not/could not keep up. They have been told about issues since the inception of this version in 2010 and have not bothered to address it. If your phone or tablet does not have a search button or a track ball you cannot play spider solitaire. Mobility Ware has a free spider game that works great. Switching over now. "
            ],
            [
                "Robert",
                "  When I first downloaded this app it was great after the upgrade it seems that I cannot even get closed to finish a game . It's not uncommon for me to go to 10 straight games and not finish or go to several games and only play a couple of cards. For that reason I am deleting the game. "
            ],
            [
                "Can't deal cards for Spider sol",
                "  Played this game on my old  phone and absolutely love it over all the others for spider sol...but on my new ph GS4..there is no way to deal  new cards.  PLEASE FIX THIS!  I'm rating it with 1 star until it's fixed.  5 stars after it's fixed. "
            ],
            [
                "Just upgraded phones, have a problem",
                "  I love this app, the only game I would play on a regular basis on my droid incredible.  I upgraded today to the HTC One and now I can't figure out how to deal the cards for Spider.  I only have the home and back buttons. There is no search button or trackball.  Please help! Would be 5 stars if I could play on new phone. "
            ]
        ],
        "similar": [
            "com.gosub60.solfree2",
            "com.leftover.CoinDozer",
            "com.dragonplay.liveholdempro",
            "com.mobilityware.solitaire",
            "com.brainium.solitaire",
            "com.brainium.solitairefree",
            "com.magmamobile.game.Solitaire",
            "com.anoshenko.android.solitaires",
            "com.tesseractmobile.solitairefreepack",
            "com.magmamobile.game.SpiderSolitaire",
            "com.mobilityware.freecell",
            "com.zynga.livepoker",
            "com.mobilityware.spider",
            "net.jeu.solitaire",
            "com.softick.android.solitaire.klondike",
            "com.gameloft.android.ANMP.GloftUOHM"
        ]
    },
    {
        "appId": "com.tinidream.bingovegas",
        "moreFromDev": [
            "com.tinidream.bingotango",
            "com.tinidream.bingohalloween",
            "com.tinidream.bingosummer",
            "com.tinidream.bingorun"
        ],
        "reviews": [
            [
                "Fun but small payouts",
                "  The game is a lot of fun and easy to play but the payouts are so small you never even win what you played especially if you use auto daub  or an instant power up. need some bigger payouts especially for like 1st-  5th place. although when people bingo on the 3rd number called it makes you wonder. how do they do that..? "
            ],
            [
                "Great game",
                "  Only been playing for a short time but addicted "
            ],
            [
                "Easy playing",
                "  Just like their Sister bingo app love it! "
            ],
            [
                "Cool game!",
                "  Just getting started, but so far...it's fun!!! "
            ],
            [
                "Good",
                "  Seems to work ok for the short time I have played. "
            ],
            [
                "Great fun!",
                "  Makes killing time fun. "
            ]
        ],
        "similar": [
            "com.dragonplay.wildbingo",
            "com.ember.bingoSD",
            "com.c88.bingo",
            "com.gsn.android.casino",
            "air.com.bitrhymes.bingo",
            "com.kakapo.bingo",
            "air.com.sgn.bingo.google",
            "air.com.alisacasino.bingo",
            "com.etermax.bingocrack.lite",
            "air.com.buffalo_studios.newflashbingo",
            "com.fpinternet.ibingo",
            "com.absolute.bingo",
            "air.com.tinidreams.slots",
            "com.productmadness.bingomadness",
            "com.redhotlabs.bingo",
            "com.targa.bingo",
            "jp.gree.jband"
        ]
    },
    {
        "appId": "com.twelvegigs.heaven.bingo",
        "moreFromDev": [
            "com.twelvegigs.heaven.vpoker",
            "com.twelvegigs.heaven.lotto.hd",
            "com.twelvegigs.heaven.vpoker.hd",
            "com.twelvegigs.heaven.lotto",
            "com.twelvegigs.heaven.slots",
            "com.twelvegigs.heaven.bingo.hd"
        ],
        "reviews": [
            [
                "what a load of horse manure",
                "  have had to reintall 4 times and it just wont respond to anything i click on wtf..ya wanna sort it out right..uninstalling..sad really "
            ],
            [
                "Very poor ! Not worth playing .",
                "  Not worth playing now .Last update was awful .Now you have ruined the game by trying to make money out of us . NOT WON 1 GAME IN A FORTNIGHT !!!!! Pointless playing ..uninstalled ....game is ruined .. "
            ],
            [
                "Disappointed",
                "  Enjoy the game, VERY disappointed with having to use sooo many coins on the more difficult levels, BUT ONLY GET 2 extra coins for completing the level!! It's stupidity to play more than the first two levels unless you plan on PAYING to play EVERY TIME!!! "
            ],
            [
                "bad calls corrected in update",
                "  After the last update the bad calls have stopped in auto bingo. It seems to be working correctly. I still don't like that keys cost 100 coins but chests may only contain 5 coins. It should be at least even, lowest chest prize should be 100 coins. When you are trying to get a win only collectable you have to open all the chests and it gets costly.    original review After update when playing auto bingo it makes bad calls! calls bingo when there is not one. Then you can't finish the card. Also parts disappear sometimes. Really need to fix the update. "
            ],
            [
                "This game sucks! I won games and it wouldn't register them. It froze my ...",
                "  This game sucks! I won games and it wouldn't register them. It froze my phone when I tried to exit and I had to reboot. Uninstalling. So disappointed, I had to post this to tell you not to download it. "
            ],
            [
                "Its a fun game and a good time consumer",
                "  Love game jist wish it would give me all my coins when I win them lately I haven't been getting prize coins wondering why. "
            ]
        ],
        "similar": [
            "com.kakapo.bingo",
            "com.superluckycasino.scratchers.hd",
            "com.genina.android.blackjack.view",
            "com.topfreegames.sudoku",
            "com.ember.bingoSD",
            "com.superluckycasino.scratchers",
            "air.com.alisacasino.bingo",
            "air.com.bitrhymes.bingo",
            "com.dragonplay.wildbingo",
            "com.gsn.android.casino",
            "air.com.sgn.bingo.google",
            "com.etermax.bingocrack.lite",
            "air.com.buffalo_studios.newflashbingo",
            "com.fpinternet.ibingo",
            "jp.gree.jband",
            "com.tinidream.bingorun",
            "com.genina.android.blackjack.premium",
            "com.productmadness.bingomadness",
            "com.redhotlabs.bingo",
            "com.targa.bingo",
            "com.apostek.apps.pocketbingo"
        ]
    },
    {
        "appId": "com.brainium.solitairefree",
        "moreFromDev": [
            "com.brainium.spider",
            "com.brainium.solitaire",
            "com.brainium.freecell",
            "com.brainium.jumbline2free",
            "com.brainium.spiderfree",
            "com.brainium.jumbline2",
            "com.brainium.freecellfree"
        ],
        "reviews": [
            [
                "Always so much fun!!!",
                "  When you're stressed or in a mood, play this game. Never boring, always challenging, and fun! I look forward to it in between tedious chores & a \"time-out\" for a relaxation moment. "
            ],
            [
                "Cool",
                "  I grew up watching my grandmother play this game for hours and I inherited that from her the only thing that bothers me is of course the ads. It would also be nice to have a little bit more of an option to change the board and cards but otherwise keep me occupied for a while. "
            ],
            [
                "Great version",
                "  Love that you can just tap on the cards instead of dragging them. Also like the auto complete button when you've picked up all the cards faced down. "
            ],
            [
                "Fun and simple.",
                "  This particular game doesn't try to be over done. It is a straight forward game.  It has simple easy to understand directions and is fun to play.  :-) "
            ],
            [
                "Fantastic app",
                "  I love to play card's this is the best solitaire I've found, and I have played many different Apps. Keep up the games and I'll be happy! Thanks for a fun fun game!!! "
            ],
            [
                "Best solitaire",
                "  This app is so much fun, i keep playing again and again especially on the vegas mode with cumulative scoring on and never get tired....best solitaire app out there.. "
            ]
        ],
        "similar": [
            "com.tesseractmobile.solitairemulti",
            "com.kmagic.solitaire",
            "com.crimsonpine.solitairechampionhd.klondike",
            "com.softick.android.solitaire.klondike",
            "com.mobilityware.solitaire",
            "com.hapogames.solitaire",
            "com.magmamobile.game.Solitaire",
            "com.anoshenko.android.solitaires",
            "com.tesseractmobile.solitairefreepack",
            "net.runserver.solitaire",
            "com.magmamobile.game.SpiderSolitaire",
            "com.mobilityware.freecell",
            "com.anoshenko.android.fav_solitaires",
            "com.mobilityware.spider",
            "net.jeu.solitaire",
            "com.gosub60.solfree2"
        ]
    },
    {
        "appId": "com.dragonplay.wildbingo",
        "moreFromDev": [
            "com.dragonplay.slotcity",
            "com.dragonplay.farmcasino",
            "com.dragonplay.liveholdempro",
            "com.dragonplay.widget",
            "com.dragonplay.dragonplaypoker"
        ],
        "reviews": [
            [
                "Terrible game",
                "  Old farm slots was better. One spin a day for chump change. Anyone who rates this more than one star or is dumb enough to buy credits should have their head examined. "
            ],
            [
                "Wild Bingo",
                "  I like it so far I wish you could win more money to afford the price of the cards. Even with the wheel and the bonus balls it is still hard to play very many games. "
            ],
            [
                "A good game",
                "  This is a good game but needs to offer more coins everyday. It has some minor bugs that need to be worked out otherwise a fun time. I play on my droid mini and works fine. A great way to pass the time. "
            ],
            [
                "Great game..",
                "  I love playing bingo. It had a few glitches at first but I think you solved them. Very fun game "
            ],
            [
                "Awesome",
                "  This is by far the best bingo game yet, pity the coins run out so fast and you have to wait long for new coins. "
            ],
            [
                "Wild bingo",
                "  I LIKE PLAYING BINGO WHEN I WANT TO RELAX. THE NEW UPDATE I DONT LIKE. LOST POINTS MY OTHER GAME FARM CASINO IS NOW MIXED WITH IT. I LIKE TO PLAY MY GAMES SEPARATE, NOT SHARE POINTS OR DAILY BONUS. FIX THE BOO BOO. "
            ]
        ],
        "similar": [
            "com.fpinternet.ibingo",
            "com.ember.bingoSD",
            "com.targa.bingo",
            "air.com.bitrhymes.bingo",
            "com.kakapo.bingo",
            "com.gsn.android.casino",
            "air.com.sgn.bingo.google",
            "com.etermax.bingocrack.lite",
            "air.com.buffalo_studios.newflashbingo",
            "jp.gree.jband",
            "com.tinidream.bingorun",
            "com.productmadness.bingomadness",
            "com.redhotlabs.bingo",
            "air.com.alisacasino.bingo",
            "com.apostek.apps.pocketbingo",
            "com.absolute.bingo"
        ]
    },
    {
        "appId": "com.kiwifruitmobile.sudoku",
        "moreFromDev": [
            "com.kiwifruitmobile.wordssearch.view",
            "com.kiwifruitmobile.jingziqi",
            "com.kiwifruitmobile.solitaire"
        ],
        "reviews": [
            [
                "Great playability on Galaxy Note 2",
                "  Only one down side. Unable to connect to facebook. Can this bug be fixed in an update? "
            ],
            [
                "Clean and simple",
                "  I am enjoying the clean interface of the game. My only criticism is that the keypad to enter the numbers on my tablet is too smalland i keep hitting the wrong numbers. If yu addressed this then it would be a 5 star review. Thanks. "
            ],
            [
                "Great Game Hindered by Input",
                "  Absolutely fantastic levels. Truly creative. My only problem lies with the input. I feel that the game is made much harder through it. I find it takes a solid chunk of time to even annotate a few numbers. "
            ],
            [
                "Good...needs one improvement",
                "  I like the game, but I don't understand the ratings and numbers. A documenting page would be good. "
            ],
            [
                "Excellent!",
                "  I have been using this app for over 2 years now. I haven't been disappointed with it once. Simple, easy to use. Hours of fun. Nothing to complain about! "
            ],
            [
                "Good game",
                "  Good game, fun to play, challenging.  Just don't switch phones cause you lose ALL your scores.  Developer needs to make it possible to switch phones and keep your scores.  Also what is up with the high scores in the millions?  Impossible to reach that high!!! "
            ]
        ],
        "similar": [
            "com.apostek.SlotMachine",
            "com.dragonplay.slotcity",
            "com.magmamobile.game.SpiderSolitaire",
            "com.kmagic.solitaire",
            "com.coolandroidappzfree.freesudoku",
            "com.leftover.CoinDozer",
            "com.dragonplay.liveholdempro",
            "com.mobilityware.solitaire",
            "com.king.shootbubble",
            "com.genina.android.blackjack.view",
            "com.crossfield.numberplaceclassic",
            "com.kamagames.pokerist",
            "com.zynga.livepoker",
            "com.mobilityware.spider",
            "com.droidhen.game.poker",
            "com.softick.android.solitaire.klondike",
            "com.gameloft.android.ANMP.GloftUOHM"
        ]
    },
    {
        "appId": "com.diwip.vslots",
        "moreFromDev": "None",
        "reviews": [
            [
                "Bad game",
                "  You ruined the fun. You changed the betting, but did nothing to the wins. NO STARS "
            ],
            [
                "Slots",
                "  Just installed game, its pretty fun it has alot of different one to play "
            ],
            [
                "Love it!",
                "  Good payouts and easy to level up! "
            ],
            [
                "Frieda",
                "  This game is great love it. "
            ],
            [
                "Best Casino Slots",
                "  When I first started playing this game I wasn't getting all the coins I was winning. But I'm glad to say they are working on fixing the problem. So, I am giving this game a 5 star and would go higher if I could. I've tried other games and I can honestly say this is the Best!! "
            ],
            [
                ":-)",
                "  Fun an addictive but it would be better if u got $$ for leveling up , and just wish it didnt steal my $$ when changing games :( .. if those problems were fixed i would rate five stars ... "
            ]
        ],
        "similar": [
            "com.dragonplay.slotcity",
            "com.apostek.SlotMachine",
            "com.cervomedia.spw",
            "air.com.slotgalaxy",
            "wheel.slots.leetcom.com",
            "com.dragonplay.farmcasino",
            "com.ddi",
            "com.zentertain.slotsoriental",
            "com.pharaoh.slots.free",
            "com.mw.slotsroyale",
            "air.com.playtika.slotomania",
            "com.williamsinteractive.jackpotparty",
            "com.blueshellgames.luckyslots",
            "com.kakapo.slotsfarm",
            "jp.gree.jackpot",
            "com.zentertain.slotssagaclient"
        ]
    },
    {
        "appId": "com.sharkparty.slots",
        "moreFromDev": [
            "com.sharkparty.slots7"
        ],
        "reviews": [
            [
                "Excellent game.",
                "  I m addicted. I m zooming up the levels to unlock more games and can't bear to stop to cook a meal, so slimming a bit. Lol. I like the lucky seven best but they all have an in testing theme. So far its been free but I love it so much I might end up buying coins. "
            ],
            [
                "A rip off!!!!",
                "  It doesn't always recognise bonus wins and therefore you lose out on potential for a nice win. Never ever buy coins, it causes huge problems. Shark won't reply to e-mails.  All in all, very very dire "
            ],
            [
                "I really love this game. Great payouts. Problem is, I collect my dai",
                "  ly bonuses but the game subtracts that amount after 5 seconds. Been broke for a while so can't play often. Sometimes the bonus sticks to your account but most of the time it doesn't. Hope it works for you :-) "
            ],
            [
                "I love it..but no bonuses",
                "  I love the game..I've played it and on my old phone but now when I've installed it the bonuses are not working, which is very disappointing..this was my greatest pleasure in the game "
            ],
            [
                "Fun game",
                "  I have a blast on this game. Lots of fun to play. Only gripe is when the machines go down mid spin, this has happened 9 times and I lost the coins bet on those spins. Probably 250 coins worth. But since it ain't real money for me, it don't bother me much. Still a fun game. "
            ],
            [
                "Totally excellent!!",
                "  Great job on this app. Excellent graphics easy wins great payoffs, bonuses!!! Like I said excellent game, highly recommend and will be recommending this to all my friends that play the slots. TY "
            ]
        ],
        "similar": [
            "com.dragonplay.slotcity",
            "com.apostek.SlotMachine",
            "com.magmamobile.game.Slots",
            "com.gamelion.slots",
            "com.cervomedia.spw",
            "air.com.slotgalaxy",
            "wheel.slots.leetcom.com",
            "com.kakapo.freeslots",
            "com.casinogame.slots",
            "air.com.yazino.android.slots",
            "com.mw.slotsroyale",
            "air.com.playtika.slotomania",
            "com.williamsinteractive.jackpotparty",
            "com.ddi",
            "com.blueshellgames.luckyslots",
            "jp.gree.jackpot"
        ]
    },
    {
        "appId": "com.ludia.tpirslots",
        "moreFromDev": [
            "com.ludia.familyfeudandfriends.free",
            "com.ludia.jurassicpark",
            "com.ludia.millionairefree",
            "com.ludia.tpirdecades",
            "com.ludia.locomotors",
            "com.ludia.FifthGrader.free"
        ],
        "reviews": [
            [
                "THEY GOT ME!",
                "  I paid for the last collectible I needed to get my 600 coins. I never received them. I clicked on my daily coins that update evey four hours and I never got those either!!!! RIP OFFFFFF "
            ],
            [
                "Thanks for fixing the problem",
                "  Have been trying for a month to cash in on one game.  Every time I guess the price of the car, and I try to go back to game, it kicks me out of the game.  About to delete game.  It's VERY frustrating. Please let me know what is going on.  I love the game. "
            ],
            [
                "Its fun but i spend 50 000 and only win 2 000 most the ...",
                "  Its fun but i spend 50 000 and only win 2 000 most the time. Takes a while to save up to really play for 15 mins. If you push spin before you win total goes up its not added :/ sucks in big wheel because of timed to high up to uninstall "
            ],
            [
                "Update not good",
                "  I love this game but the update ruined it.  Twice in two days I haven't gotten my bonus coins when I tapped collect in the mailbox.  The payouts are not as good as they used to be.  And I really would like to know the percentage of how full the meter is for the Big Wheel on each slot; it used to show me but the update took it away for some unknown reason.  Please fix these issues and I will adjust my rating. "
            ],
            [
                "Surprisingly Great!",
                "  I don't know why I say that though. I guess it's coming to expect the normal, half-assed apps that are free. This one is lots of fun so far, and I've been playing for about half the day so far. Enjoy! "
            ],
            [
                "The Price is Right is Right on!",
                "  I love this game! It has all the bells and whistles and lots of flashing lights!!! Really fun to get the \"Big Win\" and play the Price is Right games. You won't be disappointed, unless you don't win.... "
            ]
        ],
        "similar": [
            "com.dragonplay.slotcity",
            "com.apostek.SlotMachine",
            "air.com.yazino.android.slots",
            "com.applab.pyra3",
            "com.cervomedia.spw",
            "air.com.slotgalaxy",
            "air.com.ludia.bettyboopslots",
            "wheel.slots.leetcom.com",
            "com.ddi",
            "com.fishsticksgames.SlotsJourney",
            "com.mw.slotsroyale",
            "com.magmamobile.game.Slots",
            "air.com.playtika.slotomania",
            "com.williamsinteractive.jackpotparty",
            "com.blueshellgames.luckyslots",
            "com.sava.flip_chip_poker",
            "jp.gree.jackpot",
            "com.zynga.slots.free"
        ]
    },
    {
        "appId": "com.wildec.pokerhouse",
        "moreFromDev": [
            "com.wildec.meet",
            "com.wildec.cr"
        ],
        "reviews": [
            [
                "give it a perfect score",
                "  Exactly what i Was looking for in a poker game "
            ],
            [
                "Amazing",
                "  Very fun...no bugs...great layout..easy to play. "
            ],
            [
                "Poorly fun",
                "  Loads of fun "
            ],
            [
                "Great app",
                "  I'm really enjoying playing poker on this app, you will too. "
            ],
            [
                "Very fun",
                "  Its a good game to pass time wit "
            ],
            [
                "Great app",
                "  Cool cool.cool "
            ]
        ],
        "similar": [
            "com.tinyco.poker",
            "com.geaxgame.pokerkingpro",
            "com.dragonplay.liveholdempro",
            "air.com.youdagames.google.ww.gop2MobileFree",
            "com.boyaa.fben",
            "com.gameloft.android.ANMP.GloftTHM2.ML",
            "com.pyrsoftware.pokerstars.net",
            "com.igg.pokerdeluxe",
            "com.zynga.livepoker",
            "com.ea.game.wsop_row",
            "com.hillsmobile.pokermania",
            "com.kamagames.pokerist",
            "com.hqin.headsup.Holdem",
            "com.droidhen.game.poker",
            "com.idlegames.eldorado",
            "com.dragonplay.dragonplaypoker"
        ]
    },
    {
        "appId": "com.idlegames.eldorado",
        "moreFromDev": "None",
        "reviews": [
            [
                "Aggravating.  Folds on you. Locks up.  Please fix",
                "  Please fix problems with locking up.  Folding you when you have a great hand.  I'm looking for a new one to download.  Unless you fix bugs. "
            ],
            [
                "Great game .. Freezing sometimes and folds me out of winning hands kind of ...",
                "  Great game .. Freezing sometimes and folds me out of winning hands kind of annoying but other than that great "
            ],
            [
                "when dont play for 2 days or more u get crap hands",
                "  I play 4 people and always missing chips and not just 1oo to1000 but also 1or 2 millions thats why im not playing every day i get to mad .Before i love it 5 stars easy so i would love my chips back and play everyday again.mebought27millions and2halfmillion plus more so i am spending money with freash deak poke so i hope u can fix the problem thank u got me a good one today send me a message to play so I do first hand I get 2 q,s so then I bet all up about 750,000 all I get is crap out of 5 cards what's that "
            ],
            [
                "Awesome game",
                "  Lots of fun being able to play poker with friends on the go. Chip purchase's are very reasonable and easy. Love the game! "
            ],
            [
                "Excellent Game",
                "  The graphics and avatars are awesome in this game. Everyday you get a small amount of free chips so you never run out. The game is very stable and never crashes. They also give you videos to watch for large amounts of chips and free downloads for chips. They have a lot of different ways to play from straight games to select your stakes. I'm hooked and play everyday. Get this one if you love poker you won't be disappointed. "
            ],
            [
                "Was great now I can't play",
                "  It keep giving me a cannot connect to game server message a soon as I click on the game can someone please fix this asap "
            ]
        ],
        "similar": [
            "air.com.idlegaming.slots",
            "air.com.youdagames.google.ww.gop2MobileFree",
            "com.geaxgame.pokerkingpro",
            "com.dragonplay.liveholdempro",
            "com.hillsmobile.pokermania",
            "com.boyaa.fben",
            "com.ea.game.wsop_row",
            "com.pyrsoftware.pokerstars.net",
            "com.igg.pokerdeluxe",
            "com.appeak.poker",
            "com.plarium.pokershark",
            "com.tinyco.poker",
            "com.kamagames.pokerist",
            "poker.hands.order",
            "com.zynga.livepoker",
            "com.droidhen.game.poker",
            "com.dragonplay.dragonplaypoker"
        ]
    },
    {
        "appId": "com.geaxgame.pokerkingpro",
        "moreFromDev": [
            "com.geaxgame.slotsmaster",
            "com.geaxgame.pokerkingvip",
            "com.geaxgame.pokerking"
        ],
        "reviews": [
            [
                "Poker!",
                "  If u like holdem.......u should've already downloaded this....just like Full Tilt! Yea u get the inexperienced ones that just reload they're\" 40\" chips.....so go play higher stakes where they're serious! "
            ],
            [
                "Good",
                "  Its a great game to pass the time and go against people they are not nice their trying to win u so get good cards "
            ],
            [
                "Great game but could fix the glitches. Its frustrating when you have built up ...",
                "  Great game but could fix the glitches. Its frustrating when you have built up your money them it kickes you out. It would be a 5 star if  you could get it fixed "
            ],
            [
                "System Hacked easy",
                "  There is new players with 3billion in coins on levels 2 and 3, when your a new player you only recieve 800 coins..also the administration is rude and they don't care..you get a auto response ..dear sir madam "
            ],
            [
                "Cannot cash in chips",
                "  good game but real cash game winners are not able to cash their chips in .There is no option to do this on the app and the other players have told me that if you can transfer chips to another player its up to them to pay you privately via paypal and the going rate is about a quarter of the official rate you are buying from the app ,crazy and pointless playing you will have to make a lot to break even "
            ],
            [
                "Great",
                "  I invited my friend, he signed up and it didn't give me my FREE 5,000 COINS! "
            ]
        ],
        "similar": [
            "com.tinyco.poker",
            "com.idlegames.eldorado",
            "com.dragonplay.liveholdempro",
            "com.boyaa.fben",
            "com.ea.game.wsop_row",
            "com.pyrsoftware.pokerstars.net",
            "com.igg.pokerdeluxe",
            "com.appeak.poker",
            "com.plarium.pokershark",
            "air.com.youdagames.google.ww.gop2MobileFree",
            "com.kamagames.pokerist",
            "poker.hands.order",
            "com.zynga.livepoker",
            "com.gameloft.android.ANMP.GloftTHM2.ML",
            "com.droidhen.game.poker",
            "com.dragonplay.dragonplaypoker"
        ]
    },
    {
        "appId": "com.mw.slotsroyale",
        "moreFromDev": [
            "com.mw.rouletteroyale"
        ],
        "reviews": [
            [
                "Great game",
                "  Generous payouts. Great images.  Love no blanks on the wheels.  Wonderful bonus round.  Fantastic game all around. "
            ],
            [
                "Fun & Games!!!",
                "  Great content, fun & easy play. Install this awesome application & enjoy!! "
            ],
            [
                "This is the  best slots app out there!",
                "  I just wish you could transfer balances to new device.  Its disheartening that one must begin a new history each time on changes hers/his device with this application.   The game has remained entertaining and, and  maintained its original integrity  while also integrating excellent user inspired ugrades. Could the developers experiment with the possibility of keeping a players bankroll and statistics from device to device.  Thank you! "
            ],
            [
                "Fun but",
                "  It's fun but the options are confusing and the screen moves too easily. Less eye busy and it would be more fun. Where is payout list "
            ],
            [
                "Use to...",
                "  Use to love it. What happened? Doesn't give you your money and after update lost all coins. Ads are distracting at the bottom, Move back to top. "
            ],
            [
                "Lots of freeze ups after first spin of reels but great game",
                "   "
            ]
        ],
        "similar": [
            "com.dragonplay.slotcity",
            "com.apostek.SlotMachine",
            "com.magmamobile.game.Slots",
            "com.gamelion.slots",
            "com.cervomedia.spw",
            "air.com.slotgalaxy",
            "com.mywavia.mwbb",
            "wheel.slots.leetcom.com",
            "com.kakapo.freeslots",
            "com.casinogame.slots",
            "com.mywavia.poker.android",
            "com.zentertain.slotsoriental",
            "air.com.playtika.slotomania",
            "com.williamsinteractive.jackpotparty",
            "com.ddi",
            "com.kakapo.slotsfarm",
            "com.blueshellgames.luckyslots",
            "jp.gree.jackpot",
            "com.mywavia.mwbj.android"
        ]
    }
]