[
{"category": "Arcade & Action",
 "company": "Trade Digital, Inc",
 "contentRating": "High Maturity",
 "description": "Trayvon is angry and nobody can stop him from completing his world tour of revenge on the bad guys who terrorize cities everyday. Use a variety of weapons to demolish Trayvons attackers in various cities around the world.As you complete a level, you will notice more bad guys coming at 
  at a faster pace and a deadlier attack.If you like to attack from far, then purchase the 'dagger' as you will be able to throw it at your enemies for the kill.  If you want to dominate the leaderboards across the world, then make sure you collect the money that the bad guys will drop once you kill them to increase your score.(This game is fiction and does not represent any real persons)",
 "id": "air.AngryTravonAndroid",
 "install": "100 - 500",
 "moreFromDev": "None",
 "name": "Angry Trayvon: Revenge",
 "price": 4.9,
 "rating": [(' 3 ', 0), (' 1 ', 8), (' 4 ', 0), (' 2 ', 0), (' 5 ', 3)],
 "reviews": [("Unfinished buggy game", "I pray the devloper is not just out to rip people off. If this is what he considers comple he is a scam artist. "),
             ("Truly distasteful, ignorant, & insensitive!",
              "  The people at Trade Digital Inc should truly be ashamed of themselves for creating such a disrespectful and insensitive game. It is never okay to capitalize on the murder of a person, especially a minor. The little blurb about the game being fiction id purely bullshit! Google should also be ashamed for allowing this game to be sold in the Play store! "),
             ("WTF!",
              "  So now Google joins the ranks of promoting the 'scary black man' meme.  Google and Trade Digital are racist assholes. "),
             ("Remove from Store",
              "  This game is distasteful and shameful. Google should be careful of the company they keep. This game should be pulled from the app store ASAP. "),
             ("So disrespectful",
              "  This is past disrespectful && google is wrong for even letting this happen.. I would never "),
             ("what the....",
              "  You should be ashamed of yourself .. this is a disgrace. Low down"),
             ("HORRIBLE!!!",
              "  Goggle should be ashamed of themselves! "),
             ("SHAME!",
              "  I think this is a terrible game and whoever made it should be ashamed of themselves! This is someone's child! This is not a game to them!! Smh. (this game is fiction my ***! ")],

 "screenCount": 2,
 "similar": ["com.rovio.angrybirdsspace.ads",
             "com.rovio.angrybirds",
             "com.rovio.BadPiggies",
             "com.flukedude.impossiblegamelevelpack",
             "com.rubicon.dev.gbwg",
             "com.rovio.amazingalex.premium",
             "com.rovio.angrybirdsseasons",
             "com.rubicon.dev.glwg",
             "com.rovio.angrybirdsfriends",
             "com.rovio.angrybirdsspace.premium",
             "com.rovio.angrybirdsspaceHD",
             "com.rovio.angrybirdsstarwarshd.premium.iap",
             "com.rovio.angrybirdsrio",
             "com.fde.avpevolution",
             "com.rovio.angrybirdsstarwars.ads.iap",
             "com.epicpixel.Grow"],
 "size": "10M",
 "totalReviewers": 11,
 "version": "1.0.0"}
 ]